{
  "films": [
    {
      "filename": "in-from-the-side.jpg",
      "title": "In from the Side",
      "description": "Fun film about a gay rugby team, but which featured absolutely no homophobia. It gets a high score from me because the main dude is so hot"
    },
    {
      "filename": "lonesome.jpeg",
      "title": "Lonesome",
      "description": "A bit over the top gay film set in Australia. This was my second ever Kino-cumshot"
    },
    {
      "filename": "banshees.webp",
      "title": "The Banshees of Inisherin",
      "description": "Deeply upsetting film about depression in rural Ireland. Very beautiful"
    },
    {
      "filename": "the-menu.jpg",
      "title": "The Menu",
      "description": "Didn't understand the point of this film. Why did she order a burger and why was it such a big deal"
    },
    {
      "filename": "blue-caftan.webp",
      "title": "The Blue Caftan",
      "description": "Lovely film set in Morocco about embroidery. Just lovely. Quite long"
    },
    {
      "filename": "futur-drei.jpg",
      "title": "Futur Drei",
      "description": "Delightful film about second generation Iranian kids in Germany. Eye opening"
    },
    {
      "filename": "past-lives.jpg",
      "title": "Past Lives",
      "description": "Great opening scene. Loved humanising the American ‘villain’ character. Memorable film"
    },
    {
      "filename": "dipped-in-black.jpg",
      "title": "Dipped in Black",
      "description": "Kinda boring depiction of transness in native American communities"
    },
    {
      "filename": "orlando.jpg",
      "title": "Orlando",
      "description": "So boring, a theatre type film about Virginia Woolf and trans people"
    },
    {
      "filename": "tar.jpg",
      "title": "Tár",
      "description": "Great music, compelling story. Weird and uncomfortable world of conducting orchestras. The film is way too long"
    },
    {
      "filename": "lucky-strike.jpg",
      "title": "Lucky Strike",
      "description": "Korean thriller, it was good but I was sleepy on a plane watching it. Not very memorable"
    },
    {
      "filename": "unbearable-weight.webp",
      "title": "The Unbearable Weight of Massive Talent",
      "description": "So cringe but I have to admit that I laughed a lot. It's a film about Nick Cage."
    },
    {
      "filename": "the-whale.png",
      "title": "The Whale",
      "description": "Devastating film. Ugly sobbing in the aeroplane. Watching him shovel in the food in such a self destructive way as a response to his self hatred is so painful "
    },
    {
      "filename": "roter-himmel.jpg",
      "title": "Roter Himmel",
      "description": "Mongay film where the main dude is so unlikeable and so rude to the other characters that it affects the enjoyment of the film "
    },
    {
      "filename": "super-mario.webp",
      "title": "The Super Mario Movie",
      "description": "Loved it. As a Nintendo fan this was a must watch. Why the fuck did they have licensed music in it"
    },
    {
      "filename": "el-houb.jpg",
      "title": "El Houb",
      "description": "Devastating esposé on homophobic Arabic culture in Morocco. A strong willed man is determined to make his family understand that gay is fine "
    },
    {
      "filename": "swimmer.jpg",
      "title": "The Swimmer",
      "description": "What's it like being gay in an Israeli swimming team? Not that inspiring"
    },
    {
      "filename": "grosse-freiheit.webp",
      "title": "Große Freiheit",
      "description": "This film totally stayed with me, even though the Austrian characters were hard to understand without subtitles. At the end when he goes cruising is very hard hitting"
    },
    {
      "filename": "bis-ans-ende.webp",
      "title": "Bis ans Ende der Nacht",
      "description": "Cool film about a trans woman and an interesting plot. Also quite forgettable"
    },
    {
      "filename": "mon-crime.jpg",
      "title": "Mon Crime",
      "description": "Fantastic lesbian nonsense! Delicious french film about women being successful"
    },
    {
      "filename": "asteroid-city.jpg",
      "title": "Asteroid City",
      "description": "Silly film leaning heavily into the vibes but was actually kinda boring to watch"
    },
    {
      "filename": "firebird.jpg",
      "title": "Firebird",
      "description": "What's it like to be gay in the Russian military, except they don't even speak Russian!"
    },
    {
      "filename": "concerned-citizen.jpg",
      "title": "Concerned Citizen",
      "description": "A film about gay men gentrifying a poor neighbourhood in Israel which hit me hard because I feel strongly about this topic"
    },
    {
      "filename": "heartbeats.png",
      "title": "Heartbeats",
      "description": "Film about a gay guy and a girl falling in love with the same hot guy. Some hilarious moments, highly enjoyable "
    },
    {
      "filename": "drifter.jpg",
      "title": "Drifter",
      "description": "This is about a boring countryside gay man becoming a Berlin queer. I really saw myself in him"
    },
    {
      "filename": "passages.webp",
      "title": "Passages",
      "description": "Like it's good, but I didn't enjoy it. Something about films with unlikeable main characters"
    },
    {
      "filename": "rotting.webp",
      "title": "Rotting in the Sun",
      "description": "Film about gay expats in Mexico, definitely saw myself in it. It was hilarious and wild. Loses tension a bit in the second half"
    },
    {
      "filename": "fallen-leaves.jpg",
      "title": "Fallen Leaves",
      "description": "Beautiful film about poverty in Finland. Has a heavy 60s/70s vibe but is in the present day"
    },
    {
      "filename": "burning-days.png",
      "title": "Burning Days",
      "description": "Small town Turkey with a pretty interesting plot. I enjoyed it. Gay themes"
    },
    {
      "filename": "beast-in-the-jungle.webp",
      "title": "The Beast in the Jungle",
      "description": "Cool view into a Paris nightclub over the years but didn't take away much else from this film"
    },
    {
      "filename": "where-butterflies.webp",
      "title": "Where Butterflies Don't Fly",
      "description": "Gay schoolteacher and pupil trapped in a cave together. Really well handled and suspenseful, enjoyable film"
    },
    {
      "filename": "golden-delicious.jpg",
      "title": "Golden Delicious",
      "description": "Cheesy American gay film nonsense"
    },
    {
      "filename": "arrete.jpg",
      "title": "Arrête Avec tes Mensonges",
      "description": "Boring film about an old french famous person who used to love a man"
    },
    {
      "filename": "unsterblich.jpg",
      "title": "Wir Werden Unsterblich Sein",
      "description": "Hilariously bad film from Saarland. A gay thriller with terrible acting and editing"
    },
    {
      "filename": "horseplay.jpg",
      "title": "Horseplay",
      "description": "Deeply harrowing film about lads on holiday. Explains the deep rooted homophobia in Argentina"
    },
    {
      "filename": "in-bed.jpg",
      "title": "In Bed",
      "description": "Really good film set almost entirely in a bedroom during a dramatic time about a hot gay guy who spirals downwards"
    }
  ]
}