{
  "films": [
    {
      "filename": "oppenheimer.avif",
      "title": "Oppenheimer",
      "description": "What a snooze fest. This film is for people who think they're smart. They all speak too quickly and it's too long."
    },
    {
      "filename": "all-of-us-strangers.webp",
      "title": "All of Us Strangers",
      "description": "Loved this film so much. A gay man's hot new relationship with Paul Mescal and his old relationship with his suspiciously young parents. Love love love "
    },
    {
      "filename": "millers.jpg",
      "title": "Miller's Girl",
      "description": "Bad film about an older guy and how he fancies a minor. So icky and horrible"
    },
    {
      "filename": "wikiriders.jpg",
      "title": "Wikiriders",
      "description": "Arty film about looking for rich guys in Mexico. The film feels unfinished because they apparently met him but couldn't show it for some reason"
    },
    {
      "filename": "all-shall.jpg",
      "title": "All Shall be Well",
      "description": "Stunning film about older lesbians in Hong Kong. I cried and cried"
    },
    {
      "filename": "huellos.jpg",
      "title": "La Huella de unos Labios",
      "description": "Sexy Mexican film about an alternative covid pandemic reality. Interesting but also pretty random"
    },
    {
      "filename": "anatomy.jpg",
      "title": "Anatomy of a Fall",
      "description": "Thrilling, gripping film about a murder trial in France. Insane"
    },
    {
      "filename": "human-voice.jpg",
      "title": "The Human Voice",
      "description": "Short film with Tilda Swinton being dramatic on the phone. It's so good"
    },
    {
      "filename": "strange-way.jpg",
      "title": "A Strange Way of Life",
      "description": "Short film about gay cowboys. Pedro Pascal's in it and it's fucking great"
    },
    {
      "filename": "love-is-the-devil.jpg",
      "title": "Love is the Devil",
      "description": "Film about Francis Bacon, hated it and hate him"
    },
    {
      "filename": "liuben.jpg",
      "title": "Liuben",
      "description": "A sad gay film about Roma people in Bulgaria. Eye opening"
    },
    {
      "filename": "paradis.jpg",
      "title": "Le Paradis",
      "description": "Pretty boring gay film about a youth detention centre in France. One cool part where he freestyle rapped but even that felt out of place"
    },
    {
      "filename": "like-it-is.jpg",
      "title": "Like it is",
      "description": "Interesting older gay film with some brutal scenes. Pretty forgettable"
    },
    {
      "filename": "challengers.jpg",
      "title": "Challengers",
      "description": "Very sexually charged film about tennis. I found it a bit cringe but it had its moments"
    },
    {
      "filename": "women.jpg",
      "title": "The Women",
      "description": "Old film about women fawning around, it was pretty entertaining"
    },
    {
      "filename": "wedding-banquet.jpg",
      "title": "The Wedding Banquet",
      "description": "Hilarious, wild film about a man in a gay relationship marrying a woman for a green card"
    },
    {
      "filename": "lose-your-head.jpg",
      "title": "Lose Your Head",
      "description": "Set in Berlin! Wasn't too bad. About gays and murder"
    },
    {
      "filename": "problemista.jpg",
      "title": "Problemista",
      "description": "Silly film about a difficult person and how hard it is to emigrate to the US. Light hearted and easy to watch. A pleasure"
    },
    {
      "filename": "crossing.jpg",
      "title": "Crossing",
      "description": "Amazing and eye opening story about a Georgian women meeting a community of trans women in Istanbul. Highly recommend"
    },
    {
      "filename": "love-lies-bleeding.jpg",
      "title": "Love Lies Bleeding",
      "description": "Watching this with a cinema full of lesbians was hilarious. It's brutal and hilarious"
    },
    {
      "filename": "patagonia.jpg",
      "title": "Patagonia",
      "description": "Gay film in Italy pretty different to your average Mongay. Has a wild scene where he pisses on him."
    },
    {
      "filename": "danced.jpg",
      "title": "And Then We Danced",
      "description": "What’s it like to be gay as a Georgian traditional dancer? All the usual tropes"
    },
    {
      "filename": "milk-serial.webp",
      "title": "Milk and Serial",
      "description": "Very unpleasant watch, about youtube pranksters, a topic I struggle with"
    },
    {
      "filename": "porn-film-festival.jpg",
      "title": "Dan Savage's Porn Film Festival",
      "description": "A collection of 25 porn films 5 minutes or less. Fantastic, changed my whole outlook on sex. Life changing"
    },
    {
      "filename": "oldboy.jpg",
      "title": "Oldboy",
      "description": "Pretty wild film about being imprisoned for many years and finally getting out. Pretty grim, also pretty silly "
    },
    {
      "filename": "smiley-face.webp",
      "title": "Smiley Face",
      "description": "Hilarious stoner comedy, a bit on the nose but great to watch someone just being so utterly distressed by events. Loved it"
    },
    {
      "filename": "garcons.jpg",
      "title": "Des Garçons de Province",
      "description": "Pretty plain gay film at Mongay but I enjoyed the different vibe to your standard gay film "
    },
    {
      "filename": "deep-queer.jpeg.jpeg",
      "title": "The Deep Queer Massacre",
      "description": "Hilarious horror film with a bunch of gays getting picked off one by one in the countryside by an evil trans lady. Loved it"
    },
    {
      "filename": "mamantula.webp",
      "title": "Mamantula",
      "description": "Horror film about a man-spider who eats people after sucking their dicks. Investigation by Spanish speaking lesbian detectives in Berlin. So good for so many reasons, loved it so much"
    },
    {
      "filename": "sunflower.jpg",
      "title": "Sunflower",
      "description": "At Mongay, I love sunflowers but this is just trope-y bullshit with cuts to a sunflower field. Very plain"
    },
    {
      "filename": "anora.jpeg",
      "title": "Anora",
      "description": "Fascinating, thrilling film about a sex worker. I was on the edge of my seat the whole time, highly recommend"
    },
    {
      "filename": "blair-witch.jpg",
      "title": "The Blair Witch Project",
      "description": "Watched this while taking mushrooms thinking it would be scary but it was actually mainly suspenseful and fun. Too many Americans "
    },
    {
      "filename": "paprika.avif",
      "title": "Paprika",
      "description": "Watched this anime film while taking mushrooms thinking it would be trippy and fun but it was just a series of dream sequences without much connecting story. Frustrating watch with a really unpleasant sexual assault scene."
    },
    {
      "filename": "senador.jpg",
      "title": "El Senador",
      "description": "Hilariously bad film set in Brazil, watched at Mongay. Acting so bad it's good. Great moment when the cinema audience gasped at the twist"
    },
    {
      "filename": "comte-de-monte-cristo.webp",
      "title": "Le Comte de Montecristo",
      "description": "Surprisingly great! Some nonsense in there but is there anything really quite like revenge porn?"
    },
    {
      "filename": "wallace-and-gromit.jpg",
      "title": "Wallace and Gromit: Vengeance Most Fowl",
      "description": "Delightful kids film with lots of funny tropes and references"
    },
    {
      "filename": "pretty-woman.avif",
      "title": "Pretty Woman",
      "description": "Rewatched this banger film. Great soundtrack and great vibes. I would also sell my body for Richard Gere"
    }
  ]
}