{
  "games": [
    {
      "name": "Outer Wilds: Echoes of the Eye",
      "vibes": "",
      "gameplay": "",
      "review": [
        "Yep my favourite game this year was a DLC. I implore all my followers to play this game and to do it blind. It's fascinating and terrifying, and unlike anything else you've played"
      ],
      "image": "outer-wilds-echoes.jpg",
      "platform": "PS5"
    },
    {
      "name": "Metroid: Dread",
      "vibes": "",
      "gameplay": "",
      "review": [
        "Another terrifying and excellent game. The feeling when you have to go into another killer robot zone 😱. Samus has never been as badass as this"
      ],
      "image": "metroid-dread.jpg",
      "platform": "Switch"
    },
    {
      "name": "Subnautica",
      "vibes": "",
      "gameplay": "",
      "review": [
        "I was really blown away by this game. Imagine landing on a planet and there's only water and this destroyed ship. The feeling when you go deeper underwater and discover new alien shit is amazing"
      ],
      "image": "subnautica.jpg",
      "platform": "PS5"
    },
    {
      "name": "WarioWare: Get It Together",
      "vibes": "",
      "gameplay": "",
      "review": [
        "This series will always have a special place in my heart. I love the very specific Wario humour. It's just got so many toilet jokes and I love it. Also it's the most fun to play in the series by far"
      ],
      "image": "warioware-get-it-together.jpg",
      "platform": "Switch"
    },
    {
      "name": "Deltarune: Chapter 2",
      "vibes": "",
      "gameplay": "",
      "review": [
        "Toby Fox blew it out of the water again. This only takes 3 hours or so to complete and it was such a lovely time. Plus soundtrack, of course. I love \"A CYBER'S WORLD\""
      ],
      "image": "deltarune-2.png",
      "platform": "PC"
    },
    {
      "name": "Disco Elysium",
      "vibes": "",
      "gameplay": "",
      "review": [
        "It's a slow burner, I have to admit that it's one of the very best stories/writing I've ever seen in a game. Somehow the game made me think giving drugs to a child would be a good idea. My tip is to not play the switch port!"
      ],
      "image": "disco-elysium.jpg",
      "platform": "Switch"
    },
    {
      "name": "Xenoblade Chronicles: Definitive Edition",
      "vibes": "",
      "gameplay": "",
      "review": [
        "As part of my nintendo education, this was definitely necessary! I really enjoyed my time with the game, and it has the best locations and setting ever. It also has a lot of nonsense though"
      ],
      "image": "xenoblade.jpg",
      "platform": "Switch"
    },
    {
      "name": "Axiom Verge",
      "vibes": "",
      "gameplay": "",
      "review": [
        "A small, clean, indie metroidvania. Really enjoyed it. I was just super impressed with some of the really clever upgrades you can get. Been meaning to play the second one too"
      ],
      "image": "axiom-verge.png",
      "platform": "Switch"
    },
    {
      "name": "Abzu",
      "vibes": "",
      "gameplay": "",
      "review": [
        "I'm normally not into arty farty games, but I love fish and sea life so this one was great. The perfect chill out game. Soundtrack has Ecco the Dolphin vibes"
      ],
      "image": "abzu.jpg",
      "platform": "PS5"
    },
    {
      "name": "Super Mario 3D World + Bowser's Fury",
      "vibes": "",
      "gameplay": "",
      "review": [
        "The base game is such a good party game with the right group. I played it online with some old friends and it was awesome. Bowser's Fury was a short but really fun romp"
      ],
      "image": "mario-3d.jpg",
      "platform": "Switch"
    },
    {
      "name": "Ring Fit Adventure",
      "vibes": "",
      "gameplay": "",
      "review": [
        "Borrowed this from a friend when I was losing motivation for those lockdown home workouts. It's great if you need motivation, although the workouts themselves aren't as good"
      ],
      "image": "ringfit.jpg",
      "platform": "Switch"
    },
    {
      "name": "Fez",
      "vibes": "",
      "gameplay": "",
      "review": [
        "A really cool puzzle game that I got totally into. Soundtrack is by Disasterpeace who also did Hyper Light Drifter, and it's both harsh and peaceful"
      ],
      "image": "fez.png",
      "platform": "Switch"
    },
    {
      "name": "Frostpunk",
      "vibes": "",
      "gameplay": "",
      "review": [
        "I average one new management sim game each year and this time I played this winter-themed survival game. I very rarely play PC games but it's good and addicting"
      ],
      "image": "frostpunk.jpg",
      "platform": "PC"
    },
    {
      "name": "A Short Hike",
      "vibes": "",
      "gameplay": "",
      "review": [
        "I loved this. It looks like a DS game!? So good. Love the soundtrack. Love the animal crossing/BOTW vibes. I would complain it's too short but it's literally called a Short Hike"
      ],
      "image": "shorthike.jpg",
      "platform": "Switch"
    },
    {
      "name": "Inside",
      "vibes": "",
      "gameplay": "",
      "review": [
        "Hard to describe what this game is but I enjoyed it a lot. One of those games that makes you feel something. Ending is really cool"
      ],
      "image": "inside.png",
      "platform": "PS5"
    },
    {
      "name": "Bugsnax",
      "vibes": "",
      "gameplay": "",
      "review": [
        "First game I played on my new playstation. Unashamed to admit I played it because my favourite band (kero kero bonito) did the theme song. Pretty cute game, although the story is a bit forced"
      ],
      "image": "bugsnax.png",
      "platform": "PS5"
    },
    {
      "name": "Horizon: Zero Dawn",
      "vibes": "",
      "gameplay": "",
      "review": [
        "A BEAUTIFUL and gorgeous-looking game. I haven't found the time to come back to it after finishing the first area. I'm scared of the robots and lost motivation when I got stuck on some hard missions"
      ],
      "image": "horizon.jpg",
      "platform": "PS5"
    },
    {
      "name": "Rocket League",
      "vibes": "",
      "gameplay": "",
      "review": [
        "A lockdown party game with old friends. It's a lot of fun and honestly can totally recommend if you want to reconnect with specifically two other friends by playing online"
      ],
      "image": "rocket-league.jpg",
      "platform": "PS5"
    },
    {
      "name": "New Pokémon Snap",
      "vibes": "",
      "gameplay": "",
      "review": [
        "The gameplay of this game is great, although I got frustrated from having to replay the same courses over and over again. It also has that “generic” nintendo pokemon polish which takes away the soul"
      ],
      "image": "pokemon-snap.jpg",
      "platform": "Switch"
    },
    {
      "name": "Captain Toad: Treasure Tracker",
      "vibes": "",
      "gameplay": "",
      "review": [
        "This game is great for a while, but it didn't take me too long to realise that puzzles of these kind can only have so much depth. Finding the solution is always easy when the scope is so small"
      ],
      "image": "captain-toad.jpg",
      "platform": "Switch"
    },
    {
      "name": "Bug Fables",
      "vibes": "",
      "gameplay": "",
      "review": [
        "This game has some heart, which I appreciate, but I just found it quite boring It tries to be Paper Mario a little too much, as doesn't really make its own “bug fables” identity"
      ],
      "image": "bugfables.jpg",
      "platform": "PS5"
    },
    {
      "name": "Eastward",
      "vibes": "",
      "gameplay": "",
      "review": [
        "The presentation is 10/10, but it's trying way too hard to be Mother 3. The writing isn't good enough. Each cutscene leads me not understanding what's going on, despite pressing A through tons of dialogue. Lots of missed opportunities in the story."
      ],
      "image": "eastward.jpg",
      "platform": "Switch"
    },
    {
      "name": "Pokemon: Brilliant Diamond",
      "vibes": "",
      "gameplay": "",
      "review": [
        "Nostalgia fueled my playthrough; otherwise, I have to say it's a bad game! Why no platinum dex? Was pokemon always this easy? The most fun I had was using Metronome with my Clefairy."
      ],
      "image": "pokemon-diamond.jpg",
      "platform": "Switch"
    },
    {
      "name": "Fire Emblem: The Binding Blade",
      "vibes": "",
      "gameplay": "",
      "review": [
        "In my quest to complete all the games of all the smash characters, I had to tackle this obscure fan translation of FE6. Not gonna lie it's shit game and not nearly as good as FE7."
      ],
      "image": "fireemblem-6.jpg",
      "platform": "GBA"
    },
    {
      "name": "Xenoblade Chronicles 2: Torna The Golden Country",
      "vibes": "",
      "gameplay": "",
      "review": [
        "Having enjoyed XB1, and with Pyra coming to smash, I decided to come back to this DLC but I just couldn't get through it. Characters in XB2 are so badly designed and this one boss was randomly super difficult. A real struggle, this game."
      ],
      "image": "xenoblade-torna.jpg",
      "platform": "Switch"
    }
  ]
}
