{
  "games": [
    {
      "name": "Outer Wilds: Echoes of the Eye",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "My favourite game this year was a DLC. Outer Wilds was already insanely mind-bending and amazing, and this DLC totally matches it. This is equally as good as the main game!",
        "I implore all my followers to play this game and to do it blind. It's fascinating and terrifying, and unlike anything else you've played.",
        "The vibe is a little more horror than the base game. 'A little more horror' I say, I was the one with my heart BEATING playing through those certain sections. I was genuinely breathless, terrified. When I thought about the game while I was at work, I would get scared thinking about it! It took so much emotional strength to get through the Starlit Cove. After writing that sentence I went and looked at someone play through Starlit Cove and I got scared again!! It's a terrifying game!!"
      ],
      "image": "outer-wilds-echoes.jpg",
      "platform": "PS5"
    },
    {
      "name": "Subnautica",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Imagine you crash land on a planet covered in water and the only thing there is the massive spaceship you came on, crashlanded really far away. It's a strong image! After putting out the initial fire in your escape pod, you need to somehow survive on an underwater alien planet! It's so cool!",
        "I was really blown away by this game. The fish and the plants all look so cool. You're lucky to start in a shallow area, with the land almost poking out of the water to form an island but not quite. After you explore the immediate area, you have to go to deeper waters and let me tell you, diving deeper is fucking terrifying! Never have I felt the true terrifying power of big open spaces, deep black water beneath you, losing sight of the light hitting the surface. It's fucking terrifying.",
        "Then there's actually a whole story to the game that you slowly uncover as you explore more. It's so fascinating and cool. I loved this game so much."
      ],
      "image": "subnautica.jpg",
      "platform": "PS5"
    },
    {
      "name": "Metroid: Dread",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "A terrifying and excellent game. The feeling when you have to go into another killer robot zone 😱. I am very weak when it comes to horror, and video game horror is just a next level for me because you have to actually escape!",
        "Luckily, the is much more than that, it's also a huge vibe. Samus is so badass it hurts, and the planet looks so good. There's a great twist half way through for Metroid fans."
      ],
      "image": "metroid-dread.jpg",
      "platform": "Switch"
    },
    {
      "name": "Deltarune: Chapter 2",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "Toby Fox blew it out of the water again. This only takes 3 hours or so to complete and it was such a lovely time. It has that same dark vibe to it as undertale and the first deltarune, and it also manages to bring new ideas. Particularly impactful is the focus on the controlling relationship in the Snowgrave route.",
        "Plus the soundtrack, of course. I love \"A CYBER'S WORLD\" so much."
      ],
      "image": "deltarune-2.png",
      "platform": "PC"
    },
    {
      "name": "Disco Elysium",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "It's a slow burner, but I have to admit that it's one of the very best stories/writing I've ever seen in a game.",
        "The setting? An under-funded town in some empire where everything reeks of sleaze. You are a detective who has a terrible reputation and a drinking problem. You start the game by apologising after you crashed your police car. Luckily, an actual capable detective comes to be your partner, Kim Kitsuragi. He is such a babe and I would die for him.",
        "The game is really great for forcing you to look at things with another perspective. Like when you get asked about your politic views, you get absolutely lambasted for being a centrist, it's very eye-opening. The things you'll end up doing in this game are crazy. Somehow the game made me think giving drugs to a child would be a good idea.",
        "My tip is to not play the switch port, because the loading times are insanely long."
      ],
      "image": "disco-elysium.jpg",
      "platform": "Switch"
    },
    {
      "name": "WarioWare: Get It Together",
      "vibes": "9",
      "gameplay": "9",
      "review": [
        "This series will always have a special place in my heart. I love the very specific Wario humour. It's just got so many toilet jokes and I love it. Also it's the most fun to play in the series by far. I really enjoyed the mechanic with the playing with characters, I think it worked amazingly."
      ],
      "image": "warioware-get-it-together.jpg",
      "platform": "Switch"
    },
    {
      "name": "Fez",
      "vibes": "9",
      "gameplay": "8",
      "review": [
        "A really cool puzzle game that I got totally into. I love puzzle games. And especially when they have so many layers like this one. This totally defined a genre of ultra hard indie puzzle games.",
        "The soundtrack is by Disasterpeace who also did Hyper Light Drifter, and it's both harsh and peaceful. A great vibe all around."
      ],
      "image": "fez.png",
      "platform": "Switch"
    },
    {
      "name": "A Short Hike",
      "vibes": "10",
      "gameplay": "6",
      "review": [
        "I loved this. It looks like a DS game!? So good. Love the soundtrack. Love the animal crossing/BOTW vibes. I would complain it's too short but it's literally called a Short Hike. I've replayed it like three times it's that good."
      ],
      "image": "shorthike.jpg",
      "platform": "Switch"
    },
    {
      "name": "Xenoblade Chronicles: Definitive Edition",
      "vibes": "8",
      "gameplay": "8",
      "review": [
        "As part of my Nintendo education, this was definitely necessary! I really enjoyed my time with the game, and it has the best locations and setting ever. The whole things takes place on the body of a massive monster that became a bit statue. All sorts of shit happens, including a lot of nonsense.",
        "It was really long and I do wish it wasn't that long. But I was engaged enough to keep going all the way to the end."
      ],
      "image": "xenoblade.jpg",
      "platform": "Switch"
    },
    {
      "name": "Axiom Verge",
      "vibes": "8",
      "gameplay": "7",
      "review": [
        "A small, clean, indie metroidvania. Really enjoyed it. I was just super impressed with some of the really clever upgrades you can get. Been meaning to play the second one too."
      ],
      "image": "axiom-verge.png",
      "platform": "Switch"
    },
    {
      "name": "Abzu",
      "vibes": "10",
      "gameplay": "5S",
      "review": [
        "I'm normally not into arty farty games, but I love fish and sea life so this one was great. The perfect chill out game. Soundtrack has Ecco the Dolphin vibes. Great to smoke weed to."
      ],
      "image": "abzu.jpg",
      "platform": "PS5"
    },
    {
      "name": "Super Mario 3D World + Bowser's Fury",
      "vibes": "6",
      "gameplay": "7",
      "review": [
        "The base game is such a good party game with the right group. I played it online with some old friends and it was awesome. I remember enjoying the original with friends in much the same way back then and this was such as great.",
        "Bowser's Fury was a short but really fun romp!"
      ],
      "image": "mario-3d.jpg",
      "platform": "Switch"
    },
    {
      "name": "Ring Fit Adventure",
      "vibes": "8",
      "gameplay": "5",
      "review": [
        "Borrowed this from a friend when I was losing motivation for those lockdown home workouts. It's great! I love the vibe of Wii Fit and this takes it further. The ring itself is pretty good, the overhead squeeze exercise is so hard.",
        "It's not nearly as good as an actual trip to the gym, but it'll do if there's another pandemic. It's also insanely long, and despite genuinely doing loads of workouts with it, I only got through half of the worlds."
      ],
      "image": "ringfit.jpg",
      "platform": "Switch"
    },
    {
      "name": "Frostpunk",
      "vibes": "4",
      "gameplay": "8",
      "review": [
        "I average one new management sim game each year and this time I played this winter-themed survival game. This was good and addicting! I really enjoyed how it was about just crisis after crisis and trying to just make it through. The main storyline has the temperature drop and drop until there in an insane storm. The relief when you make it through to the other end is amazing!"
      ],
      "image": "frostpunk.jpg",
      "platform": "PC"
    },
    {
      "name": "Inside",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "Hard to describe what this game is but I enjoyed it a lot. A very dark and düster vibe as you make your way through some horrible factory. One of those games that makes you feel something. The ending is really cool."
      ],
      "image": "inside.png",
      "platform": "PS5"
    },
    {
      "name": "Bugsnax",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "First game I played on my new playstation. Unashamed to admit I played it because my favourite band (Kero Kero Bonito) did the theme song. I like the vibe and the game and characters are pretty cute. I do think it's all a bit forced though. I reckon the game could have benefitted from being more fucked up."
      ],
      "image": "bugsnax.png",
      "platform": "PS5"
    },
    {
      "name": "Horizon: Zero Dawn",
      "vibes": "6",
      "gameplay": "6",
      "review": [
        "A BEAUTIFUL and gorgeous-looking game. At first I was put off by it, also because I was scared of the dinosaurs, but I came back to it later and completed it. The story is really nice, although it's got this triple A video game sheen all over it which I don't like. It feels like I'm playing a video game, not that I'm actually a hunter warrior lady who shoots arrows at robot dinosaurs."
      ],
      "image": "horizon.jpg",
      "platform": "PS5"
    },
    {
      "name": "Rocket League",
      "vibes": "2",
      "gameplay": "6",
      "review": [
        "A lockdown party game with old friends. It's a lot of fun and honestly can totally recommend if you want to reconnect with specifically two other friends by playing online.",
        "Definitely not a fan of the micro-transactions and monetisation. Fuck that shit."
      ],
      "image": "rocket-league.jpg",
      "platform": "PS5"
    },
    {
      "name": "New Pokémon Snap",
      "vibes": "3",
      "gameplay": "5",
      "review": [
        "The gameplay of this game is alright, although I got frustrated from having to replay the same courses over and over again. It also has that “generic” nintendo pokemon polish which takes away the soul in this case.",
        "I'm disappointed about the graphics, honestly, and even though they put more energy into it than your average pokemon game, it still kinda looks shit. For a photography game that is no longer on the N64, I want some next level graphics."
      ],
      "image": "pokemon-snap.jpg",
      "platform": "Switch"
    },
    {
      "name": "Captain Toad: Treasure Tracker",
      "vibes": "5",
      "gameplay": "4",
      "review": [
        "This game is great for a while, but it didn't take me too long to realise that puzzles of these kind can only have so much depth. Finding the solution is always easy when the scope is so small. I think the game overstayed its welcome a little."
      ],
      "image": "captain-toad.jpg",
      "platform": "Switch"
    },
    {
      "name": "Bug Fables",
      "vibes": "6",
      "gameplay": "4",
      "review": [
        "This game has some heart, which I appreciate, but I just found it quite boring. It tries to be Paper Mario a little too much, and doesn't really make its own “bug fables” identity. I wish it just had that special X factor which elevates some games over the rest. I don't even have specific feedback I just didn't vibe with it I guess."
      ],
      "image": "bugfables.jpg",
      "platform": "PS5"
    },
    {
      "name": "Eastward",
      "vibes": "7",
      "gameplay": "3",
      "review": [
        "The presentation is 10/10, but it's trying way too hard to be Mother 3. The writing isn't good enough. Each cutscene leads me not understanding what's going on, despite pressing A through tons of dialogue. Lots of missed opportunities in the story. I was quite disappointed and overwhelmed. I was happy when it was over."
      ],
      "image": "eastward.jpg",
      "platform": "Switch"
    },
    {
      "name": "Pokemon: Brilliant Diamond",
      "vibes": "2",
      "gameplay": "4",
      "review": [
        "Nostalgia fueled my playthrough. Otherwise, I have to say it's a bad game! Why no platinum dex? Was pokemon always this easy? The most fun I had was using Metronome with my Clefairy.",
        "I will say that in this team I had a Lickilicky, and it's when I got my strange obsession with that Pokemon. It's just so ugly!",
        "Overall this game is a huge disappointment, because the original is so special and this is a soulless version of it. Talk about games not being made with love."
      ],
      "image": "pokemon-diamond.jpg",
      "platform": "Switch"
    },
    {
      "name": "Fire Emblem: The Binding Blade",
      "vibes": "3",
      "gameplay": "1",
      "review": [
        "In my quest to complete all the games of all the smash characters, I had to tackle this obscure fan translation of FE6. Not gonna lie it's shit game and not nearly as good as FE7.",
        "In the end, I didn't complete it. I got halfway through, but I was playing on an emulator and when I changed my phone I accidentally corrupted my save file. I really don't want to start it again because it's quite long and not very fulfilling. I decided that being FE7 is enough for the challenge because it features Roy as a baby boy at the end. Maybe I don't need to force myself to play bad games just for this random challenge I want to do."
      ],
      "image": "fireemblem-6.jpg",
      "platform": "GBA"
    },
    {
      "name": "Xenoblade Chronicles 2: Torna The Golden Country",
      "vibes": "1",
      "gameplay": "1",
      "review": [
        "Having enjoyed XB1, and with Pyra & Mythra coming to smash, I decided to come back to this DLC but I just couldn't get through it. The characters in XB2 are so badly designed it hurts. The writing is also bad. And they changed the battle system so I have to learn even more random things. And this one boss was randomly super difficult so I changed the difficulty to easy which made it really boring. A real struggle, this game."
      ],
      "image": "xenoblade-torna.jpg",
      "platform": "Switch"
    }
  ]
}
