{
  "games": [
    {
      "name": "Tunic",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Similar to my favourite game the last two years, Outer Wilds, in this game you progress by gathering more knowledge as you play. It's so good, guys. It's such a satisfying game. I'm still thinking about it months later, it's my favourite game this year for sure",
        "You play as a cute little fox and you have to figure out what on earth you're meant to be doing by discovering little clues as you go. It's got so many moments where you slap your knee and go 'ooooohhhhh! That's what that's for!'. And it keep escalating and escalating.",
        "The soundtrack is also perfect. An electronic vibe, almost like you're playing inside a simulation. I listen to the soundtrack on the regular it's that good."
      ],
      "image": "tunic.jpg",
      "platform": "PS5"
    },
    {
      "name": "Inscryption",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "As a lover of Slay the Spire, I was drawn to this story-driven card game. Yes it's creepy, but let me tell you it's worth your time. Don't read too much about it, just go in and enjoy all the twists the story has to offer - it's actually not as terrifying as it looks, and the game has SO MUCH to offer."
      ],
      "image": "inscryption.jpg",
      "platform": "PC"
    },
    {
      "name": "Castlevania: Symphony of the Night",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Went back and played one of the classics and boy do I love it. This year I also played some more Castlevania but this is far and away the best one. It's so fun and I love the 18th Century setting.",
        "The music is amazing! How many metroidvanias have you played with actual classical music in it? And has any game ever nailed this dramatic, classy vibe like this before? Those character portraits are insane! I can only imagine how hype it must have been back then when you realise you don't play as Richter, but instead an actual vampire Alucard? So sick. Even the way he moves is just so cool. The whole game is so cool."
      ],
      "image": "castlevania-sotn.jpg",
      "platform": "PS1"
    },
    {
      "name": "Omori",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "This game was made with love. It's a story about being a recluse. It's very beautiful and the general vibe of the game with its presentation and music is top-notch. It's got that Earthbound energy which I always subscribe to. It's totally worth your time.",
        "There's a battle system with emotions, a pleasant combination of pixel art and hand-drawn aesthetics, a fun soundtrack, and an upsetting ending. What more could you want?"
      ],
      "image": "omori.png",
      "platform": "Switch"
    },
    {
      "name": "Everhood",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "This is a banger game. It's a rhythm game (always love a rhythm game) with a story & vibe which is undeniably similar to Undertale. If you're craving that kind of wacky, dark story along with very imaginative design and a cracking soundtrack, I highly recommend it.",
        "Some of the later challenges are actually impossible but I guess you have to leave something for the tryhards."
      ],
      "image": "everhood.png",
      "platform": "Switch"
    },
    {
      "name": "Paradise Killer",
      "vibes": "10",
      "gameplay": "5S",
      "review": [
        "Alright I'll straight up say that this game isn't a GOOD game per se... but I still rank it high because I love the vibe, the look, the music. If you don't have time to play this visual novel, I forgive you, but do take the time to listen to the soundtrack. Both the OST and the 'B-Sides' are great and available on the streaming service of your choice.",
        "I was kinda annoyed about the ending. I have an opinion about how it should have gone down and I want to talk about it but I need at least one other friend to have played this so I can discuss."
      ],
      "image": "paradise-killer.jpg",
      "platform": "Switch"
    },
    {
      "name": "Chicory: A Colorful Tale",
      "vibes": "9",
      "gameplay": "6",
      "review": [
        "I came because I'm a massive Lena Raine fan and she did the soundtrack. The game is surprisingly good for a painting game! All the characters are named after food items and I named myself Aubergine which I thoroughly enjoyed the whole game.",
        "There were some cheesy nonsense moments, but the vibe was consistently good the whole time. I do recommend it!"
      ],
      "image": "chicory.png",
      "platform": "PC"
    },
    {
      "name": "Elechead",
      "vibes": "8",
      "gameplay": "9",
      "review": [
        "This is a super fun 3 hour platforming experience. It's a super tight, well designed little package of fun. Each puzzle makes you feel like a superstar for beating it, it's so satisfying. Give it a try!"
      ],
      "image": "elechead.jpg",
      "platform": "Switch"
    },
    {
      "name": "Slice & Dice",
      "vibes": "4",
      "gameplay": "8",
      "review": [
        "It's a mobile game! Yep. Worth it. It's a super well designed little dice-based roguelike, and I got really into it this year. You can just jump in and play for a little bit at a time, and it scratches that Slay the Spire itch.",
        "I didn't get the achievement where you have to win like two ultra-hard runs in a row. That is actually impossible and I was annoyed that I couldn't neatly complete the game 100%."
      ],
      "image": "slice-and-dice.jpg",
      "platform": "Mobile"
    },
    {
      "name": "Kirby and the Forgotten Land",
      "vibes": "",
      "gameplay": "",
      "review": [
        "This is a great kirby game! Perfect for playing with your partner. Co-op kirby is such a pleasure. It's very cute!",
        "I'm impressed that they came up with the name Mouthful Mode and just made a kirby game out of it. OK I guess it's actually just more of the same Kirby as we know. One thing I appreciate about Kirby games is how it's all happy slappy until the final boss, which is consistently some kind of world-devouring cosmic horror. This game definitely doesn't disappoint in that regard."
      ],
      "image": "kirby-forgotten-land.jpg",
      "platform": "Switch"
    },
    {
      "name": "Elden Ring",
      "vibes": "10",
      "gameplay": "4",
      "review": [
        "I gave this game, a very different kind of game for me, a good go! I recognise that it's amazing, not least because of the amazing vibe. The first area looks so stunning with the cloudy stormy sky over the lit-up landscape, and the magical elements of the huge golden trees. This world was created with a vision and I appreciate that.",
        "But the game has multiple barriers of entry. There's Margit, who I of course had no chance against. Luckily, a friend told me about a quest I should do somewhere near the beginning, and that was great because I got a +8 spear out of it, which made me super powerful. I also enjoyed using the spear at a weapon. I used that spear to get me through Margit and also two other big bosses.",
        "Rennala was a huge struggle, even though the vibes of her magic academy and boss fight in general were immaculate, because the +8 spear was no longer enough to carry me through the game. I managed to finally beat her and I did feel that sense of accomplishment that Dark Souls fans don't shut up about, but when I realised that I need to learn how to either upgrade the spear or start with another weapon, and also when I realised that I invested my levelled up stats all wrong, I lost interest.",
        "The second barrier of entry is learning the stats and mechanics of the game, and that shit is not well communicated in the game. I feel like you need to have the implicit knowledge from previous FromSoft games or a friend to teach you this stuff. Or you spend ages reading the wiki, which for me a red flag when it comes to video games.",
        "So sorry, Elden Ring fans, I didn't get into it. But I you can't tell me I didn't try, I mean I beat Rennala."
      ],
      "image": "elden-ring.jpg",
      "platform": "PS5"
    },
    {
      "name": "Xenoblade Chronicles 3",
      "vibes": "8",
      "gameplay": "4",
      "review": [
        "I gave up this game during chapter 4! I feel bad about it because I made it through Xenoblade 2 when it first came out and genuinely enjoyed it, and thought that Xenoblade 1 was super good. But this one is just so MUCH! There are 6 characters all screaming out their catchphrases constantly, and there's so much going on that I can't concentrate. Sometimes I start a fight and have to put the switch down because it's all too much.",
        "I have tried two times to resume the game because I'm told chapter 5 is really good, but it's really hard to get back into it again, because I can't remember any of the systems. And those characters are just all so loud. I do kinda like the characters this time round though, especially Eunie, who is a total babe.",
        "Also is it just me or are the environments not as amazing as the first two games? Maybe I haven't figured out what's going on with the land (there's normally a big overarching explanation for this stuff) but where is wow-factor that I got from the Kingdom of Uraya? Or Satorl Marsh? Hmm maybe I should try to start playing again. I think would have to do it together with a Xenoblade fan who can help me. I think I'm stuck on a difficult boss fight. Maybe I should reduce the difficulty."
      ],
      "image": "xenoblade-3.jpg",
      "platform": "Switch"
    },
    {
      "name": "Persona 5: Royal",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "This game so fucking long. Jesus Christ. It doesn't need to be this long. For some reason I completed all of this one. It was a great game for the first 40 hours or so but my dumbass finished all 100 hours out of pure spite. When I finally beat a literal God and then had to do the 'royal' content I was so pissed. I was like, it's not over???",
        "I will say that the vibes are immaculate, the soundtrack is class, 'Last Surprise' never gets old somehow, and Kasumi is cute. I don't normally do the anime stuff normally but I did enjoy all the nonsense. Akechi and Joker's moments together were so gay. And at one point they go to Hawaii which is hilarious."
      ],
      "image": "persona-5.jpg",
      "platform": "PS5"
    },
    {
      "name": "Scarlet Nexus",
      "vibes": "7",
      "gameplay": "4",
      "review": [
        "I was jamming to this OST for months before I decided to give the game a spin. It's pretty middle of the road in terms of gameplay, especially for me as I'm not a hack & slash fan. But I love games with good vibes and this one has a great vibe and I enjoyed it. I liked the design of the main characters and had a crush on the guy."
      ],
      "image": "scarlet-nexus.jpg",
      "platform": "PS5"
    },
    {
      "name": "Valheim",
      "vibes": "7",
      "gameplay": "5",
      "review": [
        "I had the pleasure of sharing a Valheim server with my friend Falco and his buddies. My little computer didn't have the strength to properly compute this game but I still enjoyed building a little house and riding the boat with some cool dudes. I know that this isn't my thing really but it reminded me that playing online games co-op with friends is just a lot of fun."
      ],
      "image": "valheim.jpg",
      "platform": "PC"
    },
    {
      "name": "Boomerang Fu",
      "vibes": "5",
      "gameplay": "6",
      "review": [
        "A super fun party game on switch to enjoy with your friends and family. It's got similar vibes to Towerfall, which is great. It's not the best or anything but still worth your time and money for sure. It will entertain a group for an hour or so!"
      ],
      "image": "boomerang-fu.jpg",
      "platform": "Switch"
    },
    {
      "name": "Psychonauts 2",
      "vibes": "5",
      "gameplay": "4",
      "review": [
        "Playing this game reminded me of games which feel like I've paid for some content and am now receiving that content. I made it through to the end but it didn't make me feel much. Maybe I would have enjoyed it more if I were a child. I think I liked the first one because I was younger when I played it."
      ],
      "image": "psychonauts.png",
      "platform": "PS5"
    },
    {
      "name": "Gorogoa",
      "vibes": "7",
      "gameplay": "5",
      "review": [
        "This is a little puzzle game that you can breeze through in one sitting. It's good!"
      ],
      "image": "gorogoa.jpg",
      "platform": "Switch"
    },
    {
      "name": "Super Castlevania 4",
      "vibes": "7",
      "gameplay": "2",
      "review": [
        "It's my goal to complete the games that all the smash characters are from and to that end I got the Castlevania collection on switch. This game is great but it's hard as balls. I was only able to complete it because I used save states.",
        "It's nice to see some castlevania classics here, but it's not even a metroidvania, rather just a series of hard-as-nails platforming challenges. Music is great though."
      ],
      "image": "castlevania-4.jpg",
      "platform": "SNES"
    },
    {
      "name": "Castlevania",
      "vibes": "5",
      "gameplay": "1",
      "review": [
        "Decided to take the time to save-scum my way through the OG Castlevania in honour of the OG Simon Belmont. Even harder than the other one but had to do it for my education. I don't recommend this game."
      ],
      "image": "castlevania-nes.jpg",
      "platform": "NES"
    },
    {
      "name": "Castlevania: Rondo of Blood",
      "vibes": "6",
      "gameplay": "1",
      "review": [
        "I wanna play all the games from all the smash characters so I had to play Richter's game. I had to get a separate collection on playstation for this one, which is fine except that this one doesn't come with save states, so I actually got straight up stuck against Death. I couldn't beat him so I gave up."
      ],
      "image": "castlevania-rondo.jpg",
      "platform": "PS1"
    },
    {
      "name": "Kirby's Dream Buffet",
      "vibes": "4",
      "gameplay": "2",
      "review": [
        "It was a fun time playing this online with friends! However it doesn't have too much depth as a game and we only played it once."
      ],
      "image": "kirby-dream-buffet.jpg",
      "platform": "Switch"
    },
    {
      "name": "Spiritfarer",
      "vibes": "6",
      "gameplay": "1",
      "review": [
        "I do enjoy a peaceful game with good vibes only and this is that. I didn't see it through to the end however because the gameplay loop didn't hook me in. It looks great though. You can fish off the end of the boat and just doing that is the highlight of the game."
      ],
      "image": "spiritfarer.jpg",
      "platform": "Switch"
    },
    {
      "name": "Mario Strikers: Battle League",
      "vibes": "6",
      "gameplay": "2",
      "review": [
        "A great party game when you have the full 8 players. We had a great time with it and the animations for the characters are fun. However there isn't much meat on the bones. I don't think it's worth buying, it wouldn't be fun on your own, but maybe I'm just bitter because I'm not a football fan."
      ],
      "image": "mario-strikers.jpg",
      "platform": "Switch"
    },
    {
      "name": "Rain World",
      "vibes": "9",
      "gameplay": "7",
      "review": [
        "This is a survival game with some of the craziest enemy AI I've ever seen. There is this whole ecosystem of creatures that have their own lives. You really feel like prey in a world of predators. Like the enemies are never in the same place when you respawn you have to be constantly alert.",
        "I recognise that this is a good game. However, I found it so fucking terrifying that I had to stop playing. The monsters were so scary and sometimes it would start raining and jesus christ. The rain, and those horrible birds that pick you off, it's just all very upsetting and I decided to stop.",
        "If you are strong, you can play this and join the chorus of people who say it's amazing."
      ],
      "image": "rainworld.jpg",
      "platform": "Switch"
    },
    {
      "name": "Pokémon Legends: Arceus",
      "vibes": "2",
      "gameplay": "5",
      "review": [
        "I hate to be that bitch but I couldn't enjoy this game because the graphics were so bad. And I resented how the pokemon would sit around in groups and do nothing. It was better in pokemon snap when they actually did stuff. As usual, this Switch Pokemon game would have been better if they spent more time making it. So much wasted potential!",
        "I support them trying new things but can't they just wait 3 years between releases so they can actually release a good game which actually has some vibes."
      ],
      "image": "pokemon-arceus.png",
      "platform": "Switch"
    },
    {
      "name": "Wandersong",
      "vibes": "2",
      "gameplay": "2",
      "review": [
        "It's a game about singing but it was really boring! I thought you couldn't really go wrong if your premise was to sing to solve puzzles but yep, I switched off pretty quickly."
      ],
      "image": "wandersong.jpg",
      "platform": "Switch"
    },
    {
      "name": "LISA: The Painful",
      "vibes": "2",
      "gameplay": "1",
      "review": [
        "I'm sure this game is good... but it just has such a horrible vibe. It's miserable and it was upsetting me too much. I admit I didn't get very far into the game but I already knew that this would be nothing for me."
      ],
      "image": "lisa.jpg",
      "platform": "PC"
    },
    {
      "name": "Pac-Man World: Re-Pac",
      "vibes": "2",
      "gameplay": "1",
      "review": [
        "Oh boy, this is a genuinely bad game. It didn't age very well. For some reason I completed it... it's that part of me that wants to play all the games of smash characters. By the end I was incredulous that a) it was real and b) I was still playing it.",
        "Tragically, this game had a lot of influence on Pac-man's design in Smash. It's incredible that they actually remade this game."
      ],
      "image": "pacman.jpg",
      "platform": "Switch"
    },
    {
      "name": "Sports Story",
      "vibes": "0",
      "gameplay": "1",
      "review": [
        "This game is straight up unfinished. It's almost embarrassing! It's a technical mess. Golf Story was such a banger with such clean gameplay, so what went wrong? Why does golf have fewer features and why is the whole thing so glitchy and unpolished? I feel bad for the studio because they clearly bit off more than they could chew with this game. It's probably enough to prevent them from making new games in the future. Pretty sad."
      ],
      "image": "sports-story.jpg",
      "platform": "Switch"
    },
    {
      "name": "Loop Hero",
      "vibes": "2",
      "gameplay": "0",
      "review": [
        "I picked it up because it looked innovating and new. But it's almost like they didn't think their loop concept through enough! It felt unbalanced and pointless. Why is there even a loop?"
      ],
      "image": "loop-hero.jpg",
      "platform": "Switch"
    },
    {
      "name": "Unpacking",
      "vibes": "1",
      "gameplay": "0",
      "review": [
        "Do not play this game. It's literally just work. You pay money for a “game” where you have to unpack things from boxes. Who actually enjoys doing that. This isn't how you tell a story. Don't buy it."
      ],
      "image": "unpacking.png",
      "platform": "Switch"
    }
  ]
}
