{
  "games": [
    {
      "name": "Metroid Prime Remastered",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Decided to start off my year by replaying this absolute banger of a game. I really recommend this to anyone who hasn't played it. It's a timeless and wonderful game which really is more puzzle than action. Samus is a badass, and the vibes of the game are immaculate. She is totally alone on an alien planet and has to deal with a bunch of bullshit and take down this insane monster by herself, and she does it because she's fucking Samus. I really enjoyed reliving the soundtrack, and this time I particularly vibed with the music from <a href=\"https://www.youtube.com/watch?v=wNp-gXZ7hy4\">Phendrana Drifts Depths</a>.",
        "This remake on the Switch is so fucking good. I'm not normally paying attention to performance and technical stuff, but I read that this game is kind of a miracle - it looks insanely good and also runs super smoothly at 60fps. The boys and girls at Retro Studios much be super experts at making video games, and the new Metroid Prime game is definitely gonna be so fucking good. I just need to know what they were working after they finished Donkey Kong Country. It's driving me crazy.",
        "I am still pissed about this one chozo artifact though. Had to look up the thing with the tower, super lame!"
      ],
      "image": "metroid-prime.webp",
      "platform": "Switch",
      "year": "2025",
      "release": "2023"
    },
    {
      "name": "Isles of Sea and Sky",
      "vibes": "9",
      "gameplay": "9",
      "review": [
        "After I fell in love with Void Stranger last year and then found myself drawn to Block Koala no less when playing UFO 50, it finally hit me that I fucking love block puzzle games! Like puzzle games in general are totally my shit and specifically these sukopan-style games slap so hard.",
        "This one is special because there is a whole world full of puzzles that you can walk around freely. If a puzzle is too difficult, you can just find something else to do and come back to it. This is great most of the time, but this game does have power ups which make certain puzzles possible, and sometimes when I'm tackling a tough puzzle I doubt myself whether I'm just too dumb to solve it, or if I actually need to collect a power-up from somewhere else first. It's led to a couple of moments of frustration, but it's totally forgivable given how good the puzzles are.",
        "Soundtrack is fab as well!"
      ],
      "image": "isles.webp",
      "platform": "PC",
      "year": "2025",
      "release": "2024"
    },
    {
      "name": "Case of the Golden Idol",
      "vibes": "9",
      "gameplay": "9",
      "review": [
        "This is a detective game! You have a short moment in time and you have to collect all the evidence and then fill in the gaps in the story, Obra Dinn style. It's so good!",
        "There is a bunch of these scenes and you get to see this wild overriding story over the course of many years. Great vibes and really fun to finally get the answer."
      ],
      "image": "golden-idol.avif",
      "platform": "Switch",
      "year": "2025",
      "release": "2022"
    },
    {
      "name": "Rift of the NecroDancer",
      "vibes": "7",
      "gameplay": "10",
      "review": [
        "What made the original, Crypt of the Necrodancer, so special was that it was something entirely new, a dungeon crawling roguelike rhythm game. Fucking sick. So when I saw this sequel I was sceptical because it's just a plain old rhythm game. Nonetheless I like me a rhythm game and it's a been a while so I got it and it's so good. This might be the most polished rhythm game I've ever played.",
        "It's hard as nails, but also so reasonable! The timings are forgiving, and there's this system where you lose health if you get hit by an incoming monster, so if you don't press the right button in time. But if you press the wrong button at any given point, you don't lose health, instead you lose your combo. So it means that you can kind of mash on the difficult bits, and at first this bothered me, but it just means that you can get through the levels without dying, just with a low score. So you can kinda play the game how you want, going for the high score or not. Going for the high score is insanely difficult but those leaderboards are tempting me, that's for sure.",
        "When I accidentally started a song on hard mode near the start, I was so shook. You're meant to be able to follow all that?? But by the end of playing through the story, I got so good at the game. Things which seemed impossible like those jumping harpies, I've totally got down now. I just needed to practice them and the songs they come in. I've since gone through and beaten (almost) everything on hard mode and it feels great. It feels so good to get good at the game, and this game lets you do that. The progression through the track is pretty great for that.",
        "There are some other things like minigames and bosses, but they're nothing compared to the actual core gameplay, it's all about the normal rhythm game stuff. I will say there is a really cool thing in 'remix mode' which randomises the monsters, so you kinda have serious replayability. And the difficulty levels will keep you going for a long time.",
        "I will admit, in terms of vibes, there is another rhythm game which has this beat: Everhood. Everhood had an actually fascinating story, lots of funny and wacky nonsense and all around great vibes. This game is far more generic in terms of presentation, and the story is actually a joke. I would have loved some funny writing. But at least the music is good! I didn't love the heavy metal tracks because I'm just not a fan of the genre, but also because they tended to be too fast, making reactions really hard. But most of the tracks were delightful. Personal favourites were from 'Sam Webster' and 'Nick Nausbaum'."
      ],
      "image": "rift.jpg",
      "platform": "Switch",
      "year": "2025",
      "release": "2025"
    },
    {
      "name": "Kuru Kuru Kururin",
      "vibes": "7",
      "gameplay": "8",
      "review": [
        "Jack and I played this on the Switch online on a whim having smoked a bunch of weed and it was fucking great. You play as a tiny alien that drives a constantly rotating spaceship flying through tight gaps. You have to time your passage through all these tight spots and obstacles so that your rotating arms doesn't hit the walls. It's a totally novel concept and I can't imagine why it didn't take off.",
        "It's very tricky, for sure, but it isn't impossibly hard. I managed to beat the game, even if Star Land is fucking bullshit. I learned at the end that you can customise your paddle as well, they totally should have communicated that earlier on."
      ],
      "image": "kuru.webp",
      "platform": "Gameboy Advance",
      "year": "2025",
      "release": "2001"
    },
    {
      "name": "CLICKOLDING",
      "vibes": "9",
      "gameplay": "3",
      "review": [
        "This game is terrifying in a way I have never experienced before. This game is a sex thing. I straight up don't recommend it, unless you're interested in real weird shit. I really liked it though I won't lie. I definitely can't stop thinking about it."
      ],
      "image": "clickolding.webp",
      "platform": "PC",
      "year": "2025",
      "release": "2024"
    },
    {
      "name": "Split Fiction",
      "vibes": "3",
      "gameplay": "6",
      "review": [
        "This is a co-op game 100% designed for you and your partner to play together on the couch. The game features two characters who develop a friendship throughout the game and I imagine they thought it would a great way for people to bond while playing the game. I don't think achieves it though. Firstly because the game has a 3D camera, a double jump and a air-dash, and multitasking - it's hard for people who don't know how to play games. Secondly because the vibes are off. Let's talk about the vibes.",
        "The premise is good: two female writers are trapped in their own made-up stories and have to escape. It's both sci-fi and fantasy and the worlds are great. Actually there are tons of great ideas in general, especially in terms of gameplay mechanics. But the two characters are so insufferable it hurts. One of them is happy-go-lucky and the other is sarcastic and rude. And as I learned playing the Final Fantasy 7 Rebirth, it drives me insane to see characters who have no social skills. This bitch Mio is so rude it blew me away. You are literally trapped in a fantasy land with a stranger and you don't take a moment to appreciate your never-seen-before surroundings or the fact that magic exists and just talk about it! If I were Zoe I would be pissed.",
        "Then as the story goes on, the girls inevitably become friends in the most trope-y and predictable way possible. The writing is just so annoying. It's clearly a game for normies! The bonding on the couch really becomes laughing at the game instead of laughing with the game very quickly. For a game with so many great ideas, it's a shame they put no time into the story. Also there is absolutely no lesbian energy."
      ],
      "image": "split-fiction.jpg",
      "platform": "Xbox Gamepass",
      "year": "2025",
      "release": "2025"
    },
    {
      "name": "Miitopia",
      "vibes": "9",
      "gameplay": "1",
      "review": [
        "The reason I played this game is because somebody left its physical cartridge at a Smash tournament and didn't pick it up. It's definitely not the kind of game I would willingly buy, although I do have an appreciation for the Wii-era Nintendo Mii vibe, and I did play Tomodachi Life back then on the DS.",
        "This game is totally fucked up and I cannot recommend it in good conscious. It's a turn based RPG, although there is little to no strategy, and all the characters fight on their own, not really requiring your input. Playing this game you quickly realise it's not about gameplay, it's about the relationships between all the Miis you create. They all have little personalities and are very sassy with one another, early animal crossing style. I have it say, it's funny as fuck. I can really imagine this being hilarious if you take mushrooms. The sheer amount of nonsense is just insane.",
        "I spent a ridiculous amount of time at the start of the game making a bunch of high quality Miis, and realised that there are so many NPCs in the game, and you can make Miis for them all. I just felt invested because these Miis were all so good, I couldn't just drop the game, even if there isn't really a game here. So I would progress, and every now and then, another one of my horrible creations would turn up and it would just be hilarious.",
        "My main character is a drag queen called Stacy (pictured here) and what can I say I love her. She is a popstar, and is getting very close to deadly warrior Nikita (pictured next to her). I enjoy it when they fight together in battle because I've invested so much in their relationship. Recently they started fighting and I was genuinely upset about it. Luckily, the horse that you befriend some ways into the game broke up the fight.",
        "I thought I gave up on the game but somehow I keep coming back. It's really good for when you're in a call with friends and you want to chat and not be distracted, since the game is just pressing A over and over."
      ],
      "image": "miitopia.jpg",
      "platform": "Switch",
      "year": "2025",
      "release": "2021"
    },
    {
      "name": "UFO 50",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Holy crap, is this game real? Dear visitors to this website, please consider dropping everything and buying this collection of 50 arcade games for the low price of 20 euros. You have to understand, this isn't just any old collection of NES/arcade-style games, these are all brand-new games! They've been developed with modern game design philosophy and ALL of the games are bangers. All 50 of them!",
        "This collection has everything: platformers, puzzle games, action games, top down strategy, RPGs, and plenty of wacky, hard-to-define-genre games as well. Each of them bring something new to the table, to the point where most of them could be expanded into their own indie games and they would be fucking great. Inevitably, not every game will be for everyone, but that's the beauty of UFO 50 - everyone can find something that suits their tastes in there, and everyone will also end up trying out different kinds of games that they would otherwise never touch.",
        "Personally I love puzzle games so I was delighted when the very first game I picked happened to be a block puzzle game called Block Koala. I got so into block koala and although I recognise why most people wouldn't rate the game very high, I totally clicked with it and very quickly 100%ed it. Camouflage was another banger puzzle game, so good.",
        "Other highlights for those who are interested were definitely Rail Heist, Vainger, Mortol 2, Night Manor, Party House and Hyper Contender. Block Koala still #1 though, maybe it's because it was the first one I picked. Feels like Block Koala and I have a special bond.",
        "One last thing I wanted to point out: this game has a huge and incredible chiptune soundtrack! Many of the tracks are even microtonal, which is something you hear almost never in video games. Hugely inspired and hugely inspiring. I couldn't pick a single recommendation so enjoy the <a href=\"https://youtu.be/O-5JriuYm8s?feature=shared\">banger start-up music<a>."
      ],
      "image": "ufo50.png",
      "platform": "PC",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Void Stranger",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Wow this game is the best puzzle game I've ever played. There is so much going on it's insane! It may look like a Gameboy game but let me tell you it is the most engaging game ever, not just for its satisfying puzzling gameplay. It's also absolutely drowned in secrets, lore, amazing characters, twists and turns, and 10/10 music.",
        "Similar to Outer Wilds or Tunic, you'll want to go into this game blind! Because you can progress using knowledge and skills, not with power ups or stuff like that. As you first start making your way through the puzzles, you will be blind to all the things on your screen. But at some point something will click and you'll have a moment where you say to yourself ‘hold on... there's more to this than I thought'.",
        "The vibe is on point. The music is so good. Please listen to the music of the first area. It, like many tracks, loops only after a very long time, and goes through many stages and sections, never getting boring. The imagery in the game is insane too.",
        "If you play it, please send me a message and we can talk about how good it is together!"
      ],
      "image": "void.jpg",
      "platform": "PC",
      "year": "2024",
      "release": "2023"
    },
    {
      "name": "Balatro",
      "vibes": "9",
      "gameplay": "10",
      "review": [
        "Holy crap I finally did it, I found a game that lives up to Slay the Spire. Now that I finally beat the heart on A20 which every character, I felt good about putting StS down and it was around this time that I picked up Balatro. It's so addicting. I love getting exactly the right card you need for the moment. The higher difficulties are super hard! I know I'm going to be playing this for a long time... at least until Slay the Spire 2 comes out next year.",
        "I'm also into the hypnotic music that plays - they really made a great vibe with the game too. It's great because I enter in an obsessive trance, just looking for the the numbers to go higher and higher as my eyes glaze over."
      ],
      "image": "balatro.png",
      "platform": "Switch",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Paper Mario: The Thousand Year Door (Switch Remake)",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "Holy moly is this a dream come true? I loved this game when I was younger and they've only gone and made it even better. The first and most important thing to talk about is the insane glow-up that the soundtrack got. It has truly gotten the Origami King treatment and I mean that in the best possible way. They've added new tracks, new variations of existing tracks, and boldly updated the old favourites which is almost always tasteful and successful. The battle theme has multiple variations depending on the region you're in and it's touches like that which turn a good game into a special game. You're in a mysterious off-colour forest and run into an enemy? Consider the vibe MATCHED.",
        "I will say that they added an Erhu (a very recognisable Chinese string instrument) to the Glitz pit music and it honestly sounds a bit off. In my opinion they should have gone for more of a lucha libre/WWE vibe but whatever it still sounds good.",
        "Another amazing update is the new expressions and animations all the characters have. Still the same as the original and yet injected with flair and love and care. Gameplay-wise they nerfed Power Bounce which thinking about it is probably a good thing. Some of the later boss battles can't be cheesed with it anymore.",
        "The OG game is so strong that you really can't go wrong and yet still my expectations were exceeded. The locations, the characters, the humour, the VIBE, it's all great, and absolute bonus it's a lot of fun to play too.",
        "I loved beating this game. I don't have the time that I used to for these things so I did it in little bursts. I even completed chapter 6 while on an overnight train! And beating the final boss was difficult just like I remember, but this time you can skip the cutscenes!!"
      ],
      "image": "paper-mario-ttyd.avif",
      "platform": "Switch",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Metroid Fusion",
      "vibes": "10",
      "gameplay": "8",
      "review": [
        "Compared with other Metroid games this one is different but the same. The same because you're metroidvania-ing around just like Zero mission or Super Metroid, fighting similar bosses, living your normal life. Gameplay-wise I did think to myself, this game is just like the others. But that's not a bad thing, it's a great formula.",
        "What it does differently is the vibe. This game is way more of a horror game than other ones - you can see where the blueprint for Metroid Dread is. There are some genuinely horrible & creepy moments. The first time you see the SA-X, or when you encounter a certain someone encased in ice, the introduction of one of the bosses towards the end where you first see its corpse... It's so good. Terrifying. The music really adds to it as well.",
        "It's way more linear in the sense that this computer tells you what to do at any point but I really appreciated that because I didn't enjoy in Super metroid how sometimes you had to decide on your own to go to a completely different sector to progress. It still left many things open in many cases so I still felt super smart finding my way around a lot of the time. There were like two points where I had to look up the answer because to be fair it was completely ridiculous. This one hole you have to find in the water sector is just so dumb, and the comments on the youtube video which shows the whole made me feel better about looking it up."
      ],
      "image": "metroid-fusion.webp",
      "platform": "Gameboy Advance",
      "year": "2024",
      "release": "2002"
    },
    {
      "name": "13 Sentinels: Aegis Rim",
      "vibes": "9",
      "gameplay": "9",
      "review": [
        "Daaaaamn this game is wild! It's a visual novel unlike any other, and honestly worth checking out for the innovative way it tells a story alone. You have 13 whole-ass protagonists who all have intricately interconnected lives and stories, and you get to follow all their journeys in any order you like. Octopath Traveler, eat your heart out! Unlike that stiff storytelling with 8 entirely separate stories, hear all the characters interact and it is so exciting. I admit that it relies on some of those classic anime tropes a lot, but I allow it because the actual story is so wild and unpredictable. It's got all these great plot twists and because you decide what order to learn about them, discovering them makes it feel like YOU figured it out, or that you stumbled onto some juicy information that you shouldn't have found already. Delicious.",
        "It also has some real time strategy gameplay to mix up all the dialogue scenes which looking back were quite refreshing and nice. I didn't enjoy it so much when playing them, especially at the start, but actually they weren't too bad, and by the end I was getting quite good at it. Focus of this game is on the incredible and absolutely wild story though. Highly recommended."
      ],
      "image": "13-sentinels.jpg",
      "platform": "Switch",
      "year": "2024",
      "release": "2019",
      "story": true
    },
    {
      "name": "Animal Well",
      "vibes": "10",
      "gameplay": "8",
      "review": [
        "This game has such a strong vibe it's insane. Everything is bioluminescent and dripping with water and it just looks so fucking rad. I love that you play as a tiny blob which can neatly fit through every gap. It's very polished and I respect that (just before this I played Cassette Beasts which is a bit of a technical mess so the contrast was there).",
        "This game has little to no background music which shocked me at first, because I am a lover of video game music. But it didn't take long for me to understand that that is crucial to the vibe of the environment. The sound design is super good even without the music - there is so much going on in terms of water dripping sounds, ambient noises, squelchy sounds as you move, it makes it all sound so real. And without the music it does give it that lonely metroid vibe. And on the occasions where music does play, it hits hard because of it. Interesting choice and although I'm a little upset because I'm sure a game with this vibe and colour scheme would have a beautiful twinkly soundtrack, I understand that not having music goes a long way to set this game apart from all the other super similar metroidvanias.",
        "This game is super similar to other metroidvanias, like it gave me heavy Axiom Verge vibes, which isn't a bad thing. It's got some very creative power-ups which are delightful, and focuses more on puzzle solving than combat, which I personally really appreciate. But there's another game which this clearly takes lots of inspiration from: Fez. Fez is this puzzler (also with a strong vibe) which you play through once, then it slowly dawns on you, that was just the beginning, and you are assaulted with many higher-level meta puzzles which turn the whole game on its head. Tunic was kinda similar too. Animal Well has the same thing going for it - you beat the game, and realise huh, there's more to it than this... you start digging and keep digging, and by the time you've reached some of the “deeper” parts of the well, you've already made a whole bunch of notes and are starting to go a bit crazy. I love that shit."
      ],
      "image": "animal-well.avif",
      "platform": "Switch",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Rivals of Aether 2",
      "vibes": "7",
      "gameplay": "9",
      "review": [
        "Finally, a platform fighter that's just as fun as smash to play! It's so good! At first I wasn't vibing with the characters, I mean it's not like smash where you already know the characters because it's motherfucking princess peach. But after you play around a bit, you'll eventually gravitate towards one character or another. For me, I landed on Maypul, a fast and tricky character who has some fun kill setups. At first I was drawn to her because of the duck hunt-like plant combos but I also really vibe with the pikachu-style small fast character energy.",
        "The learning curve is really nice - it's not like smash melee in the sense that you can get good really quickly and it's so satisfying. And I still have so far to go, like all this ledge movement stuff I've barely even touched. I played with some pros at a smash tournament recently and I got absolutely fucked up, and I dunno it's hard to describe but it was a total honour. I really do just need to git gud.",
        "There's also a nice online matchmaking system, but that's not really my thing because I need to debrief about my games with someone IRL otherwise I get frustrated. Luckily I have some friends that I can play with from time to time.",
        "I will say I think this game is missing some kind of story mode/lore about the characters, but I heard that that's coming later."
      ],
      "image": "rivals.jpg",
      "platform": "PC",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "The Legend of Zelda: Echoes of Wisdom",
      "vibes": "7",
      "gameplay": "8",
      "review": [
        "I was so excited to learn about this game, because I loved the Link's Awakening remake that much. The team did deliver on another high-standard zelda game, but I can't say I enjoyed playing through it as much as other zelda games. It's hard to say why, because the vibe is very much the same as Link's Awakening. I guess this vibe is closer to the beaten track. There's much less weird shit.",
        "The gameplay stuff is quite fun though, if a bit broken in the second half of the game. I'm not sure they should give you access to that water block or that cloud. Battle was great though! Everytime I found a new monster I got excited about its echo, but always went back to my beloved, deku baba. I would describe my playstyle as Deku baba only. It's just so fast!",
        "I appreciated that we could finally play as zelda, but they made her a silent protagonist! There is no need. Link is already a silent protagonist and then they put the two of them together in the end and they literally couldn't have a conversation. It's gone too far! It also felt like I might as well have been playing as Link the whole time. Only when your name is cleared and you can start going round in your pink dress did I feel a swell of pride about playing as a princess."
      ],
      "image": "wisdom.png",
      "platform": "Switch",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Advance Wars 1+2: Re-Boot Camp",
      "vibes": "6",
      "gameplay": "9",
      "review": [
        "I loved this game, specifically the second one as a child playing on the GBA. I got into this way before becoming a Fire Emblem fan! It took a bit of time for me to pick it up because I genuinely thought it would be crap. I thought the gameplay would have aged badly and the new look isn't exactly that appealing, but I'm totally hooked again!",
        "Gameplay-wise this is super fun. It's super satisfying to go for a specific strategy and see it pay off. One-shotting units with bombers or submarines or medium tanks... man there's nothing better. I will say though that it's tough! And the enemy AI has pulled off some genius shit. One gripe I do have is that some of the later battles with lots of bases and cities tend to go on for ages... I'm not finished playing the game as I'm writing this, but the map pictured below took me all afternoon. I have some strong memories of the end of the second game, so I guess I have that to look forward to next...",
        "Vibes-wise this game has a super weird direction. It's war but it also feels like playfighting between kids. The toy-box aesthetics and comically extreme characters really laugh in the face of the horrors of war. I'm not trying to criticise the game for this, it's just jarring! It's not trying to make any points about war or even tell a good story, it's just trying to be a banger strategy game, which it is. The soundtrack is a bop too - all the old themes I loved from back then, remade and with special individual tracks for when you activate your CO power (a much needed change)."
      ],
      "image": "advancewars.jpg",
      "platform": "Switch",
      "year": "2024",
      "release": "2023"
    },
    {
      "name": "Penny's Big Breakaway",
      "vibes": "9",
      "gameplay": "7",
      "review": [
        "I was drawn to this game because of its colour scheme of all things. Everything is saturated in blue which gives it a very special vibe. It's the colours you see first thing when you wake up in the morning when you're still woozy and coming to. It reminds me of this game I played as a child “Zool 2” in terms of vibe. Something very special!",
        "I do feel like the character of Penny is a bit random. Her design is just a bunch of elements thrown together and doesn't have so much of a personality. There is some missed potential there, especially with the “big breakaway” part of the game. It doesn't feel like you're running away, but rather like you're going through some levels. If it were me, I would have gone for Penny running away constantly, with animations reflecting her fear/excitement, kinda like in Pizza Tower.",
        "The game itself is pretty fun, it's a momentum game kinda like Sonic, which makes sense because it's from the same devs as Sonic Mania (one of the best games ever). And by the end of the game I kinda got it with the loop, dash and jump moves. At the start though it was really hard, and I kept hitting walls and being bad and it was frustrating. I didn't feel the need to replay levels and do them better.",
        "One thing about the game is that you can choose whether you go through slowly and find all the collectibles and unlock difficult levels, go for mega points by having a big combo, or speedrunning. Different strokes for different folks but I was totally unsure about what I wanted! I wish I could have been told what to do in that regard, but that's just me.",
        "One last thing: I regret playing this on the switch. The graphics and framerate are bad and not in a good way. When I watched some gameplay from the PC version after finishing the game I was so shook!"
      ],
      "image": "penny.jpg",
      "platform": "Switch",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Thank Goodness You're Here",
      "vibes": "10",
      "gameplay": "7",
      "review": [
        "I heard about this game having good british humour so I found one of my few actual british friends at around 4:20pm and blazed through this game and it was so fucking funny. I do feel like the average German won't enjoy the vibe as much as we did but let me tell you we were in absolute stitches. The game itself is pretty bad, like it's just walking around trying to figure out what to do by prodding everything, but that's made up for by the outrageous nonsense happening on screen all the time.",
        "But yeah I do recommend it, the writing is genius and it's pretty cheap."
      ],
      "image": "thank-goodness.jpg",
      "platform": "Switch",
      "year": "2024",
      "release": "2024",
      "story": true
    },
    {
      "name": "Harold Halibut",
      "vibes": "10",
      "gameplay": "7",
      "review": [
        "My neighbour Fab and I enjoy playing indie games together when we hang out and this year we played a visual novel called Harold Halibut which he had on his gamepass. It was a nice time! The main thing to note about it is the stop motion/clay animation style. It gives it a vibe of being somewhat of a parody, like Team America or something. It means even the serious parts you have to enjoy with a smile. This combined with some honestly excellent dialogue makes for a delightful little experience.",
        "You play as a very plain and boring person who has a heart of gold, and he is a bit of a jack-of-all-trades handyman on a spaceship that is stuck in the sea of an alien world. All his colleagues speak down at him but in a loving way, and it's fun to see him deal with that. It's presented in a way that he might be depressed, but then he does find pleasure in the little interactions, because there are many delightful little quirks in the story to enjoy. After some twists in the story, you can see how his outlook changes, and it's handled quite maturely.",
        "It's got a nice little soundtrack, a lovely setting, and great characters. I really recommend it, although not if you're looking for a game. This is a visual novel through and through, you will only be pressing A!"
      ],
      "image": "harold.jpg",
      "platform": "Xbox Gamepass",
      "year": "2024",
      "release": "2024",
      "story": true
    },
    {
      "name": "Punchout",
      "vibes": "8",
      "gameplay": "7",
      "review": [
        "As part of my continued effort to play, complete and truly understand the games that all the smash characters came from, I took it upon myself to beat Punchout on the NES. This game is good, has aged very well, and is really hard. I haven't beaten it yet, but goddamn it I will. I wanted to get it done before I post this list but I can't get past Bald Bull, who is about halfway through the game. I have a long journey ahead of me..."
      ],
      "image": "punch-out.webp",
      "platform": "NES",
      "year": "2024",
      "release": "1987"
    },
    {
      "name": "Cobalt Core",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "I heard about this game from a list of recommendations by Lena Raine for games with great soundtracks and yes, I love the <a href=\"https://youtu.be/C0b3p1teA9M?feature=shared\">music</a>",
        "This is just the same as slay the spire. Instead it's got cute animals and great dialogue. One thing really nice about it is you play as three characters at once and get access to all three of their card decks, which means it's fun to pick and choose what you want.",
        "But it's definitely not as deep as slay the spire, and I wish it had an ascension system instead of just four difficulty modes. I also wish there were more obvious goals to complete in the game, instead of just winning 18 runs to unlock these dialogues.",
        "It was fun learning what was really broken in the game and what could be ignored. Like in slay the spire, card draw is super important, but in this game not so much - I would say energy is way more important. Also, movement is far more powerful than shielding. Pretty cool."
      ],
      "image": "cobalt-core.jpg",
      "platform": "Switch",
      "year": "2024",
      "release": "2023"
    },
    {
      "name": "Dave the Diver",
      "vibes": "10",
      "gameplay": "3",
      "review": [
        "This game is so kooky and fun, and made with love. It has a great art direction, and fantastic characters. You play a larger man who dives in a special location which contains all the fish in the world and then sells them as sushi. It's a wild premise and one that I really enjoy. I love that you just get real life fish and literally everything can be eaten. Even the bosses are just sharks and shit (for the most part).",
        "Dave the character is just great, he is often sidelined and people are kinda rude to him but he just takes it in his stride. He loves what he does and has a great positive mindset and you just love to see it. He's surrounded by some other amazing characters, like the sushi chef. Their little dialogues are always great, and all the characters are beautifully characterised by these amazing short pixel art cutscenes. They are SUCH a pleasure to watch always.",
        "Going diving and catching new fish is also super fun. First time to see and catch a shark? Awesome. And the sushi restaurant parts are also great. They're super satisfying and making more and more money each day just feels so good.",
        "But I don't think I'd recommend this game to friends, because it is just sooooo slow. Diving in general is slow, and the story progresses really slowly. There are a million side quests, including this eco-app where you are encouraged to collect certain items. You get so little out of these quests, but I found myself obsessively getting everything all the time. It's meant to be a relatively chill game but I found myself optimising and making sure I could complete everything, which resulted in a bunch of super long dives.",
        "As the game goes on, it continuously piles on new mechanics, minigames, stuff that is clearly designed to keep you interested, as the core gameplay of shooting your harpoon at fish will get old quick. That's cool and all but by the end you have so much shit on, that it's almost overwhelming. I spent more time farming, transferring fish from the fish farm, asking myself which recipes I wanted to upgrade, playing these dumb phone minigames than actually diving. They just cram the game full of new content, and it's not even good. Like each new mechanic is so shallow that it gets old very quickly.",
        "This fucking phone game which is like tamagotchi was what did it for me. Like why am I spending my time on this. They literally give you a phone that you can check for all the various game content, including a sushi version of instagram, and you end up just staring at it for ages. I truly don't think this game is a comment on how we are addicted to our phones. I just think they put too much shit into the game and it got boring. This would have been way better on a smaller scale in my opinion."
      ],
      "image": "dave.webp",
      "platform": "Switch",
      "year": "2024",
      "release": "2023"
    },
    {
      "name": "Still Wakes The Deep",
      "vibes": "8",
      "gameplay": "4",
      "review": [
        "I played a horror game! It was so scary! I really am not into horror stuff but I was interested by this one because of it's unique setting. It takes place on an oil rig in the North Sea in the 70s. It's historically accurate and features some great Scottish voice acting. Then at the beginning of the game, the drill hits some kind of otherworldly monster which then proceeds to transform this open platform in the middle of the sea into terrifying deathtrap. It's good for people who aren't faint of heart like me."
      ],
      "image": "stillwakes.jpeg",
      "platform": "Xbox Gamepass",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Chained Echoes",
      "vibes": "6",
      "gameplay": "5",
      "review": [
        "I was recommended this JRPG and was kinda feeling like playing a good one after being disappointed by Sea of Stars, and although I recognise that this is good, I wasn't able to finish it.",
        "It's got plenty of interesting characters, and you play as lots of different constellations of them, and the world seems interesting, and the music good. I just felt like playing it was work and coming back into it after a break was really hard. Maybe it's because I was also playing Balatro at this time and I just always wanted to play that instead."
      ],
      "image": "chained-echoes.jpg",
      "platform": "Switch",
      "year": "2024",
      "release": "2022"
    },
    {
      "name": "Final Fantasy VII: Rebirth",
      "vibes": "3",
      "gameplay": "8",
      "review": [
        "I've got a lot to say about this one so buckle up. As an enjoyer of the original FF7 and... I think I was an enjoyer of the previous game (Final Fantasy VII Remake), I felt the desire to play this game too. But I've been shocked by how horrifically sanitised it is. I think Remake was much the same but here it's even more so! I realised pretty quickly during this game that I'm not actually playing a game, I'm playing a product. I'm being served content and I'm supposed to enjoy it. After all this is a triple AAA big budget game that I paid full price for, and consumers like me have certain expectations. So the game gives me open world, generous dollops of fan-service, a whole ass card game, one thousand million mini games, a whole bunch of playable characters (including big seph), orchestral remixes of beloved old songs...",
        "It just all feels so forced! You can't escape it. Sure, this game has magic and love but it all stems from the very strong base of the original game. The world of FF7 is so fucking cool, with the world being overtaken by an energy company after they monopolise a new environment-destroying energy source. It's so topical, I love it. Seriously, play the original, it still holds up today and tells such a cool story about this fascinating world (a whole-ass planet, by the way). Rebirth isn't bad as such because it's built on this base. But what it adds is either annoying, superfluous or made without love.",
        "The worst offender is the open world. Don't get me wrong, I really don't mind an open world. But this one is less of an open world and more of a to-do list of pointless tasks in a big area. I have to go to the various spots and complete menial tasks in order to get a rush of dopamine as it is ticked off. Most aggravating for me was Chadley, the AI robot child character who sends Cloud off to do these super scripted “I'm playing a video game” tasks. Go defeat these monsters, go take a photo here, go activate this tower. What do I actually get out of this? Luckily I'm not actually invested enough in the gameplay to be interested in the materia you get from Chadley.",
        "One thing the open world does do is give the sense that you're exploring the whole planet. And I have to say it looks quite nice. The various towns all look fantastic as well. This is really a feast for the eyes, especially for those who played the original. Seeing Costa del Sol, Gold Saucer, Cosmo Canyon all looking so good is a treat. There are also lush, orchestral versions of the original soundtrack in these places, which is delightful.",
        "But while I'm talking about the soundtrack, I have to say that it's all over the place. The general vibe appears to be orchestral, but then it throws in the wacky stuff (certain sidequests, chocobo music, moogles, cactuars...) and the music goes all electronic and wild. There is also gratuitous jazz music here and there, and other random shit depending on what's going on. It feels like they're just cramming in as much content as possible. This is a recurring theme.",
        "Similar topic, this game switches from serious to silly so casually, it's jarring. The chocobos really are completely ridiculous! And there's something about seeing them in HD which makes it even wilder. In the OG, things happen so quickly and switch themselves up so regularly and you don't even bat an eyelid if you need to ride a chicken through the swamp. The vibe is so strong that silly things can coexist with the serious main story. In this remake, the silly, cartoonish things simply look so out of place, I can't take anything seriously.",
        "Two of the main characters (Red 13 and Cait Sith, my fave from the OG) are so outlandish in this game that it takes away any hopes of seriousness when they're involved. Actually despite that, I'm super happy with how they did Cait Sith because that really isn't easy to translate from the PS1 version and he looks and sounds great. Red 13 though, god the thing with his voice in Cosmo Canyon is so dumb, and he doesn't have any personality apart from that. He was way cooler in the OG I can't even describe. As for the other characters, Aerith and Barret are fine, they're both delightful. Tifa I can't even say anything because any semblance of a personality is completely eclipsed by her humongous knockers. Those badockadonks have their own field of gravity they are that huge. Whenever she's on screen I can't help but make an out-loud comment about how needlessly massive her tits are. Yuffie is beautifully animated, but her outfit from the original really needed an update. She's really a ninja, and trying to make a sleeveless, crop-top, turtlenecked, knitted woollen jumper work.",
        "The worst offender though is Cloud. God I hate how useless he is in social situations. They made him stand-offish and distant so that he looks like a badass, but to me he's just a dickhead. Aerith is trying so hard to make conversation and she is just suffering because Cloud just leaves her on read constantly. And somehow, the group all still tolerate him, nay revere him?? He literally does bad spoiler thing in the Gongaga reactor and Tifa is like, you good Cloud no worries babe. AT LEAST Cloud has some decent sexual tension with Sephiroth, who spends 80% of his screen time just glaring. I'm kinda into that.",
        "That was a lot of words about the vibe of the game, here's my review of the gameplay: The battle system in the game is really good. It took me a while to get into it (I'd forgotten everything from the previous game) but it's satisfying and fun. I also enjoy the Queen's Blood card game a lot. It's cool that there aren't any loading screens."
      ],
      "image": "final-fantasy-rebirth.webp",
      "platform": "PlayStation 5",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Metal Gear Solid",
      "vibes": "7",
      "gameplay": "3",
      "review": [
        "This isn't my first Kojima game but it's definitely the first one I've committed to and played through to the end, and I have to say, I don't vibe with his sense of humour! Making fun of otakus, action films and... women, it's all a bit much for me. This game is for fans of Die Hard or Terminator, and not people like me who like nice things.",
        "That being said I have to hand it to Metal Gear Solid for creating an action film game that actually works. The atmosphere and soundtrack is fantastic! Snake is ridiculous, but funny and kinda cool. He needs to stop hitting on every woman he sees though he genuinely sounds desperate. I also enjoy how over-the-top all the characters are, especially Liquid Snake, as well as the plot twists. They're genuinely hilarious.",
        "Gameplay-wise it isn't for me, stealthing around and then just murdering people isn't very fun, so I don't think I'll play any more of these games. But it was nice to see where Snake from Smash came from. I'm still on my journey to play, complete and understand every game that all the smash characters come from, so it's nice to tick off another character. Only a handful remain!"
      ],
      "image": "metalgearsolid.jpg",
      "platform": "PlayStation 1",
      "year": "2024",
      "release": "1998"
    },
    {
      "name": "Cassette Beasts",
      "vibes": "2",
      "gameplay": "7",
      "review": [
        "This is an indie game inspired by Pokemon where it's very much the same as Pokemon in many many ways but brings in some cool new gameplay features. In this game it's possible to fuse monsters together and they straight up made designs and names for every single combination (and there are over 100 of the things!). That alone is an incredible achievement and I was thoroughly enjoying seeing new combinations of my favourite mons even at the end of the game. However, there are so many of them that their specialness does kinda wear off after a while.",
        "It must have taken so long to do all the fusions... and I think the Dev time they spent on that should have been spent on... the rest of the game. It really is a technical mess! This game is glitchier than the newer Pokemon games which is impressive and the crazy loading screens and bad graphics is just on a different level. Normally I'm not too much of a bitch when it comes to this stuff, but it negatively affects the vibe of the game and is impossible to ignore. I can't recommend the game for that alone.",
        "One good thing was the open world aspect, you can go to any area whenever, which is great for catching cool mons. The worst thing about Pokemon (Well maybe not but for me a super annoying thing) is not being able to get a team of your faves early on in the game. All my faves are late game Pokemon and I'm pissed about that. The best thing about Pokemon is curating a team of my favourite mons and giving them all the love and attention that they deserve, watching them grow and beating the game with them. In cassette beasts I was able to find my faves (of course the dumbest designs ever, and this game has plenty of goofy ass mons that I'm immediately drawn to) and I was also able to swap them out easily because the levelling up is based on your character, not your mons, a great idea.",
        "To end this with another fat negative, the writing is terrible and generic. The premise is very forced, and even the interesting boss characters don't make much sense really. Also, I was not vibing at all with the soundtrack, some cheesy soft rock/indie songs with vocals. I was told it had a good OST but it wasn't good for my tastes and I ended up muting the game.",
        "Actually I'll end with a fat positive, the game features a delightful companion character who joins you towards the end, who single handedly brings a fantastic energy to the game, and when he comes with you at the end... just great."
      ],
      "image": "cassette.avif",
      "platform": "Switch",
      "year": "2024",
      "release": "2023"
    },
    {
      "name": "Tongue Tale",
      "vibes": "3",
      "gameplay": "6",
      "review": [
        "A friend of mine made this! So I was curious how it was going to be. Imagine being a solo dev on a hobby project and having it release on switch! Awesome. So shoutouts to Remke - you can buy the game and support him.",
        "The game itself is heavily inspired by Celeste - super difficult platforming designed to be super satisfying when you finally get it, and made more fun by restarting failed levels faster than you can blink. It's based on a pretty interesting mechanic of swinging on your tongue, where you use momentum and timing to propel yourself through hand-crafted levels. It's something that you can get better at and is really satisfying when you get right. Many of the puzzles are based on timing jumps and letting go of your tongue at the precise moment when you will fly at just the right angle, which requires a good spatial understanding.",
        "Shit's not easy, which in theory isn't a problem - Celeste is similar. However, where this game fails is finding that difficulty balance in the level design. Celeste somehow manages to find the sweetspot between “this is kinda easy” and “this is bullshit”, presumably through a hell of a lot of playtesting. Tongue Tale doesn't manage to do that (sorry Remke). The first world is a lot of fun, but somewhere in the second or third world the difficulty spikes so insanely quickly into the “this is bullshit” realm that it kinda detracts from the experience. I eventually did beat the game, but I have to admit it was a struggle."
      ],
      "image": "tongue-tale.avif",
      "platform": "Switch",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "Age of Mythology: Retold",
      "vibes": "2",
      "gameplay": "6",
      "review": [
        "Some friends convinced me to try this and we played it together in a LAN-format which was fun. I wasn't able to keep up with all the tactics though and didn't feel great about grinding the game to get good at it. Wasn't keen on the length of the games - would rather have either a quick run so I can easily jump in and out, or super long like Factorio or Civilisation."
      ],
      "image": "mythology.jpeg",
      "platform": "PC",
      "year": "2024",
      "release": "2024"
    },
    {
      "name": "1000xRESIST",
      "vibes": "3",
      "gameplay": "5",
      "review": [
        "This is a visual novel about a future in which aliens destroyed everything, but one lady somehow survived and made lots of clones of herself. Those clones learn about how things came to be, it's an interesting premise!",
        "I got a bit of a bad start to the game because I just gave this visceral reaction to stories set in North America with American voice acting. At first glance it looks like more American TV, and I guessed it wouldn't have too much depth to it. On top of that, it was going for very abstract and indiscrete vibes, a little too arty farty for me.",
        "As I got into it I did see its merit, it's got some interesting things to say about why bad people act the way they do, and choices as a player in the scope of a video game. That being said, I wasn't motivated to go back for other endings after I got a bad ending.",
        "I think the emotional parts were a bit forced, and the music was kinda generic. I wouldn't recommend it."
      ],
      "image": "1000x.webp",
      "platform": "Switch",
      "year": "2024",
      "release": "2024",
      "story": true
    },
    {
      "name": "A Little to the Left",
      "vibes": "4",
      "gameplay": "2",
      "review": [
        "Tried out this little thing on Fab's Xbox. It's a game where you have to line things up neatly. I think it's great for people with OCD but I don't have that so I was left unsatisfied."
      ],
      "image": "little-left.jpeg",
      "platform": "Xbox Gamepass",
      "year": "2024",
      "release": "2022"
    },
    {
      "name": "Kingdom Hearts HD 2.5 Remix",
      "vibes": "5",
      "gameplay": "2",
      "review": [
        "Having suffered through Kingdom Hearts 1, Chain of Memories and 358/2 Days last year, everyone was telling me to grit my teeth and play Kingdom Hearts 2 because it's “actually good” but lord these fans are blinded by nostalgia. This game is equally as bad as the first game, except it has more stuff in it!\n",
        "However, I have to hand it to them for making this game real. Having such a ridiculously convoluted story, bewildering cameos from disney characters and final fantasy characters just hanging out. Incredible that it happened. I can imagine that at the time, this game would have been so fucking crazy.",
        "The game features so many cameos it's actually ridiculous. All the stories and worlds are short and shallow so they can fit in more content. I think the appeal is more like “wow I am riding Aladdin's magic carpet” rather than “this carpet minigame is fun”.",
        "One thing I appreciate about Kingdom Hearts is the stilted dialogue, which leads to the funniest cutscenes ever. I watched a “kingdom hearts” out of context video and it had me cackling. The comedic timing on some of the nonsense that the characters spout really does tickle me.",
        "I admit, I didn't engage with the battle system as much as I could have. I played on normal mode and mashed X to get through the game. Only at the very end of the game I realised you could increase your ability points by using items. In the final world I had a ridiculously difficult boss fight (Roxas) where the game suddenly turned into Elden Ring and I had to spend two hours increasing my level and learning his attack patterns. I was utterly unprepared and it didn't feel good to have to learn how to play the game then to beat him. In my defence, the player has to put in a lot of work to understand how stuff works. I'm used to modern games where things are properly explained.",
        "Well, I beat the game, which is saying something, I guess."
      ],
      "image": "kingdomhearts-2.png",
      "platform": "PlayStation 4",
      "year": "2024",
      "release": "2014"
    },
    {
      "name": "Kingdom Hearts: Birth By Sleep",
      "vibes": "5",
      "gameplay": "2",
      "review": [
        "Using the last ounce of my fading strength, I launched into the next game in the collection, a prequel spinoff which follows three new characters. This game has even more battle systems than usual, and I was punished pretty quickly for not engaging with them. I managed to get quite far, but at some point it became clear that I would have to grind levels, and level up these commands, and worse, in order to do so, I would have to play a mario party-style minigame. I noped out of that, finally took a step to preserve my health and sanity, and put kingdom hearts down forever."
      ],
      "image": "birth.jpg",
      "platform": "PlayStation 4",
      "year": "2024",
      "release": "2010"
    },
    {
      "name": "Pizza Tower",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "This game is amazing. Start by listening to the <a href=\"https://youtu.be/GHooySzFkHI?feature=shared\">soundtrack<a>.",
        "The VIBES are off the CHARTS. They really made a game that looks like it was made in Microsoft Paint? Iconic. The music has no business being this good for such a goofy looking game.",
        "There are so many fun ideas and fun levels, and it really makes you want to play the game well. You can't die in the levels, but you WANT a good score. Going back and redoing levels for a higher score is a lot of fun. The game is based off of Wario Land 4, which happens to be one of my favourite games from my childhood. They took that concept and fucking ran with it. This spiritual successor surpasses the classic!"
      ],
      "image": "pizzatower.png",
      "platform": "PC",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Anodyne 2: Return to Dust",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "This game blew me away. Very hard to describe what it's about but here we go. You start the game inside an egg and you have to be born, but not before you get some kind of seed implanted inside of you. You are tasked by what appears to be a religious entity (the Centre) to rid the world of dust and bring about the Anodyne, something like a rapture (the word “anodyne” means painkiller). As you go around removing the evil dust, the seed inside you watches as you do your job. The evil dust affects the citizens of the weird and wonderful world, and you remove it, numbing the pain and “clarifying” things for them.",
        "As you go through the game, doing your job and meeting all these suffering people, you realise the game relates a lot to the human experience. There are many points in the game where you can draw parallels to how we grow up, how our parents affect us, our relationship with entities like “the Centre”, and many many other things. The game is dripping with meaning.",
        "It also has an immaculate vibe. The world looks like a PS1 game, polygons and everything, but it also has nice lighting. The colour palette makes it look dreamy. It also looks dumb and trashy and low budget and I love that. There are also some 2D sections for when you shrink down to a miniscule size in order to clean the dust, and they are delightful. If you're interested, give <a href=\"https://www.youtube.com/watch?v=T6SnkLnlsnY\">this track from an opening area</a> a listen"
      ],
      "image": "anodyne.png",
      "platform": "Switch",
      "year": "2023",
      "release": "2019"
    },
    {
      "name": "Ghost Trick: Phantom Detective",
      "vibes": "10",
      "gameplay": "8",
      "review": [
        "This is such a charming game. It's absolutely OOZING with style. It's kooky, silly and over-dramatic, and I love it. It's a remake of a classic investigation game from the DS that came out on switch and I highly recommend it. Fans of Ace Attorney should be all over this."
      ],
      "image": "ghosttrick.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2010"
    },
    {
      "name": "Pikmin 4",
      "vibes": "8",
      "gameplay": "10",
      "review": [
        "I love Pikmin with my whole heart. There's something special about it. The combination of the focus on nature, the soundtrack, the wacky characters, and the kinda dark elements combine to give it a certain X factor which is hard to pin down with words. When I think about whether games are good, they can get approval from me for a variety of reasons. Like Slay the spire is just great gameplay. But most of my favourite games just have great vibes.",
        "The vibe of pikmin is so fucking strong that it's insane, and the gameplay is good enough that it's fun to spend time in the game soaking up the vibe. The first pikmin arguably had the worst gameplay but the strongest vibe. The time limit, as well as harshness of the environment, and some highlights like the first encounters with specific bosses. Lots of bullshit with pikmin killing themselves, general difficulty. It is a great time and might be my favourite pikmin.",
        "The second pikmin game is a lot bigger and also has vibes in spades. The areas are super nice, music is fantastic (I love the piklopedia), and gameplay significantly improved with having two captains. The caves seemed pretty random though - like time stops when you're down there and then you've just got this ability to go back to the previous floor if you lose too many pikmin. I feel like it takes away from the general feeling of the game, and it's more like bonus content.",
        "Pikmin 3 is super interesting. It's fucking gorgeous, has beautiful areas and possibly the best music of all. It also does away with the caves, and instead just has a really big overworld, which brings back that pikmin 1 vibe a lot. I never liked how the treasures were just fruits though, that seemed pointless. It also added mission mode, which was the best thing ever in terms of gameplay - these super fun little challenge modes. The final boss was also very special.",
        "Now after 10 years we finally get Pikmin 4 and I have been excited for it, even more so than for Zelda. In terms of gameplay, everything is there. Quality of life changes to the max, meaning that pikmin actually do what they're told, all the pikmin content you could wish for. All the old bosses coming back, caves, hours of gameplay. I had a fun time collecting all the treasures and completing everything.",
        "But something's off. The game feels like a huge collection of content being thrown in. More is more! The caves are more content, the dandori challenges (like pikmin 3 mission mode) are great but integrated into the game like extra content. They brought back the (terrifying in pikmin 2) waterwraith and it felt empty. It just dropped two of them in the final dungeon. Doing that really takes away the special vibe of that particular boss. I realised that in pikmin 4, vibe was sacrificed for more content, and that this is true for many games these days.",
        "The quality of life changes &amp; powered up rewind function makes it so it's very easy to get through the game without losing pikmin, so stakes are way lower now. I think I miss the chaos of the first two pikmins where one misstep can cause your whole squad to get flattened without warning. Electricity immediately killing them, the gatling groinks, yellows throwing bombs back at you. There's something delicious about that.",
        "On top of that, the music isn't so great. The Olimar sidequest tracks are great, but otherwise it's gone a different direction: now it has ultra adaptive music (something the series is famous for and a big contributor to the X factor) but it's so adaptive to the point it's barely recognisable. There are multiple layers which fade in and out depending on what enemy you're fighting, what you're carrying etc. Nothing you can hum.",
        "They also retconned the lore, and it was \"all a dream\" or something. They had Louie be the bad guy but then cleared things up after, and there were no open questions left like in Pikmin 2. There was no weird shit like the Pikmin 3 final boss. And final complaint: I wish they integrated the night time/glow pikmin sections better.",
        "But to end on a positive, I really loved getting platinum medals in the dandori challenges, and those final ones were tough as nails. I still loved this game. I even painted a picture of Oatchi for my living room!"
      ],
      "image": "pikmin.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "The Legend of Zelda: Tears of the Kingdom",
      "vibes": "9",
      "gameplay": "9",
      "review": [
        "Playing this game felt a lot like playing Breath of the Wild back in 2017, although it has to be said: nothing can truly recreate that feeling of magic we all felt back then. It's undeniably a better game, but some of that magic is gone the second time around. It's super interesting because it's forcing me to reflect on why I enjoyed playing BotW more, despite it being emptier and more annoying. How we enjoy games really depends on so many things, not just the game itself. In this case, it was because there really wasn't anything like it before.",
        "Anyway here we are in 2023 playing Zelda again and it's a lot of fun. The new abilities are nice. I was actually in it for the new content, music, areas and surprises though. There was a lot to enjoy, but it really does rely on existing content a bit too much. I wish exploring Hyrule wasn't so similar to how it was before.",
        "I really loved some of the new stuff though. The new temples, great! Especially that gorgeous Lightning Temple music, hell yes. Getting from A to B using a ratchet flying machine, great. First time falling into a chasm? Terrifying. This gorgeous version of <a href=\"https://www.youtube.com/watch?v=0VbNjXSRRQU\">Lookout Landing</a> after you meet all the sages."
      ],
      "image": "tears.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Pokemon Trading Card Game",
      "vibes": "10",
      "gameplay": "8",
      "review": [
        "Mate. This game slaps. I never would have thought that the original Gameboy Colour version of the fucking Pokemon Trading Card Game would be so good. I'm pretty sure the actual card game is super unbalanced and bullshit, but these battles are a lot of fun. It's genuinely a pleasure to build decks and fight with them, and it's hard to describe why.",
        "I immediately got attached to Staryu, because it can do 20 damage with one energy, and also happens to be one of my favourite pokemon. My water &amp; rock deck took me through almost the whole game and I even felt proud of it.",
        "The art of the pokemon is sooo good. I've already cross-stitched Horsea and Koffing from this game. And the music is super good for a gameboy game as well. It's on the switch online for free, so definitely play it!"
      ],
      "image": "pokemon.jpg",
      "platform": "Gameboy",
      "year": "2023",
      "release": "1996"
    },
    {
      "name": "WarioWare: Move It!",
      "vibes": "10",
      "gameplay": "7",
      "review": [
        "This is a delightful party game! It really nails my humour. I played it at christmas with some friends and we had a great time. If you love motion controls, give it a go!"
      ],
      "image": "warioware.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Cocoon",
      "vibes": "9",
      "gameplay": "8",
      "review": [
        "I had such a laugh playing through this game with my friend Fab. We did it in one evening, making sex jokes the whole time, seeing as it's a game about balls. As we progressed through, the game assaulted us with more and more vaginal imagery. Lots of imagery surrounding childbirth, wombs, balls shooting through tubes, phalluses. The real deal. I couldn't not see it.",
        "The puzzles got really good towards the end. I love a good puzzle game and this one blew my mind. It was so clean and polished as well. At many points in the game we nodded and said “...game design”. This had clearly been designed by a real game designer yknow. Actually I wondered if it was a little too over-engineered, taking away the magic a bit. But I couldn't deny that the little game design things they implemented were all great. Things like old paths closing off if it's definitely the wrong way to go, or pleasant music playing when you start solving a puzzle in the right way."
      ],
      "image": "cocoon.jpg",
      "platform": "Xbox Gamepass",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Super Mario Bros Wonder",
      "vibes": "8",
      "gameplay": "8",
      "review": [
        "This game is delightful, perfect for co-op and full of great things that I greatly appreciate (elephants, nonsense, random shit). I like that the wonder flowers were like drugs. The final level was really good.",
        "It has to be said though: this game is just another mario. Mario will always be mario... it's just the same game with more vibe, personality and style. This game is also missing any semblance of a good soundtrack."
      ],
      "image": "mario.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Vampire Survivors",
      "vibes": "7",
      "gameplay": "9",
      "review": [
        "God this game is like crack. Instantly addictive. I touched it and was sucked inside like a loser, there was nothing I could do. Once I sniffed the potential of the garlic item, and felt the excitement of ripping through endless hordes of enemies with it, I was hooked. By the end, my eyes were glazing over as I watched the screen flash very aggressively at me, the screen full of effects, enemies, GARLIC, destruction, wave after wave.",
        "It's good."
      ],
      "image": "vampire.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2022"
    },
    {
      "name": "F-Zero 99",
      "vibes": "9",
      "gameplay": "6",
      "review": [
        "Mate this game has the <a href=\"https://www.youtube.com/watch?v=cJCmbipfnyA\">best music</a>.",
        "I'm just happy this game got some love this year and everyone played it for like a week. The F-Zero series is great and this was a great time.  It sucks that I could only ever end up playing on Mute City and Big Blue though."
      ],
      "image": "fzero.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Chants of Sennaar",
      "vibes": "7",
      "gameplay": "8",
      "review": [
        "This is a game perfect for fans of “Return of the Obra Dinn”, languages and games with great vibes. It has an artstyle similar to that of “Sable”, another game on the list that I want to play. It looks fantastic.",
        "It's all about learning new languages! Everyone speaks using these glyphs which correspond neatly to concepts, objects and verbs. Learning vocabulary using puzzles is already really cool, but it also forces you to think about grammar to a small extent, which for me as a linguistics nerd was super fun (and easy!). It starts off pretty easy but then they introduce a second new language and shit starts getting real.",
        "I highly recommend it!"
      ],
      "image": "chants.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Kirby's Return to Dreamland Deluxe",
      "vibes": "7",
      "gameplay": "7",
      "review": [
        "A delightful game! I missed out on it when it came out on the Wii, despite adoring Nightmare in Dreamland and Amazing Mirror. It's great, and this remake looks real nice. I love the outlines on the characters. It's short, doesn't overstay its welcome and features some fun minigames."
      ],
      "image": "kirby.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Fire Emblem Engage",
      "vibes": "8",
      "gameplay": "7",
      "review": [
        "This game, man. It's just so camp! The theatrics of it... it definitely doesn't take itself seriously and is better off because of it. The story is about war and normal fire emblem stuff, but then the characters are just so ridiculous. Every chapter there is a new ridiculously dressed person who joins your party and you just have to take it as it is. It's actually really funny and entertaining because of that.",
        "I'm a long time Fire Emblem fan, so I'm used to the gameplay and I enjoyed it! This time for the first time I played on casual mode (as opposed to classic mode, where you have permadeath) and it GREATLY improved my gameplay experience. I didn't have to reset when someone got hit with a critical hit! I should have used this option the whole time. To balance it out, I also played on hard mode, which made the game more fun, although I was resentful that my playtime extended very long because of it. Also a little bit of me is unsatisfied because I switched it to normal difficulty for the final boss... I just ran out of patience.",
        "This game brings back 12 main characters from previous fire emblem games as the “emblems” which I thoroughly enjoyed. I am a total sucker for this kind of thing - references to older games, representation of different eras... I loved seeing Micaiah from Fire Emblem Radiant Dawn, or Eirika from Sacred Stones. So cool. I just wish the emblems actually had personalities. They are all boring as hell.",
        "Anyway shoutouts to Goldmary who is that real bitch."
      ],
      "image": "fireemblem.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Super Mario RPG",
      "vibes": "8",
      "gameplay": "5",
      "review": [
        "This game is delightful! I've always been meaning to play it so I was super happy to see it remade on the switch. The whole thing is very quaint. I love the chibi characters, and I adore Mallow. Geno is by comparison very boring - I'm asking myself why so many people wanted him in Smash.",
        "I will say the game got a little boring and also easy. It's not exactly gripping, and the battles are only a little bit fun. If you play it, I would do it for the vibe and the chill ride, and for the history. Personally I love to play classic games and learn how lots of old Nintendo stuff came to be. For example, this game is where Bowser's personality was first defined!"
      ],
      "image": "rpg.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "1996"
    },
    {
      "name": "Street Fighter 6",
      "vibes": "7",
      "gameplay": "8",
      "review": [
        "I really enjoyed playing this game with friends this summer. I love the character designs, and enjoyed learning the special inputs for Chun-Li's moves. The single player mode is funny! It also has a fantastic vibe and soundtrack.",
        "Sadly I don't have time for a second competitive game next to smash, so I only played it for a short while. I would like to return to it."
      ],
      "image": "chunli.jpg",
      "platform": "PlayStation 5",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Sea of Stars",
      "vibes": "9",
      "gameplay": "5",
      "review": [
        "I put 30 hours into this game. At some point when I realised this wasn't going to be the best video game ever I decided to enjoy my time with it by just vibing through it, which was easy because the vibes are so strong.",
        "One thing I look for the most in games is a good vibe, which is often from a combination of characters, environments, colour palettes, art, dialogue and most importantly, music. Sea of stars has just such a great vibe. I really enjoy the character designs and the environments and the lighting especially. There's an ability that lets you change the time of day and it looks soooo good, I've never seen anything like it.",
        "The music is also really good, I like the <a href=\"https://www.youtube.com/watch?v=AkEN4ATb-xo\">moorlands</a> music a lot.",
        "There's a few gameplay elements which make it not the best game ever. The battle system is a lot of fun, especially with the timed inputs and breaking of opponent's big moves, and I never groaned when I had a battle. However it doesn't have too much depth. It takes a long time before the characters learn any new attacks and when they do, they're never gamechanging. In fact I spent all the game using moonerang because it's simply the strongest attack. On top of that, one of the moves 'disorient' can really be abused to stop bosses ever doing their strong attack, which resulted in me missing all exciting animations from the final boss, which was a bit lame.",
        "Next part has some light story spoilers...",
        "The worst thing about this game though, is that the two main characters are plain and boring. They have no personality, they just go around winning battles and solving problems like boring heroes. How did they survive 10 years of isolation and training and then become perfectly well rounded heroes? The previous solstice warriors ended up not being well-rounded at all. The other characters are also pretty plain, with the exception of Resh'an, which was a genuine pleasant surprise. I appreciate that there was little dialogue, because it gave off those old fashioned SNES vibes, but it did mean that there was little to no character development. It's a shame because I like the designs.",
        "When it comes to world building, I have a couple of questions. If we're dealing with multiple timelines and universes, why are we just focusing on two of them? How did we end up consistently going between these two specifically using the vast sea of stars? Considering the name of the game is sea of stars, the whole concept isn't very well explored. I mean we got this insane, super cool warp sequence there, but even though we traverse the sea multiple times, we never see that again.",
        "One thing about the lore which I did enjoy were the stories told by Teaks. They're perfect fantasy fairytales which work really well with the minimal dialogue, set to nice music and revealed at points in the story when you haven't figured it out yourself yet.",
        "In conclusion, this is a game which does have that X factor which is so rare in the wealth of video games we are bombarded with these days, but it has some things holding it back from being one of my favourites. I did push through all 30 hours though, which says something"
      ],
      "image": "seaofstars.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Signalis",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "This is a very cerebral, abstract survival horror game. I didn't truly understand what was going on in the story but the vibe was good. It's apparently got Resident Evil 1 energy which is cool. It has a lot of German DDR in space energy if that makes sense.",
        "I played it together with my friend Fab which was a great idea because the game is really scary and he could play through the difficult bits. After a while you become less scared of the monsters though which is good, although they always have newer scarier monsters waiting for you."
      ],
      "image": "signalis.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2022"
    },
    {
      "name": "Neon White",
      "vibes": "3",
      "gameplay": "6",
      "review": [
        "This game's story and characters are soooooo lame it's hard to describe. Like it's not even funny or enjoyable despite being bad like some of the games lower down on this list. And the general vibe isn't very attractive I have to say.",
        "But it's super addictive. I really enjoyed playing it with my friend Fab and replaying the levels over and over. Deeply satisfying."
      ],
      "image": "neonwhite.jpg",
      "platform": "PlayStation 5",
      "year": "2023",
      "release": "2022"
    },
    {
      "name": "The Looker",
      "vibes": "5",
      "gameplay": "7",
      "review": [
        "This game is made as an homage to another fantastic game “The Witness”. If you loved that like me, play this! It's made by someone else but in the same style. It parodies the Witness in a really smart way. It's nice and short, and free!"
      ],
      "image": "looker.jpg",
      "platform": "PlayStation 5",
      "year": "2023",
      "release": "2022"
    },
    {
      "name": "Citizen Sleeper",
      "vibes": "6",
      "gameplay": "5",
      "review": [
        "This is a small scale management game (and I play one management game a year for some reason) with a great vibe and setting. I really enjoyed the story and characters, and enjoyed how I could choose what happens to me. Multiple endings, lots of exciting stuff that happens, it's a great little game!"
      ],
      "image": "citizen.jpg",
      "platform": "PC",
      "year": "2023",
      "release": "2022"
    },
    {
      "name": "Stray",
      "vibes": "7",
      "gameplay": "4",
      "review": [
        "I played this together with my friend Fab - this is a great game to share with someone else. The premise is so good. You go around as a cat and it's awesome. You can take naps, scratch at furniture, it's really fantastic.",
        "I really like the <a href=\"https://www.youtube.com/watch?v=4w27KPzZ788\">track that plays at the beginning of the game</a>.",
        "They put the cat in a crazy world with a crazy story, and you have to solve puzzles and have an understanding of your surroundings in a way that no cat ever could. The only explanation: you are a human trapped in the body of a cat! But that's never confirmed or denied. In fact, the game suggests you're just an insanely smart cat.",
        "I found myself thinking to myself that a cat game doesn't need to go this hard. It's a bit much. But I enjoyed it a lot."
      ],
      "image": "stray.jpg",
      "platform": "PlayStation 5",
      "year": "2023",
      "release": "2022"
    },
    {
      "name": "The Legend of Zelda: Oracle of Ages",
      "vibes": "5",
      "gameplay": "4",
      "review": [
        "One of my video game ambitions is to complete every Zelda game! So when this was released on the Nintendo Switch online, I decided it was time. Having played Oracle of Seasons already when I was younger, I was ready to fucking enjoy the shit out of this. But I have to say it's not as good. There's a bit too much bullshit, and it's not well signposted. The seasons are cooler than the two timelines. It's also kinda hard.",
        "If you're interested in the gameboy games, I would honestly just stick with Link's Awakening, one of the best games ever."
      ],
      "image": "oracle.png",
      "platform": "Gameboy",
      "year": "2023",
      "release": "2001"
    },
    {
      "name": "Death's Door",
      "vibes": "2",
      "gameplay": "4",
      "review": [
        "This was recommended to me by my friend Fab who said it would scratch the itch left behind by “Tunic” last year. However he did not understand that Tunic cannot be replaced thanks to its incredible “learning as you progress” mechanic. Nonetheless, this plays a lot like Tunic and has an alright vibe and music. One of the bosses is this old lady which is cool. But this game is lacking in heart and soul. It's a copy of this standard soulslike combat, with no new special mechanics or anything that sets it apart from other games."
      ],
      "image": "deathsdoor.jpg",
      "platform": "PlayStation 5",
      "year": "2023",
      "release": "2021"
    },
    {
      "name": "Banjo Kazooie",
      "vibes": "8",
      "gameplay": "2",
      "review": [
        "One of my goals is to play, complete and understand all the games that the smash characters are from. I did play Banjo Kazooie as a child but I'm pretty sure I never completed it, so having recently got the Nintendo switch online expansion pass, I decided it was time to replay it!",
        "Now in terms of vibes this game is off the charts. There is so much fun nonsense to enjoy. Absolute highlight for me is Brentilda, Gruntilda's “nice” sister who is SUCH a bitch. She is just all over the map and all she does is hate on Gruntilda. It is so funny and I love the energy. Sometimes she's hiding in a corner somewhere and just pops up to say that Gruntilda is disgusting because she eats maggots for breakfast. Sets me off everytime.",
        "I have to say though. It's a terrible game, it's aged really badly. Collecting stuff isn't actually that fun. Having to collect all the music notes from the start whenever you die is miserable, and the jiggies are not signposted properly. The music is really good though, but of course I would say that as a lover of Donkey Kong 64 (proven to be a terrible game).",
        "I loved the final boss, because it was just a quiz. And Grunty is just so funny. Although, it turns out there's a difficult actual boss battle with her if you collect almost all the collectables. I just noped out of that one and watched it on youtube in the name of self-care."
      ],
      "image": "banjo.jpg",
      "platform": "Nintendo 64",
      "year": "2023",
      "release": "1998"
    },
    {
      "name": "Dr Mario 64",
      "vibes": "3",
      "gameplay": "4",
      "review": [
        "Continuing the theme of playing games of smash characters, it was time to revisit the Dr Mario puzzle games and see what makes this game tick. As a big fan of Puyo Puyo Tetris (the best puzzle game ever) I was interested to see if this game had the same depth. Short answer: it doesn't. You have to get lucky with the pills, because there isn't a good strategy for what to do when you get the wrong pills. You have to constantly go for vertical rows of 4 because the horizontal ones are just so risky.",
        "I don't know if it's like this in other Dr Mario games but on this one you play against an opponent and they send single blocks over and it just fucks with everything. If they fall down at the wrong time, you're fucked and you have to restart, simple as that.",
        "I managed to get through the story mode by getting lucky, waiting for my opponent to fail or occasionally clutching it out with some good gameplay. I did end up getting quite good at it because it is really fast paced. The final battle was really hard though, you needed that combo of good RNG and good execution. I did kinda enjoy getting that W in the end I won't lie. Anyway this game isn't good but I kinda enjoyed playing it on my switch over christmas."
      ],
      "image": "drmario.jpg",
      "platform": "Nintendo 64",
      "year": "2023",
      "release": "2001"
    },
    {
      "name": "Marvel's Spider-Man 2",
      "vibes": "2",
      "gameplay": "3",
      "review": [
        "This game is super dumb. My friend Fab lent me the physical game and for some weird reason I ended up completing it. I admit that swinging around town is kinda fun, and towards the end I got better at the game and it was kinda satisfying using all the special abilities. That being said, I played the game on easy because I had no time for dying over and over against some goons.",
        "Wild that this game has web slinging moments, watching a movie moments, and then they pad out the time with swinging fists at goons and even stealthing around (?). Luckily I didn't need to stealth much because I was playing on easy. But it all felt very forced when I was doing all these epic stunts and then bam I'm in a building and have to fight some dudes for a bit.",
        "But god the story is just so ridiculous. I mean it's classic superhero nonsense and it's why I don't have any time for superhero films. There's just so much ridiculousness, like these hunters. There's this dude with too much money who likes hunting, and he has hundreds (thousands?) of loyal cultists who came with him from Foreign Country to New York, all of them willing to die for the cause. All trained in martial arts? There's this character called Black Cat who randomly finds a magic portal. Like, just magic is a thing.",
        "Venom as a thing is fascinating to me. How is this eldritch-horror ooze thing so popular? Everything surrounding this storyline was super predictable.",
        "The worst offender for this game is the very generic soundtrack. Boring ass movie music with no character. They should have given this game an actual vibe like the into the spiderverse film. I also resented how everything just gets destroyed all the time. Spiderman and his escapades just end up destroying every environment they're in.",
        "I don't recommend this game."
      ],
      "image": "spiderman.jpg",
      "platform": "PlayStation 5",
      "year": "2023",
      "release": "2023 "
    },
    {
      "name": "Hifi Rush",
      "vibes": "1",
      "gameplay": "3",
      "review": [
        "I can't describe why this game didn't click with me. On paper, it looks great. I love rhythm games, and it seems innovative and funny. Looks like it was made with love. But I just wasn't enjoying it. I guess it's not my humour. And in my 2 or so hours with the game, the battle system didn't click with me.",
        "It kinda felt like I was playing some Content made by a Content Creator. I can almost picture the dev studio putting in all the elements to make a game which is enjoyed by the masses."
      ],
      "image": "hifirush.png",
      "platform": "PlayStation 5",
      "year": "2023",
      "release": "2023"
    },
    {
      "name": "Pentiment",
      "vibes": "6",
      "gameplay": "1",
      "review": [
        "This is a historically accurate visual novel about the middle ages. I picked it up because my friend Colin recommended it and I saw that one of my favourite artists (Lingua Ignota) sang a song on the soundtrack. The fact is, I'm not interested enough in history to get me through this slow-paced game. I gave up after the first major event happened and it became clear where the game was going."
      ],
      "image": "pentiment.jpg",
      "platform": "PlayStation 5",
      "year": "2023",
      "release": "2022",
      "story": true
    },
    {
      "name": "Monster Train",
      "vibes": "1",
      "gameplay": "3",
      "review": [
        "Not in this list: Slay the Spire. I still love and am trying to get the elusive A20 Heart kills with characters that aren't watcher. At some point I was reminded that there are other games like Slay the Spire that I should try, so I tried Monster Train. I didn't really like it."
      ],
      "image": "monstertrain.jpg",
      "platform": "Switch",
      "year": "2023",
      "release": "2020"
    },
    {
      "name": "Kingdom Hearts 1.5 Final Mix",
      "vibes": "7",
      "gameplay": "2",
      "review": [
        "I'm on a challenge to play, complete and understand the essence of every game that the smash characters come from. This means that at some point I had to play Kingdom Hearts, and wow. This game is so so so bad. It has aged terribly.",
        "It's at the bottom of this list because it's so bad and I wouldn't recommend it to anyone. But I would be lying if I said I didn't enjoy it. The moment the early 2000s vibe hit like a truck during the opening I knew I was in for a treat. The thought of this being the coolest game ever as a child is just so funny at every point in the game.",
        "I should have known what I was in for in the opening section on the island, where the most annoying music ever played in a very short loop and I had to do nonsense tasks for my friends. After that I was treated to a bewildering story and game with many difficulty spikes, many points where I had no idea where to go, and many times having to look up a walkthrough.",
        "The disney worlds, one of the most bewildering aspects of the game, are so tiny and bland it's funny. I was just amazed that they managed to secure the rights to all these characters and worlds. Although by the end, having had my standards set so low, I found myself forming opinions on them. Why does Neverland only take place on a boat? It was kinda cool that you can be a mermaid in Atlantica... and the music in Agrabah isn't too bad. Those gummi ship sections though, terrible.",
        "I never truly understood how to use all the items. I spent a lot of the time without any proper weapons, nerfing myself to the point where bosses were endless HP sponges. I just assumed that's how the game was meant to be. I guess I've been trained by modern games to be signposted stuff like that.",
        "The cutscenes and dialog, the edginess, the characters... the whole thing is wild. I'll never forget playing this game."
      ],
      "image": "kingdomhearts.jpg",
      "platform": "PlayStation 4",
      "year": "2023",
      "release": "2013 "
    },
    {
      "name": "Kingdom Hearts Re:Chain of Memories",
      "vibes": "7",
      "gameplay": "3",
      "review": [
        "I was challenged to play all the Kingdom Hearts games in order and I got the collection on playstation so I thought, why the fuck not, let's play this spin off card game. Shit is WEIRD.",
        "It's an action game like the main one, except the attack you do depends on what your next card is. So in order to get good at the game you have to manage your cards, and also fight in a 3D arena like in the first game. All is well and good but then you meet some boss and it's impossible to get past. I personally struggled with this bitch Larxene (shown in pic) halfway through the game. She is such a bitch I hate her so much.",
        "It completely recycles all the assets from the first game and just tells another bewildering story. At this point I'm just letting it all wash over me. We are introduced to a bizarre shadowy organisation full of villains who all speak with an irritating sarcastic tone constantly. It's a wonder that any of these characters get anything done because they don't know how to communicate at all.",
        "At some point in the game I decided I was in too deep and committed to completing the whole thing. I was forced to look up tactics for how to cheese some of these bosses because towards the end those health bars end up being ridiculously big. Cheesing works to an extent, but I have to admit, I had to get kinda good at the game to beat the bosses... maybe it wasn't so bad.",
        "What was bad was realising that when I completed the game, there's a whole second playthrough with Riku with a new story and new battle mechanics. I had to play it. That shit was also bullshit, just like the main game, and there were fewer opportunities to cheese opponents. Still, I did it. Beating Ansem at the end was really hard but I did it. Mickey Mouse randomly appeared. Riku is caught being edgier than ever before. I can't get over how different this game is to Kingdom Hearts 1."
      ],
      "image": "chainofmemories.jpg",
      "platform": "PlayStation 4",
      "year": "2023",
      "release": "2013"
    },
    {
      "name": "Kingdom Hearts 358/2 Days",
      "vibes": "5",
      "gameplay": "1",
      "review": [
        "I also plowed through and started the next “game” in the PlayStation 4 collection, which by the way has the prize for the most ridiculous game title in this list.",
        "SHIT ISN'T EVEN A GAME! This originally came out on DS and instead of remaking it like Chain of Memories, they just remade the cutscenes, and left out the gameplay. This is particularly wild because this story is part of the Kingdom Hearts lore and they put it in the collection so players can follow the story chronologically. Feels like super bad planning.",
        "About 15 minutes in when I realised this wasn't a game but rather a 3 hour movie of these terrible graphics I decided to accept the life I chose for myself and sit through it. This was made better by getting super stoned.",
        "I am blown away by the sheer volume of cutscenes of these characters eating ice cream while precariously balancing on the roof of a clocktower watching the sunset. It's genuinely all they ever do, their only activity. Despite this, the story continues to be baffling and bewildering. At this point I'm so far gone that I'm just letting the bizarre vibes of this entry in the series wash over me. Maybe Kingdom Hearts 2 will be a real game."
      ],
      "image": "icecream.jpg",
      "platform": "PlayStation 4",
      "year": "2023",
      "release": "2013",
      "story": true
    },
    {
      "name": "Tunic",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Similar to my favourite game the last two years, Outer Wilds, in this game you progress by gathering more knowledge as you play. It's so good, guys. It's such a satisfying game. I'm still thinking about it months later, it's my favourite game this year for sure",
        "You play as a cute little fox and you have to figure out what on earth you're meant to be doing by discovering little clues as you go. It's got so many moments where you slap your knee and go 'ooooohhhhh! That's what that's for!'. And it keep escalating and escalating.",
        "The soundtrack is also perfect. An electronic vibe, almost like you're playing inside a simulation. I listen to the soundtrack on the regular it's that good."
      ],
      "image": "tunic.jpg",
      "platform": "PlayStation 5",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Inscryption",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "As a lover of Slay the Spire, I was drawn to this story-driven card game. Yes it's creepy, but let me tell you it's worth your time. Don't read too much about it, just go in and enjoy all the twists the story has to offer - it's actually not as terrifying as it looks, and the game has SO MUCH to offer."
      ],
      "image": "inscryption.jpg",
      "platform": "PC",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Castlevania: Symphony of the Night",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Went back and played one of the classics and boy do I love it. This year I also played some more Castlevania but this is far and away the best one. It's so fun and I love the 18th Century setting.",
        "The music is amazing! How many metroidvanias have you played with actual classical music in it? And has any game ever nailed this dramatic, classy vibe like this before? Those character portraits are insane! I can only imagine how hype it must have been back then when you realise you don't play as Richter, but instead an actual vampire Alucard? So sick. Even the way he moves is just so cool. The whole game is so cool."
      ],
      "image": "castlevania-sotn.jpg",
      "platform": "PlayStation 1",
      "year": "2022",
      "release": "1997"
    },
    {
      "name": "Omori",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "This game was made with love. It's a story about being a recluse. It's very beautiful and the general vibe of the game with its presentation and music is top-notch. It's got that Earthbound energy which I always subscribe to. It's totally worth your time.",
        "There's a battle system with emotions, a pleasant combination of pixel art and hand-drawn aesthetics, a fun soundtrack, and an upsetting ending. What more could you want?"
      ],
      "image": "omori.png",
      "platform": "Switch",
      "year": "2022",
      "release": "2020"
    },
    {
      "name": "Everhood",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "This is a banger game. It's a rhythm game (always love a rhythm game) with a story & vibe which is undeniably similar to Undertale. If you're craving that kind of wacky, dark story along with very imaginative design and a cracking soundtrack, I highly recommend it.",
        "Some of the later challenges are actually impossible but I guess you have to leave something for the tryhards."
      ],
      "image": "everhood.png",
      "platform": "Switch",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Paradise Killer",
      "vibes": "10",
      "gameplay": "5",
      "review": [
        "Alright I'll straight up say that this game isn't a GOOD game per se... but I still rank it high because I love the vibe, the look, the music. If you don't have time to play this visual novel, I forgive you, but do take the time to listen to the soundtrack. Both the OST and the 'B-Sides' are great and available on the streaming service of your choice.",
        "I was kinda annoyed about the ending. I have an opinion about how it should have gone down and I want to talk about it but I need at least one other friend to have played this so I can discuss."
      ],
      "image": "paradise-killer.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2020",
      "story": true
    },
    {
      "name": "Chicory: A Colorful Tale",
      "vibes": "9",
      "gameplay": "6",
      "review": [
        "I came because I'm a massive Lena Raine fan and she did the soundtrack. The game is surprisingly good for a painting game! All the characters are named after food items and I named myself Aubergine which I thoroughly enjoyed the whole game.",
        "There were some cheesy nonsense moments, but the vibe was consistently good the whole time. I do recommend it!"
      ],
      "image": "chicory.png",
      "platform": "PC",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Elechead",
      "vibes": "8",
      "gameplay": "9",
      "review": [
        "This is a super fun 3 hour platforming experience. It's a super tight, well designed little package of fun. Each puzzle makes you feel like a superstar for beating it, it's so satisfying. Give it a try!"
      ],
      "image": "elechead.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Slice & Dice",
      "vibes": "4",
      "gameplay": "8",
      "review": [
        "It's a mobile game! Yep. Worth it. It's a super well designed little dice-based roguelike, and I got really into it this year. You can just jump in and play for a little bit at a time, and it scratches that Slay the Spire itch.",
        "I didn't get the achievement where you have to win like two ultra-hard runs in a row. That is actually impossible and I was annoyed that I couldn't neatly complete the game 100%."
      ],
      "image": "slice-and-dice.jpg",
      "platform": "Mobile",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Kirby and the Forgotten Land",
      "vibes": "8",
      "gameplay": "6",
      "review": [
        "This is a great kirby game! Perfect for playing with your partner. Co-op kirby is such a pleasure. It's very cute!",
        "I'm impressed that they came up with the name Mouthful Mode and just made a kirby game out of it. OK I guess it's actually just more of the same Kirby as we know. One thing I appreciate about Kirby games is how it's all happy slappy until the final boss, which is consistently some kind of world-devouring cosmic horror. This game definitely doesn't disappoint in that regard."
      ],
      "image": "kirby-forgotten-land.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Elden Ring",
      "vibes": "10",
      "gameplay": "4",
      "review": [
        "I gave this game, a very different kind of game for me, a good go! I recognise that it's amazing, not least because of the amazing vibe. The first area looks so stunning with the cloudy stormy sky over the lit-up landscape, and the magical elements of the huge golden trees. This world was created with a vision and I appreciate that.",
        "But the game has multiple barriers of entry. There's Margit, who I of course had no chance against. Luckily, a friend told me about a quest I should do somewhere near the beginning, and that was great because I got a +8 spear out of it, which made me super powerful. I also enjoyed using the spear at a weapon. I used that spear to get me through Margit and also two other big bosses.",
        "Rennala was a huge struggle, even though the vibes of her magic academy and boss fight in general were immaculate, because the +8 spear was no longer enough to carry me through the game. I managed to finally beat her and I did feel that sense of accomplishment that Dark Souls fans don't shut up about, but when I realised that I need to learn how to either upgrade the spear or start with another weapon, and also when I realised that I invested my levelled up stats all wrong, I lost interest.",
        "The second barrier of entry is learning the stats and mechanics of the game, and that shit is not well communicated in the game. I feel like you need to have the implicit knowledge from previous FromSoft games or a friend to teach you this stuff. Or you spend ages reading the wiki, which for me a red flag when it comes to video games.",
        "So sorry, Elden Ring fans, I didn't get into it. But I you can't tell me I didn't try, I mean I beat Rennala."
      ],
      "image": "elden-ring.jpg",
      "platform": "PlayStation 5",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Xenoblade Chronicles 3",
      "vibes": "8",
      "gameplay": "4",
      "review": [
        "I gave up this game during chapter 4! I feel bad about it because I made it through Xenoblade 2 when it first came out and genuinely enjoyed it, and thought that Xenoblade 1 was super good. But this one is just so MUCH! There are 6 characters all screaming out their catchphrases constantly, and there's so much going on that I can't concentrate. Sometimes I start a fight and have to put the switch down because it's all too much.",
        "I have tried two times to resume the game because I'm told chapter 5 is really good, but it's really hard to get back into it again, because I can't remember any of the systems. And those characters are just all so loud. I do kinda like the characters this time round though, especially Eunie, who is a total babe.",
        "Also is it just me or are the environments not as amazing as the first two games? Maybe I haven't figured out what's going on with the land (there's normally a big overarching explanation for this stuff) but where is wow-factor that I got from the Kingdom of Uraya? Or Satorl Marsh? Hmm maybe I should try to start playing again. I think would have to do it together with a Xenoblade fan who can help me. I think I'm stuck on a difficult boss fight. Maybe I should reduce the difficulty."
      ],
      "image": "xenoblade-3.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Persona 5: Royal",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "This game so fucking long. Jesus Christ. It doesn't need to be this long. For some reason I completed all of this one. It was a great game for the first 40 hours or so but my dumbass finished all 100 hours out of pure spite. When I finally beat a literal God and then had to do the 'royal' content I was so pissed. I was like, it's not over???",
        "I will say that the vibes are immaculate, the soundtrack is class, 'Last Surprise' never gets old somehow, and Kasumi is cute. I don't normally do the anime stuff normally but I did enjoy all the nonsense. Akechi and Joker's moments together were so gay. And at one point they go to Hawaii which is hilarious."
      ],
      "image": "persona-5.jpg",
      "platform": "PlayStation 5",
      "year": "2022",
      "release": "2019"
    },
    {
      "name": "Scarlet Nexus",
      "vibes": "7",
      "gameplay": "4",
      "review": [
        "I was jamming to this OST for months before I decided to give the game a spin. It's pretty middle of the road in terms of gameplay, especially for me as I'm not a hack & slash fan. But I love games with good vibes and this one has a great vibe and I enjoyed it. I liked the design of the main characters and had a crush on the guy."
      ],
      "image": "scarlet-nexus.jpg",
      "platform": "PlayStation 5",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Valheim",
      "vibes": "7",
      "gameplay": "5",
      "review": [
        "I had the pleasure of sharing a Valheim server with my friend Falco and his buddies. My little computer didn't have the strength to properly compute this game but I still enjoyed building a little house and riding the boat with some cool dudes. I know that this isn't my thing really but it reminded me that playing online games co-op with friends is just a lot of fun."
      ],
      "image": "valheim.jpg",
      "platform": "PC",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Boomerang Fu",
      "vibes": "5",
      "gameplay": "6",
      "review": [
        "A super fun party game on switch to enjoy with your friends and family. It's got similar vibes to Towerfall, which is great. It's not the best or anything but still worth your time and money for sure. It will entertain a group for an hour or so!"
      ],
      "image": "boomerang-fu.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2020"
    },
    {
      "name": "Psychonauts 2",
      "vibes": "5",
      "gameplay": "4",
      "review": [
        "Playing this game reminded me of games which feel like I've paid for some content and am now receiving that content. I made it through to the end but it didn't make me feel much. Maybe I would have enjoyed it more if I were a child. I think I liked the first one because I was younger when I played it."
      ],
      "image": "psychonauts.png",
      "platform": "PlayStation 5",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Gorogoa",
      "vibes": "7",
      "gameplay": "5",
      "review": [
        "This is a little puzzle game that you can breeze through in one sitting. It's good!"
      ],
      "image": "gorogoa.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2017"
    },
    {
      "name": "Super Castlevania 4",
      "vibes": "7",
      "gameplay": "2",
      "review": [
        "It's my goal to complete the games that all the smash characters are from and to that end I got the Castlevania collection on switch. This game is great but it's hard as balls. I was only able to complete it because I used save states.",
        "It's nice to see some castlevania classics here, but it's not even a metroidvania, rather just a series of hard-as-nails platforming challenges. Music is great though."
      ],
      "image": "castlevania-4.jpg",
      "platform": "SNES",
      "year": "2022",
      "release": "1991"
    },
    {
      "name": "Castlevania",
      "vibes": "5",
      "gameplay": "1",
      "review": [
        "Decided to take the time to save-scum my way through the OG Castlevania in honour of the OG Simon Belmont. Even harder than the other one but had to do it for my education. I don't recommend this game."
      ],
      "image": "castlevania-nes.jpg",
      "platform": "NES",
      "year": "2022",
      "release": "1986"
    },
    {
      "name": "Castlevania: Rondo of Blood",
      "vibes": "6",
      "gameplay": "1",
      "review": [
        "I wanna play all the games from all the smash characters so I had to play Richter's game. I had to get a separate collection on playstation for this one, which is fine except that this one doesn't come with save states, so I actually got straight up stuck against Death. I couldn't beat him so I gave up."
      ],
      "image": "castlevania-rondo.jpg",
      "platform": "PlayStation 1",
      "year": "2022",
      "release": "1993"
    },
    {
      "name": "Kirby's Dream Buffet",
      "vibes": "4",
      "gameplay": "2",
      "review": [
        "It was a fun time playing this online with friends! However it doesn't have too much depth as a game and we only played it once."
      ],
      "image": "kirby-dream-buffet.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Spiritfarer",
      "vibes": "6",
      "gameplay": "1",
      "review": [
        "I do enjoy a peaceful game with good vibes only and this is that. I didn't see it through to the end however because the gameplay loop didn't hook me in. It looks great though. You can fish off the end of the boat and just doing that is the highlight of the game."
      ],
      "image": "spiritfarer.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2020"
    },
    {
      "name": "Mario Strikers: Battle League",
      "vibes": "6",
      "gameplay": "2",
      "review": [
        "A great party game when you have the full 8 players. We had a great time with it and the animations for the characters are fun. However there isn't much meat on the bones. I don't think it's worth buying, it wouldn't be fun on your own, but maybe I'm just bitter because I'm not a football fan."
      ],
      "image": "mario-strikers.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Rain World",
      "vibes": "9",
      "gameplay": "7",
      "review": [
        "This is a survival game with some of the craziest enemy AI I've ever seen. There is this whole ecosystem of creatures that have their own lives. You really feel like prey in a world of predators. Like the enemies are never in the same place when you respawn you have to be constantly alert.",
        "I recognise that this is a good game. However, I found it so fucking terrifying that I had to stop playing. The monsters were so scary and sometimes it would start raining and jesus christ. The rain, and those horrible birds that pick you off, it's just all very upsetting and I decided to stop.",
        "If you are strong, you can play this and join the chorus of people who say it's amazing."
      ],
      "image": "rainworld.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2017"
    },
    {
      "name": "Pokémon Legends: Arceus",
      "vibes": "2",
      "gameplay": "5",
      "review": [
        "I hate to be that bitch but I couldn't enjoy this game because the graphics were so bad. And I resented how the pokemon would sit around in groups and do nothing. It was better in pokemon snap when they actually did stuff. As usual, this Switch Pokemon game would have been better if they spent more time making it. So much wasted potential!",
        "I support them trying new things but can't they just wait 3 years between releases so they can actually release a good game which actually has some vibes."
      ],
      "image": "pokemon-arceus.png",
      "platform": "Switch",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Wandersong",
      "vibes": "2",
      "gameplay": "2",
      "review": [
        "It's a game about singing but it was really boring! I thought you couldn't really go wrong if your premise was to sing to solve puzzles but yep, I switched off pretty quickly."
      ],
      "image": "wandersong.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2018"
    },
    {
      "name": "LISA: The Painful",
      "vibes": "2",
      "gameplay": "1",
      "review": [
        "I'm sure this game is good... but it just has such a horrible vibe. It's miserable and it was upsetting me too much. I admit I didn't get very far into the game but I already knew that this would be nothing for me."
      ],
      "image": "lisa.jpg",
      "platform": "PC",
      "year": "2022",
      "release": "2014"
    },
    {
      "name": "Pac-Man World: Re-Pac",
      "vibes": "2",
      "gameplay": "1",
      "review": [
        "Oh boy, this is a genuinely bad game. It didn't age very well. For some reason I completed it... it's that part of me that wants to play all the games of smash characters. By the end I was incredulous that a) it was real and b) I was still playing it.",
        "Tragically, this game had a lot of influence on Pac-man's design in Smash. It's incredible that they actually remade this game."
      ],
      "image": "pacman.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Sports Story",
      "vibes": "0",
      "gameplay": "1",
      "review": [
        "This game is straight up unfinished. It's almost embarrassing! It's a technical mess. Golf Story was such a banger with such clean gameplay, so what went wrong? Why does golf have fewer features and why is the whole thing so glitchy and unpolished? I feel bad for the studio because they clearly bit off more than they could chew with this game. It's probably enough to prevent them from making new games in the future. Pretty sad."
      ],
      "image": "sports-story.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2022"
    },
    {
      "name": "Loop Hero",
      "vibes": "2",
      "gameplay": "0",
      "review": [
        "I picked it up because it looked innovating and new. But it's almost like they didn't think their loop concept through enough! It felt unbalanced and pointless. Why is there even a loop?"
      ],
      "image": "loop-hero.jpg",
      "platform": "Switch",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Unpacking",
      "vibes": "1",
      "gameplay": "0",
      "review": [
        "Do not play this game. It's literally just work. You pay money for a “game” where you have to unpack things from boxes. Who actually enjoys doing that. This isn't how you tell a story. Don't buy it."
      ],
      "image": "unpacking.png",
      "platform": "Switch",
      "year": "2022",
      "release": "2021"
    },
    {
      "name": "Outer Wilds: Echoes of the Eye",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "My favourite game this year was a DLC. Outer Wilds was already insanely mind-bending and amazing, and this DLC totally matches it. This is equally as good as the main game!",
        "I implore all my followers to play this game and to do it blind. It's fascinating and terrifying, and unlike anything else you've played.",
        "The vibe is a little more horror than the base game. 'A little more horror' I say, I was the one with my heart BEATING playing through those certain sections. I was genuinely breathless, terrified. When I thought about the game while I was at work, I would get scared thinking about it! It took so much emotional strength to get through the Starlit Cove. After writing that sentence I went and looked at someone play through Starlit Cove and I got scared again!! It's a terrifying game!!"
      ],
      "image": "outer-wilds-echoes.jpg",
      "platform": "PlayStation 5",
      "year": "2021",
      "release": "2021"
    },
    {
      "name": "Subnautica",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Imagine you crash land on a planet covered in water and the only thing there is the massive spaceship you came on, crashlanded really far away. It's a strong image! After putting out the initial fire in your escape pod, you need to somehow survive on an underwater alien planet! It's so cool!",
        "I was really blown away by this game. The fish and the plants all look so cool. You're lucky to start in a shallow area, with the land almost poking out of the water to form an island but not quite. After you explore the immediate area, you have to go to deeper waters and let me tell you, diving deeper is fucking terrifying! Never have I felt the true terrifying power of big open spaces, deep black water beneath you, losing sight of the light hitting the surface. It's fucking terrifying.",
        "Then there's actually a whole story to the game that you slowly uncover as you explore more. It's so fascinating and cool. I loved this game so much."
      ],
      "image": "subnautica.jpg",
      "platform": "PlayStation 5",
      "year": "2021",
      "release": "2018"
    },
    {
      "name": "Metroid: Dread",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "A terrifying and excellent game. The feeling when you have to go into another killer robot zone 😱. I am very weak when it comes to horror, and video game horror is just a next level for me because you have to actually escape!",
        "Luckily, the is much more than that, it's also a huge vibe. Samus is so badass it hurts, and the planet looks so good. There's a great twist half way through for Metroid fans."
      ],
      "image": "metroid-dread.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2021"
    },
    {
      "name": "Deltarune: Chapter 2",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "Toby Fox blew it out of the water again. This only takes 3 hours or so to complete and it was such a lovely time. It has that same dark vibe to it as undertale and the first deltarune, and it also manages to bring new ideas. Particularly impactful is the focus on the controlling relationship in the Snowgrave route.",
        "Plus the soundtrack, of course. I love \"A CYBER'S WORLD\" so much."
      ],
      "image": "deltarune-2.png",
      "platform": "PC",
      "year": "2021",
      "release": "2021"
    },
    {
      "name": "Disco Elysium",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "It's a slow burner, but I have to admit that it's one of the very best stories/writing I've ever seen in a game.",
        "The setting? An under-funded town in some empire where everything reeks of sleaze. You are a detective who has a terrible reputation and a drinking problem. You start the game by apologising after you crashed your police car. Luckily, an actual capable detective comes to be your partner, Kim Kitsuragi. He is such a babe and I would die for him.",
        "The game is really great for forcing you to look at things with another perspective. Like when you get asked about your politic views, you get absolutely lambasted for being a centrist, it's very eye-opening. The things you'll end up doing in this game are crazy. Somehow the game made me think giving drugs to a child would be a good idea.",
        "My tip is to not play the switch port, because the loading times are insanely long."
      ],
      "image": "disco-elysium.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2019"
    },
    {
      "name": "WarioWare: Get It Together!",
      "vibes": "9",
      "gameplay": "9",
      "review": [
        "This series will always have a special place in my heart. I love the very specific Wario humour. It's just got so many toilet jokes and I love it. Also it's the most fun to play in the series by far. I really enjoyed the mechanic with the playing with characters, I think it worked amazingly."
      ],
      "image": "warioware-get-it-together.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2021"
    },
    {
      "name": "Fez",
      "vibes": "9",
      "gameplay": "8",
      "review": [
        "A really cool puzzle game that I got totally into. I love puzzle games. And especially when they have so many layers like this one. This totally defined a genre of ultra hard indie puzzle games.",
        "The soundtrack is by Disasterpeace who also did Hyper Light Drifter, and it's both harsh and peaceful. A great vibe all around."
      ],
      "image": "fez.png",
      "platform": "Switch",
      "year": "2021",
      "release": "2012"
    },
    {
      "name": "A Short Hike",
      "vibes": "10",
      "gameplay": "6",
      "review": [
        "I loved this. It looks like a DS game!? So good. Love the soundtrack. Love the animal crossing/BOTW vibes. I would complain it's too short but it's literally called a Short Hike. I've replayed it like three times it's that good."
      ],
      "image": "shorthike.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2019"
    },
    {
      "name": "Xenoblade Chronicles: Definitive Edition",
      "vibes": "8",
      "gameplay": "8",
      "review": [
        "As part of my Nintendo education, this was definitely necessary! I really enjoyed my time with the game, and it has the best locations and setting ever. The whole things takes place on the body of a massive monster that became a bit statue. All sorts of shit happens, including a lot of nonsense.",
        "It was really long and I do wish it wasn't that long. But I was engaged enough to keep going all the way to the end."
      ],
      "image": "xenoblade.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2020"
    },
    {
      "name": "Axiom Verge",
      "vibes": "8",
      "gameplay": "7",
      "review": [
        "A small, clean, indie metroidvania. Really enjoyed it. I was just super impressed with some of the really clever upgrades you can get. Been meaning to play the second one too."
      ],
      "image": "axiom-verge.png",
      "platform": "Switch",
      "year": "2021",
      "release": "2015"
    },
    {
      "name": "Abzu",
      "vibes": "10",
      "gameplay": "5",
      "review": [
        "I'm normally not into arty farty games, but I love fish and sea life so this one was great. The perfect chill out game. Soundtrack has Ecco the Dolphin vibes. Great to smoke weed to."
      ],
      "image": "abzu.jpg",
      "platform": "PlayStation 5",
      "year": "2021",
      "release": "2016",
      "story": true
    },
    {
      "name": "Super Mario 3D World + Bowser's Fury",
      "vibes": "6",
      "gameplay": "7",
      "review": [
        "The base game is such a good party game with the right group. I played it online with some old friends and it was awesome. I remember enjoying the original with friends in much the same way back then and this was such as great.",
        "Bowser's Fury was a short but really fun romp!"
      ],
      "image": "mario-3d.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2021"
    },
    {
      "name": "Ring Fit Adventure",
      "vibes": "8",
      "gameplay": "5",
      "review": [
        "Borrowed this from a friend when I was losing motivation for those lockdown home workouts. It's great! I love the vibe of Wii Fit and this takes it further. The ring itself is pretty good, the overhead squeeze exercise is so hard.",
        "It's not nearly as good as an actual trip to the gym, but it'll do if there's another pandemic. It's also insanely long, and despite genuinely doing loads of workouts with it, I only got through half of the worlds."
      ],
      "image": "ringfit.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2019"
    },
    {
      "name": "Frostpunk",
      "vibes": "4",
      "gameplay": "8",
      "review": [
        "I average one new management sim game each year and this time I played this winter-themed survival game. This was good and addicting! I really enjoyed how it was about just crisis after crisis and trying to just make it through. The main storyline has the temperature drop and drop until there in an insane storm. The relief when you make it through to the other end is amazing!"
      ],
      "image": "frostpunk.jpg",
      "platform": "PC",
      "year": "2021",
      "release": "2018"
    },
    {
      "name": "Inside",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "Hard to describe what this game is but I enjoyed it a lot. A very dark and düster vibe as you make your way through some horrible factory. One of those games that makes you feel something. The ending is really cool."
      ],
      "image": "inside.png",
      "platform": "PlayStation 5",
      "year": "2021",
      "release": "2016"
    },
    {
      "name": "Bugsnax",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "First game I played on my new playstation. Unashamed to admit I played it because my favourite band (Kero Kero Bonito) did the theme song. I like the vibe and the game and characters are pretty cute. I do think it's all a bit forced though. I reckon the game could have benefitted from being more fucked up."
      ],
      "image": "bugsnax.png",
      "platform": "PlayStation 5",
      "year": "2021",
      "release": "2020"
    },
    {
      "name": "Horizon: Zero Dawn",
      "vibes": "6",
      "gameplay": "6",
      "review": [
        "A BEAUTIFUL and gorgeous-looking game. At first I was put off by it, also because I was scared of the dinosaurs, but I came back to it later and completed it. The story is really nice, although it's got this triple A video game sheen all over it which I don't like. It feels like I'm playing a video game, not that I'm actually a hunter warrior lady who shoots arrows at robot dinosaurs."
      ],
      "image": "horizon.jpg",
      "platform": "PlayStation 5",
      "year": "2021",
      "release": "2017"
    },
    {
      "name": "Rocket League",
      "vibes": "2",
      "gameplay": "6",
      "review": [
        "A lockdown party game with old friends. It's a lot of fun and honestly can totally recommend if you want to reconnect with specifically two other friends by playing online.",
        "Definitely not a fan of the micro-transactions and monetisation. Fuck that shit."
      ],
      "image": "rocket-league.jpg",
      "platform": "PlayStation 5",
      "year": "2021",
      "release": "2015"
    },
    {
      "name": "New Pokémon Snap",
      "vibes": "3",
      "gameplay": "5",
      "review": [
        "The gameplay of this game is alright, although I got frustrated from having to replay the same courses over and over again. It also has that “generic” nintendo pokemon polish which takes away the soul in this case.",
        "I'm disappointed about the graphics, honestly, and even though they put more energy into it than your average pokemon game, it still kinda looks shit. For a photography game that is no longer on the N64, I want some next level graphics."
      ],
      "image": "pokemon-snap.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2021"
    },
    {
      "name": "Captain Toad: Treasure Tracker",
      "vibes": "5",
      "gameplay": "4",
      "review": [
        "This game is great for a while, but it didn't take me too long to realise that puzzles of these kind can only have so much depth. Finding the solution is always easy when the scope is so small. I think the game overstayed its welcome a little."
      ],
      "image": "captain-toad.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2014"
    },
    {
      "name": "Bug Fables",
      "vibes": "6",
      "gameplay": "4",
      "review": [
        "This game has some heart, which I appreciate, but I just found it quite boring. It tries to be Paper Mario a little too much, and doesn't really make its own “bug fables” identity. I wish it just had that special X factor which elevates some games over the rest. I don't even have specific feedback I just didn't vibe with it I guess."
      ],
      "image": "bugfables.jpg",
      "platform": "PlayStation 5",
      "year": "2021",
      "release": "2019"
    },
    {
      "name": "Eastward",
      "vibes": "7",
      "gameplay": "3",
      "review": [
        "The presentation is 10/10, but it's trying way too hard to be Mother 3. The writing isn't good enough. Each cutscene leads me not understanding what's going on, despite pressing A through tons of dialogue. Lots of missed opportunities in the story. I was quite disappointed and overwhelmed. I was happy when it was over."
      ],
      "image": "eastward.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2021"
    },
    {
      "name": "Pokemon: Brilliant Diamond",
      "vibes": "2",
      "gameplay": "4",
      "review": [
        "Nostalgia fueled my playthrough. Otherwise, I have to say it's a bad game! Why no platinum dex? Was pokemon always this easy? The most fun I had was using Metronome with my Clefairy.",
        "I will say that in this team I had a Lickilicky, and it's when I got my strange obsession with that Pokemon. It's just so ugly!",
        "Overall this game is a huge disappointment, because the original is so special and this is a soulless version of it. Talk about games not being made with love."
      ],
      "image": "pokemon-diamond.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2021"
    },
    {
      "name": "Fire Emblem: The Binding Blade",
      "vibes": "3",
      "gameplay": "1",
      "review": [
        "In my quest to complete all the games of all the smash characters, I had to tackle this obscure fan translation of FE6. Not gonna lie it's shit game and not nearly as good as FE7.",
        "In the end, I didn't complete it. I got halfway through, but I was playing on an emulator and when I changed my phone I accidentally corrupted my save file. I really don't want to start it again because it's quite long and not very fulfilling. I decided that being FE7 is enough for the challenge because it features Roy as a baby boy at the end. Maybe I don't need to force myself to play bad games just for this random challenge I want to do."
      ],
      "image": "fireemblem-6.jpg",
      "platform": "Gameboy Advance",
      "year": "2021",
      "release": "2002"
    },
    {
      "name": "Xenoblade Chronicles 2: Torna The Golden Country",
      "vibes": "1",
      "gameplay": "1",
      "review": [
        "Having enjoyed XB1, and with Pyra & Mythra coming to smash, I decided to come back to this DLC but I just couldn't get through it. The characters in XB2 are so badly designed it hurts. The writing is also bad. And they changed the battle system so I have to learn even more random things. And this one boss was randomly super difficult so I changed the difficulty to easy which made it really boring. A real struggle, this game."
      ],
      "image": "xenoblade-torna.jpg",
      "platform": "Switch",
      "year": "2021",
      "release": "2018"
    },
    {
      "name": "Outer Wilds",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "I still think about this game. It was so much fun to explore this handcrafted solar system (!) while reading lore and dying in new and fantastic ways. If there was one game I wish I could play blind again it's this. I can't write too much about it here because the more you know about it, the more you ruin the experience of playing it for the first time.",
        "So take my word for it, stop what you're doing and boot up Outer Wilds. It'll be a fun, emotional and at times scary ride. If you don't understand what's going on in the first hours, keep trying!"
      ],
      "image": "outer-wilds.jpg",
      "platform": "PlayStation 5",
      "year": "2020",
      "release": "2019"
    },
    {
      "name": "Streets of Rage 4",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Oh hell yeah this game is so fucking good. It's so much fun and such a cool game and the MUSIC! It's inspired by classic house music and goes so hard. The original SoR also had insane music and this successor totally channels the vibe perfectly.",
        "It has such an amazing style. Beating up cops in the city, supernatural nonsense, throwing crowbars at people in the streets, eating floor turkeys. It's got everything. I played it a whole bunch and got really good with Floyd of all characters. Normally I do not vibe with heavy characters but we just connected!"
      ],
      "image": "streets-of-rage.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "Slay the Spire",
      "vibes": "7",
      "gameplay": "11",
      "review": [
        "The first time I played this it didn't managed to get its hooks and claws into me. But I kept coming back. Why? Because this is one of the best games in the world!!!",
        "I may have started playing in 2020, but I got so fucking into this in the 5 years after as well. It started by climbing the ascensions, then getting all the achievements, then just when I thought I was done, I set myself the challenge of beating the heart on A20 with all characters.",
        "I managed to do it first try with the Watcher because well it's the Watcher. At that point I stopped playing her entirely because of the infinite, but the other three are all beautiful and perfect. I got Ironclad with a dead branch corruption deck of course, eventually managed to get Silent through with a poison deck, and then spent ages just grinding Defect until I finally got it in 2024. Around then, Balatro entered my life so I was able to say goodbye and officially start waiting for the second game."
      ],
      "image": "slay-the-spire.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2019"
    },
    {
      "name": "Animal Crossing: New Horizons",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "This game is food for the soul. It will calm you down when you are feeling stressed and be there for you in hard times. I've loved this game since wild world so this new version was a dream come true.",
        "I spent a year in this game, making the most perfect and beautiful island. I loved visiting other islands of friends during the pandemic and I loved making art in the game.",
        "I do with the villagers were a little feistier and/or a bit more interesting. I remember the villagers saying the wildest things in older games... but it's fine because there's so much other stuff in there to make up for it.",
        "Like the soundtrack! This time round we have a pretty upbeat set of hourly themes to enjoy. At first I was anti because there's too much peppy synth but I've come to love it. It's different but also the same. And with the 2.0 update there are a whole bunch of new KK Slider tracks, and I happen to love KK Slider tracks. I even made a ranking of them <a href=\"http://worldpeace.services/music/nintendo/kk\">here</a>."
      ],
      "image": "animal-crossing.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "CrossCode",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "What a gorgeous action RPG! What I thought would be a 10 hour indie game ended up being one of the most compelling stories and settings I've ever seen. And that Soundtrack! And it was made in Germany!",
        "This RPG is so fun! The battling is super fun and the story is wild. The music is great and I have come back to this OST a lot. I kinda regret the non-ending, it feels like it was a bit unfinished. Then when the free DLC came it felt tacked on."
      ],
      "image": "crosscode.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2018"
    },
    {
      "name": "Pikmin 3 Deluxe",
      "vibes": "9",
      "gameplay": "8",
      "review": [
        "I love the Pikmin series with all my heart so you KNOW I was double dipping for this one. This game looks amazing! I love the areas, the music, the bosses, the enemies, and even the characters. I love the super detailed models of the fruit, although it's a bit silly that there's just all this fresh fruit lying around, and no treasures like before.",
        "This deluxe edition came with some extra content but I don't think it was very good. In the end I just got this to replay the Wii U game which I loved and actually felt nostalgia for."
      ],
      "image": "pikmin-3.png",
      "platform": "Switch",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "Hades",
      "vibes": "8",
      "gameplay": "9",
      "review": [
        "I rode the Hades wave in the autumn and I loved it. This game has such a good presentation and is so accessible. Hard not to recommend this to anyone. Can't stand the Americans putting on British accents though what were they thinking."
      ],
      "image": "hades.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "One Step From Eden",
      "vibes": "9",
      "gameplay": "8",
      "review": [
        "This is a really cool indie title which has the same deckbuilding element as Slay the Spire, but it's an action game. I came for the music and I stayed for... the music. The soundtrack is such a bop! It's this maximalist, over the top music by an artist I really like called STEEL_PLUS."
      ],
      "image": "onestep.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "NieR: Automata",
      "vibes": "9",
      "gameplay": "9",
      "review": [
        "Really enjoyed the aesthetic in this game. Everything looked so beautiful. The story was dramatic, the worldbuilding great, the characters great, the ending(s) cool. Music is fantastic!",
        "Small things irritated me like you walk a bit and suddenly the forest turns into a desert.. And they make you look at 2B's ass the whole game which for me was a bit much."
      ],
      "image": "nier.jpg",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2017"
    },
    {
      "name": "Final Fantasy VII",
      "vibes": "9",
      "gameplay": "6",
      "review": [
        "In January I played the OG FF7 and had a blast. It was slow but I pulled through, for cultural reasons. It's an amazing story and I wish I had played it as a child.",
        "These cute little blocky fellows navigate a complex world where there was an energy revolution when Mako was harvested by an evil corporation. It turns out Mako is the lifeblood of the planet and environmental destruction might not be a great idea after all. It features Cloud, the edgiest bitch ever but in this game even he is alright. Sephiroth is amazing and there are so many great moments.",
        "The music is legendary! Listen to this <a href=\"https://youtu.be/PIkTNZUbeBE\">late-game track</a> that I love."
      ],
      "image": "sephiroth-cloud.gif",
      "platform": "PlayStation 1",
      "year": "2020",
      "release": "1997"
    },
    {
      "name": "Final Fantasy: VII: Remake",
      "vibes": "5",
      "gameplay": "7",
      "review": [
        "After playing the original, I also figured why not play the remake too. I can totally see how people think it's amazing, especially if they've played the original, but the writing was really bad so I couldn't take it very seriously. It was also very jarring to have a lot of the cartoon elements of the original in HD. I think the vibe is missing on this game quite a bit.",
        "I liked the remixed music tracks a lot, and I enjoyed playing as Barret. It felt a bit cheap to only play a third of the story of the original though."
      ],
      "image": "final-fantasy.png",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "The Witness",
      "vibes": "5",
      "gameplay": "8",
      "review": [
        "An environmental puzzle game on the PlayStation 4 which I got really into. The puzzles are always difficult but never impossible and the game comes with a cool message too. I just love puzzle games like this, and this was a bit different to usual because it was in 3D! So many angles to look at the puzzles."
      ],
      "image": "witness.jpg",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2016"
    },
    {
      "name": "Factorio",
      "vibes": "3",
      "gameplay": "9",
      "review": [
        "BEWARE this game. It's extremely addicting, and for what? Endless progress. Seriously this game has no end. I played multiplayer with 3 friends and we're gone for 8 hours at a time. It's actually kind of miserable.",
        "Once I replayed it on my own to make an ultra efficient factory and I realised that it's just fucking work. It's just programming. Optimising algorithms and refactoring old code. Dealing with bugs (literally). It's just like my job as a programmer. When I realised that I promised myself to stop forever. I will not touch the DLC."
      ],
      "image": "factorio.jpg",
      "platform": "PC",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "Towerfall",
      "vibes": "8",
      "gameplay": "7",
      "review": [
        "I started playing this kick-ass indie fighter with my friends this summer and it's hilarious. Super good party game now that I'm too good at smash to play that with my friends. I find that it's really accessible and everyone can get into it, even if you're bad at video games. I'm also intrigued by all this unlocking I've been inadvertently doing."
      ],
      "image": "towerfall.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2013"
    },
    {
      "name": "Paper Mario: The Origami King",
      "vibes": "9",
      "gameplay": "5",
      "review": [
        "As a fan of the originals I had some high hopes, but I was reminded that this game truly is for kids. I beat the game but I've probably outgrown it. I didn't love the battle system so it was at times a bit of a slog.",
        "But the vibe of the game is fab. It's got some hilarious writing, and I love the music so much. <a href=\"https://www.youtube.com/watch?v=zCXrspb-qLg\">This video</a> helped me realised how fucking great the soundtrack is. I didn't realise! These covers are so good and the team at Intelligent Systems who do music just go so fucking hard every game they do. They are amazing."
      ],
      "image": "paper-mario.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "Super Mario 3D All-Stars",
      "vibes": "8",
      "gameplay": "7",
      "review": [
        "This game was a rip-off but I'm a nintendo slut and bought it anyway and really enjoyed playing all three games, although I was mainly just reminded of how good Odyssey is.",
        "It consists of Mario 64, Sunshine and Galaxy. All classics. But it's pretty scandalous that they took it off the eshop and had it as like a limited game only. I hope they never do that again."
      ],
      "image": "mario-all-stars.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2020"
    },
    {
      "name": "Death Stranding",
      "vibes": "9",
      "gameplay": "3",
      "review": [
        "I just wanted to give it a try because I'd heard so much yet knew so little about it... What kind of vibe was this? The vibe was terrifying. It's like a scary, horror, dystopia vibe and they honestly nail it. You just have to walk around making deliveries in this horrible place where at any moment you could get attacked by the most terrifying monsters ever. They are literally invisible, and when they find you the whole world turns into a sea of black goop, it's terrifying.",
        "I played about 15 hours but this game is not for the faint of heart like me. I was so terrified of those monsters that I couldn't play anymore."
      ],
      "image": "deathstranding.jpg",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2019"
    },
    {
      "name": "Katamari Damacy: Reroll",
      "vibes": "8",
      "gameplay": "2",
      "review": [
        "A crazy japanese game about rolling up junk into a ball. I like the big dude who tells you to do stuff in the game. The music is also great. Truly one-of-a-kind. But apart from that I was snoozing, and the gameplay kinda feels like work."
      ],
      "image": "katamari.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2018"
    },
    {
      "name": "The Last of Us",
      "vibes": "5",
      "gameplay": "5",
      "review": [
        "I recognise that this is a great game but as someone who doesn't do well with either violence or suffering, I found it very upsetting. I did beat it though!"
      ],
      "image": "lastofus.jpg",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2013"
    },
    {
      "name": "Shadow of the Colossus (PS4 Remake)",
      "vibes": "8",
      "gameplay": "2",
      "review": [
        "I really tried with this game, I promise. But the empty walks to the titans, and then the weird formulaic way of defeating them?? Like each one has a little puzzle “how do I get on it” and then you're set. Couldn't finish it.",
        "But I respect that it has an excellent vibe. The emptiness and the sadness behind killing these beasts is very profound, and the steady descent into corruption is a really nice idea. I went back and watched someone else complete the game which was quite nice."
      ],
      "image": "shadow.jpg",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2018"
    },
    {
      "name": "Horace",
      "vibes": "7",
      "gameplay": "2",
      "review": [
        "I've been playing this surprisingly deep (& very cheap) indie game. It's littered with references to pop culture and is very British, but I must be in the narrow target audience because I'm enjoying it. It is way too long though and I straight up don't recommend it!"
      ],
      "image": "horace.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2019"
    },
    {
      "name": "A Way Out",
      "vibes": "2",
      "gameplay": "4",
      "review": [
        "This is a silly co-op game about escaping prison that I enjoyed playing in the summer. There are absolutely no stakes, so failure doesn't mean anything. I guess it's more of a visual novel. It's gimmick is that it's co-op but I don't think it's actually that good. The story is pretty trope-y."
      ],
      "image": "wayout.png",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2018"
    },
    {
      "name": "Ori and the Blind Forest",
      "vibes": "7",
      "gameplay": "5",
      "review": [
        "This is the first of the games on this list that I describe as “beautiful for the sake of being beautiful”. They really put all their eggs into that basket. It looks alright, but I found myself being resentful at how much it was showing with its lovely lighting. So petty, I know."
      ],
      "image": "ori.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2015"
    },
    {
      "name": "Gris",
      "vibes": "4",
      "gameplay": "2",
      "review": [
        "Tbh I would buy prints of some screenshots of the later parts of this game and hang them in my apartment. But I find these kinds of games a little over the top. I guess they're meant to be emotional and to make you feel something but I just felt resentful."
      ],
      "image": "gris.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2018",
      "story": true
    },
    {
      "name": "Journey",
      "vibes": "5",
      "gameplay": "3",
      "review": [
        "I blasted through this in an evening and it was alright. Again it's just soaked in imagery, but not actually making a point or leaving me with anything. Connecting with another player at one point was a nice touch. But I just don't vibe with these arty games at all."
      ],
      "image": "journey.png",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2012",
      "story": true
    },
    {
      "name": "to The Moon",
      "vibes": "2",
      "gameplay": "2",
      "review": [
        "This is a visual novel from 2011 that I tried out on a whim because it allegedly had a story that will make you cry. I love games like that but this one is a technical mess which stopped me from taking it seriously. I made it to the end but felt nothing."
      ],
      "image": "tothemoon.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2011",
      "story": true
    },

    {
      "name": "God of War (PS4 Reboot)",
      "vibes": "5",
      "gameplay": "2",
      "review": [
        "2020 is the year that I learned that I don't like hack and slash games. I wanted to see Kratos's character development, but the game was too boring to get far enough. Also he's a ridiculous character. I was told I should at least up until a strong female character shows up. She did and I was like, finally I can stop."
      ],
      "image": "godofwar.jpg",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2018"
    },
    {
      "name": "Dark Souls",
      "vibes": "3",
      "gameplay": "2",
      "review": [
        "For my own education I gave the original game a try but man this game is not for me. I need some colours and some recognisable characters. I didn't want to walk all the way back to the boss room each time I died. I didn't make it past this monster on the bridge."
      ],
      "image": "darksouls.jpg",
      "platform": "PlayStation 4",
      "year": "2020",
      "release": "2011"
    },
    {
      "name": "Unravel 2",
      "vibes": "2",
      "gameplay": "1",
      "review": [
        "Man this game is utter trash... combines the “beautiful for the sake of being beautiful” trope with bad gameplay. We couldn't stop ridiculing the game as we played it. There are better co-op games out there but this got me even thinking if co-op games are even worth it man."
      ],
      "image": "unravel.jpg",
      "platform": "Switch",
      "year": "2020",
      "release": "2018"
    },
    {
      "name": "Antichamber",
      "vibes": "4",
      "gameplay": "3",
      "review": [
        "A bizarre puzzle game with very conceptual and abstract puzzles. The vibe is harsh colours or lack thereof, like exploring the mind of the spirit of a colour printer. I wasn't smart enough to complete the game but I enjoyed making slow progress on it"
      ],
      "image": "antichamber.jpg",
      "platform": "PC",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Asteroids",
      "vibes": "1",
      "gameplay": "2",
      "review": [
        "A classic that I played with Dad when I was a child. A classic, but it's not like I would recommend it or anything"
      ],
      "image": "asteroids.png",
      "platform": "Arcade",
      "year": "older",
      "release": "1979"
    },
    {
      "name": "Sonic 2",
      "vibes": "10",
      "gameplay": "7",
      "review": [
        "What a banger. Huge game. A classic, and I associate it with so many good memories as a child. I remember playing this with school friends from primary school because one of them had a Sega Mega Drive. The music? Hello. Banger after banger. Check out fucking <a href=\"https://www.youtube.com/watch?v=_Eg7ZWnYKHE&list=PLvNp0Boas721Im_ZBhvDEuCqzLsRvlKb3&index=6&ab_channel=DeoxysPrime\">Hill Top Zone</a>! I love the various environments like Oil Ocean or Aquatic Ruin and their bright colours and strong vibes. It sucked that there wasn't save files though, it meant that I very rarely made it past Metropolis and only when I was older was I able to beat the final boss."
      ],
      "image": "sonic-2.webp",
      "platform": "Sega Mega Drive",
      "year": "older",
      "release": "1992"
    },
    {
      "name": "Infamous",
      "vibes": "1",
      "gameplay": "2",
      "review": [
        "Not a great game. I remember playing it for a bit at some point. The main character is a classic \"what people thought gamers wanted\" type character: 30-year old shaven head white guy. This game is a like a power fantasy, with lots of murdering people using electrical superpowers. Wild that it exists to be honest."
      ],
      "image": "infamous.webp",
      "platform": "PlayStation 3",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Tony Hawk's Pro Skater 3",
      "vibes": "",
      "gameplay": "",
      "review": [
        "My true love was Pro Skater 4, but this one I distinctly remember playing at a family friend's place when I was a child. I strongly remember the Foundry, Canada, Suburbia and Toyko, although the memories are more like core memories than specific things."
      ],
      "image": "tony-3.webp",
      "platform": "PlayStation 2",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Croc: Legend of the Gobbos",
      "vibes": "3",
      "gameplay": "1",
      "review": [
        "I borrowed this from my friend Oscar when I was a child because I loved Croc 2 so much, but was pretty disappointed by how the gobbos just look like fuzzballs, and the bosses were total bullshit. I never beat it but it's definitely not a good game so that's fine."
      ],
      "image": "croc.webp",
      "platform": "PlayStation",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "Quantum Redshift",
      "vibes": "2",
      "gameplay": "4",
      "review": [
        "Sometimes when we hung out with our friend Amy back then as teenagers, we used to play this racing game on her Xbox. It was alright. I watched a video of it again and it looks kinda shit."
      ],
      "image": "quantum-redshift.webp",
      "platform": "Xbox 360",
      "year": "older",
      "release": "2002"
    },
    {
      "name": "Fable",
      "vibes": "4",
      "gameplay": "4",
      "review": [
        "Loved this classic game. My brother got it and at first I just played the good route and couldn't really understand why anyone would take the evil route. But then I grew up and played the evil part and it felt so fun, like breaking the rules. It was also the first game to have some kind of morality system, so this was all very exciting at the time. Looking back, it's kinda wild that games now just let you go around murdering people and living out evil fantasies. Anyway, the game is hilarious. It's old and probably aged very badly but I can imagine it would be a right laugh to play it again.",
        "Funny story in year 10 we had to do a week's work experience somewhere, and the school gave out jobs like shelf stacking and stuff, but I wanted to be extra so I contacted a family friend who let me work at his game studio where he worked as an animator. It was sick! I didn't do any actual work I just hung out in their office. He was an animator and they were working on an Xbox game called 'Pure' so I got to see all the game dev for that. And this game studio before that made Fable! And said family friend had tons of old models and animations from all the characters and environments in Fable on his computer. It was so cool."
      ],
      "image": "fable.jpg",
      "platform": "Xbox",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Super Smash Bros. Ultimate",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "I mean where do I even begin. Anyone who knows me knows I love this game and it probably is my favourite game ever. I mean, come on. Imagine you're a nintendo fanboy and then they release a game with all your favourite nintendo characters in it, all your favourite nintendo music and in general all the fan service you could ever want. And the game is actually good. It's so good that I organise all the motherfucking tournaments for it in Berlin and compete in it myself even. This game is just the bees knees, it has everything. There are so many characters, and so of course I naturally gravitate towards my favourites. There's something for everyone here.",
        "And the game is actually so good. There are so many layers of depth! As a child I remember early smash games the difference between learning how to Up-B back to stage, or how to use roll and spotdodge, and not knowing that stuff. That was like level 1 smash. Fastforward to today and I'm on like level 10 smash, playing in competitive tournaments. Now it's all about specific match up knowledge, having a gameplan and changing your gameplan mid-game. It's about mind games and understanding what your opponent will do. It's an actual fighting game and it turns out I'm super into that. Playing in tournament has been so satisfying, and I have loved slowly getting better over the years.",
        "In fact I can only recommend to anyone to join the smash community. Going to tournaments is just so fun, and sure the community itself is full of nerds, and mostly they are boys, there are also a bunch of cool people, and there's no money involved. So it's an actual grassroots community, all just getting together for the love the game, and that is so cool. Now I'm a community leader and I do a lot of very fulfilling work for the community. It's nice and has inspired me to look for more community in my life.",
        "I personally main Peach because she is just stunning. Her vibes are great and her victory screens are hilarious. I love that she has the float mechanic, which makes her able to move unlike any other character. It also means she has a very good disadvantage, so I don't have to be frustrated about not being able to get back to stage. Early smash ultimate days I even got some great results with her, but that's because she was a monster in the early meta. These days, the meta has been overcrowded with bullshit characters and camping, but luckily it doesn't hinder too much my enjoyment of the local tournaments that I put on. That being said, he's hoping for a switch 2 edition which nerfs Steve!",
        "I'm not done talking about this game. Have you seen the soundtrack? There are over a thousand tracks. Each stage from each game franchise has a whole bunch of music from their respective games, and crucially, there are banger remixes of hundreds of these tracks. All my favourite nintendo games are represented here with some of the best remixes ever. What more could you possibly want?! Well, I guess a good online, but that's fine. Having a bad online just means that people are forced to come to my offline smash tournaments hehe"
      ],
      "image": "smash-ultimate.jpg",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Shantae and the Pirate's Curse",
      "vibes": "9",
      "gameplay": "8",
      "review": [
        "I loved this game! I think I played it during this empty Nintendo Wii U period desperately looking for something good. I was floored by the absolute bangers in the soundtrack and got hooked. I immediately made a mix of all the tracks (available on the music section of this website!) because they are so fucking good. The game itself is also great, although what is going on with the boobs? All the girls have insane boobs, and I played this on the 3DS, where the boobs literally pop out of the screen. Representation of women in video games, am I right"
      ],
      "image": "shantae-pirate.jpg",
      "platform": "3DS",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "Pokemon Y",
      "vibes": "4",
      "gameplay": "4",
      "review": [
        "For me this game was the beginning of the end. Pokemon never really recovered from this game. This was when we all realised that they are more interested in making money than making good games.",
        "It did have some great new pokemon in the new generation, so I'll give it that. And it had some hilarious moments, and the Team Flare music is great. But overall this game is just ridiculous, and the magic isn't really there."
      ],
      "image": "pokemon-y.jpg",
      "platform": "3DS",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "World of Goo",
      "vibes": "4",
      "gameplay": "7",
      "review": [
        "A cute and fun puzzle game! These physics kind of puzzles are also great. It might be the only WiiWare game I played."
      ],
      "image": "world-of-goo.jpg",
      "platform": "Wii",
      "year": "older",
      "release": "2008"
    },
    {
      "name": "Scribblenauts",
      "vibes": "",
      "gameplay": "",
      "review": [
        "In this game you could type in anything, and it would make an object of it in the game. It really attempts to go for the free user input approach to make a video game, which is brave. There are many words in the world! I started small but ended up testing the limits of the system pretty quickly. It's very easy to cheese all the levels after a bit of experimenting. Kudos to the devs for trying though."
      ],
      "image": "scribblenauts.webp",
      "platform": "DS",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "The Legend of Zelda: The Wind Waker",
      "vibes": "10",
      "gameplay": "9",
      "review": [
        "Is it my favourite Zelda? It might just be. I remember being so insanely excited for this game as a child, and when I finally started playing, exploring Outset Island, I thought it was like paradise. It was everything I could ever want from a zelda game and more! And it had this beautiful artstyle which totally captured my imagination.",
        "There are so many moments that I love, everything about Windfall Island, setting sail for the first time, the stealth bits in Forsaken Fortress, the cool Rito characters, the dragon on the mountain, the silly music in the forest, the sad music of the deku tree, Makar, the vibe switch when you get to the tower of the gods, when Tetra winks at you, being terrified of the zombies in the earth temple, the general vibe of the wind temple, Molgera's boss theme, that one ice island when link always falls on his face, the look on Link's face when he sidles along a ridge, the feeling you get when you unfreeze time in Hyrule castle, the part with puppet ganon. The game just has so many good moments and such good music to go with it. Is it flawless? No. But the HD remake is!"
      ],
      "image": "wind-waker.png",
      "platform": "Gamecube",
      "year": "older",
      "release": "2002"
    },
    {
      "name": "The Legend of Zelda: The Wind Waker HD",
      "vibes": "10",
      "gameplay": "10",
      "review": [
        "Is it my favourite Zelda? It might just be. During the Nintendo drought of like 2013/2014, this was such a blessing. Absolute banger getting redone with a nice filter and some gameplay improvements. Perfect, stunning, and the best way to play the game. Absolutely wild that as of writing this (2025), it's still only available on Wii U."
      ],
      "image": "wind-waker-hd.jpg",
      "platform": "Wii U",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Pokemon FireRed",
      "vibes": "8",
      "gameplay": "7",
      "review": [
        "This game is actually class. The originals are kinda unplayable so having this somewhat sensible version of Kanto was totally amazing. This also opened my eyes to the idea of a 'remake' when I was a child. It's weird because this came out when I was 11, and back then I remember being nostalgic for the original which I must have played when I was like 6.",
        "The Sevii islands were so cool, and Jessie and James were in it. Lots of love."
      ],
      "image": "pokemon-firered.jpg",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "GoldenEye 007",
      "vibes": "5",
      "gameplay": "5",
      "review": [
        "My brother Cam played this game more than me, but I definitely also tried it. I have some core memories associated with the first few levels, and from being forced to play the multiplayer with my brothers. Back then I didn't really like violence in games at all so was much busier playing Donkey Kong 64 instead of this. But I enjoyed using the motion sensor mines. Also I used to think that the gun pictures in the image looked like a big fancy pen."
      ],
      "image": "goldeneye.webp",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "Super Mario Land",
      "vibes": "7",
      "gameplay": "5",
      "review": [
        "I loved this game so much. It was my first mario game! Only later did I play super mario world so this was the benchmark for platformers for me. Definitely one of the very first games I ever played. Most notable is the classic music. Huge. Looking back, I appreciate that it's not in the mushroom kingdom and that there are worlds based on countries in real life. And also Daisy is the princess here, not Peach!"
      ],
      "image": "super-mario-land.jpg",
      "platform": "Gameboy",
      "year": "older",
      "release": "1989"
    },
    {
      "name": "Super Mario Kart",
      "vibes": "9",
      "gameplay": "4",
      "review": [
        "I can't believe the first mario kart looked like this! They split the screen like this on the fucking super nintendo and straight up made a 3d game. Insane! The game itself is hard as balls but you can kinda get good at it if you keep at it. Some of these tracks are legendary, and I love it when they get remade in the newer mario kart games, it's just deeply satisfying.",
        "I also have to shout out the soundtrack. Like 6 of the tracks is latin-inspired music! Salsa in things like Choco Island and Samba in Donut Plains, it's everywhere you listen. I love it! And of course this is where a brand new genre of music was invented: Rainbow Road music. Is there anything like it?"
      ],
      "image": "super-mario-kart.avif",
      "platform": "SNES",
      "year": "older",
      "release": "1992"
    },
    {
      "name": "Super Mario Bros.",
      "vibes": "4",
      "gameplay": "5",
      "review": [
        "I mean yeah it's a classic but it's not like it's good. Still, I'm happy it exists."
      ],
      "image": "super-mario-bros.bmp",
      "platform": "NES",
      "year": "older",
      "release": "1985"
    },
    {
      "name": "Ball",
      "vibes": "1",
      "gameplay": "0",
      "review": [
        "My friend Fab had a special Super Mario Game and Watch thing and I killed some time by playing the 'Ball' game on it, which is exactly how it used to be on the original Game and Watch. This game is boring as fuck, and there's no end. At some point I gave up and let myself die because it didn't become any more difficult. Would not recommend to a friend. But I'm satisfied to have played a game featuring the character from smash Mr Game and Watch."
      ],
      "image": "ball.webp",
      "platform": "Game and Watch",
      "year": "older",
      "release": "1980"
    },
    {
      "name": "Jet Pack Joyride",
      "vibes": "1",
      "gameplay": "1",
      "review": [
        "God, I got so hopelessly addicted to this. I remember thinking, I just need to do a few more runs, then I can finally unlock all the stuff, but they kept releasing new stuff so quickly that I couldn't keep up. I became obsessed with just getting all the unlockables long after I stopped having fun with the game. In the end, this game taught me to never play mobile games again. Fuck games like this with predatory pricing systems and addictive gameplay loops. They're not even good."
      ],
      "image": "jetpack.webp",
      "platform": "Mobile",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Audiosurf",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2008"
    },
    {
      "name": "Pac-man",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Arcade",
      "year": "older",
      "release": "1980"
    },
    {
      "name": "Sonic 3 & Knuckles",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Sega Mega Drive",
      "year": "older",
      "release": "1994"
    },
    {
      "name": "Infamous 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation 3",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Tony Hawk's Pro Skater 4",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation 2",
      "year": "older",
      "release": "2002"
    },
    {
      "name": "Bust-a-move",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "1994"
    },
    {
      "name": "Halo 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Xbox",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "The Legend of Zelda: Breath of the Wild",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Bayonetta 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "The Legend of Zelda: A Link Between Worlds",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Super Mario Galaxy",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Pokemon Soul Silver",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Fire Emblem: Path of Radiance",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "The Legend of Zelda: The Minish Cap",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "The Legend of Zelda: Ocarina of Time",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1998"
    },
    {
      "name": "Pokemon Yellow",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Super Mario World",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1990"
    },
    {
      "name": "Earthbound Beginnings (Mother 1)",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "NES",
      "year": "older",
      "release": "1989"
    },
    {
      "name": "Temple Run",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Mobile",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Barotrauma",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2023"
    },
    {
      "name": "Mega Bomberman",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Sega Mega Drive",
      "year": "older",
      "release": "1994"
    },
    {
      "name": "Grand Theft Auto: San Andreas",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation 2",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Tomb Raider",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "1996"
    },
    {
      "name": "Octopath Traveler",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "New Super Mario Bros. U",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2012"
    },
    {
      "name": "Pokemon Sun",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "New Super Mario Bros. Wii",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "New Super Mario Bros.",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Super Mario Sunshine",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2002"
    },
    {
      "name": "Pokemon Emerald",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Super Mario 64",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1996"
    },
    {
      "name": "Pokemon Silver",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Super Mario World 2: Yoshi's Island",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1995"
    },
    {
      "name": "Ice Climber",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "NES",
      "year": "older",
      "release": "1984"
    },
    {
      "name": "Cut the Rope",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Mobile",
      "year": "older",
      "release": "2010"
    },
    {
      "name": "Command & Conquer 3: Tiberium Wars",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Micro Machines V2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Sega Mega Drive",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "Tekken Tag Tournament",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation 2",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Tekken 3",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "Xenoblade Chronicles 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Donkey Kong Country: Tropical Freeze",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "Pokemon Alpha Sapphire",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "Wii Sports Resort",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Pokemon White",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2010"
    },
    {
      "name": "Soul Calibur II",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Kirby: Nightmare in Dream Land",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2002"
    },
    {
      "name": "The Legend of Zelda: Majora's Mask",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "2000"
    },
    {
      "name": "Tetris",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy",
      "year": "older",
      "release": "1984"
    },
    {
      "name": "F-Zero",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1990"
    },
    {
      "name": "Duck Hunt",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "NES",
      "year": "older",
      "release": "1984"
    },
    {
      "name": "Angry Birds",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Mobile",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Downfall: A Slay the Spire Fan Expansion",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2022"
    },
    {
      "name": "Mickey Mouse: Castle of Illusion",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Sega Mega Drive",
      "year": "older",
      "release": "1990"
    },
    {
      "name": "super fun racing game with micro machines vibes",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation 2",
      "year": "older",
      "release": ""
    },
    {
      "name": "Crash Bandicoot",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "1996"
    },
    {
      "name": "Fire Emblem: Three Houses",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Nintendo Land",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2012"
    },
    {
      "name": "The Legend of Zelda: Majora's Mask 3D",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Wii Sports",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Animal Crossing: Wild World",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "The Legend of Zelda: Twilight Princess",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Fire Emblem: The Blazing Blade",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Paper Mario",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "2000"
    },
    {
      "name": "The Legend of Zelda: Link's Awakening",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy",
      "year": "older",
      "release": "1993"
    },
    {
      "name": "Panel de Pon (Tetris Attack)",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1995"
    },
    {
      "name": "Balloon Fight",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "NES",
      "year": "older",
      "release": "1984"
    },
    {
      "name": "Final Fantasy VIII",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Guitar Hero III: Legends of Rock",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Stardew Valley",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Splatoon",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Pokemon Super Mystery Dungeon",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Super Smash Bros. Brawl",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2008"
    },
    {
      "name": "Fire Emblem: Shadow Dragon",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2008"
    },
    {
      "name": "Mario Kart: Double Dash!!",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Fire Emblem: The Sacred Stones",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Star Fox 64",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "The Grinch",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy",
      "year": "older",
      "release": "2000"
    },
    {
      "name": "Kirby Super Star",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1996"
    },
    {
      "name": "A Hat in Time",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Tony Hawk's Pro Skater 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "2000"
    },
    {
      "name": "Mario + Rabbids Kingdom Battle",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Super Mario Maker",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Fire Emblem: Awakening",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2012"
    },
    {
      "name": "Pokemon Battle Revolution",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "The Legend of Zelda: Phantom Hourglass",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Super Smash Bros. Melee",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Metroid: Zero Mission",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "F-Zero X",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1998"
    },
    {
      "name": "Donkey Kong Country",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1994"
    },
    {
      "name": "Into the Breach",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Croc 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Celeste",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Super Smash Bros. for Wii U",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "Animal Crossing: New Leaf",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2012"
    },
    {
      "name": "Mario Kart Wii",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2008"
    },
    {
      "name": "Pokemon Diamond",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Paper Mario: The Thousand Year Door",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Mother 3",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Donkey Kong 64",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Donkey Kong Country 2: Diddy's Kong Quest",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1995"
    },
    {
      "name": "Portal",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Gex 3: Deep Cover Gecko",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Super Mario Odyssey",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Paper Mario: Color Splash",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Kirby: Planet Robobot",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Kirby's Epic Yarn",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2010"
    },
    {
      "name": "Chrono Trigger",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "1995"
    },
    {
      "name": "Pikmin",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Wario Land 4",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Conker's Bad Fur Day",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Earthbound",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1994"
    },
    {
      "name": "Portal 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "this adventure game with the aztecs",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": ""
    },
    {
      "name": "ARMS",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Pokken Tournament",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Tomodachi Life",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Donkey Kong Country Returns",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2010"
    },
    {
      "name": "Pokemon White 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2012"
    },
    {
      "name": "The Simpsons Hit & Run",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Pokemon Mystery Dungeon: Red Rescue Team",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "Mario Kart 64",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1996"
    },
    {
      "name": "Super Metroid",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1994"
    },
    {
      "name": "Psychonauts",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "Rayman",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation",
      "year": "older",
      "release": "1995"
    },
    {
      "name": "Sonic Mania",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "The Legend of Zelda: Wind Waker HD",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Fire Emblem Echoes: Shadows of Valentia",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Metroid Prime Trilogy",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "The Legend of Zelda: Spirit Tracks",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "SSX 3",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "WarioWare, Inc.: Mega Microgame$!",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Pokemon Stadium",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "2000"
    },
    {
      "name": "The Legend of Zelda: A Link to the Past",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1991"
    },
    {
      "name": "Sid Meier's Civilization IV",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "Tetris 99",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Yoshi's Woolly World",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Metroid: Samus Returns",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "The Legend of Zelda: Skyward Sword",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Rhythm Heaven",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "SSX Tricky",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Golden Sun: The Lost Age",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2002"
    },
    {
      "name": "Pokemon Stadium 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "2000"
    },
    {
      "name": "Kirby's Dream Land 3",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "Skullgirls",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2012"
    },
    {
      "name": "Wargroove",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Hyrule Warriors",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "Mario & Luigi: Superstar Saga + Bowser's Minions",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Super Paper Mario",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Super Mario 64 DS",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Star Wars: Jedi Knight II: Jedi Outcast",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2002"
    },
    {
      "name": "Mario Kart Super Circuit",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Kirby 64: The Crystal Shards",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "2000"
    },
    {
      "name": "Super Bomberman",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "SNES",
      "year": "older",
      "release": "1993"
    },
    {
      "name": "The Stanley Parable",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Puyo Puyo Tetris",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "Kirby and the Rainbow Curse",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Mario Kart 7",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Mario Strikers Charged",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Professor Layton and the Curious Village",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Cel Damage",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gamecube",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Advance Wars: Black Hole Rising",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Yoshi's Story",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "SUPERHOT",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Hollow Knight",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "NES Remix Pack",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "Kid Icarus: Uprising",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2012"
    },
    {
      "name": "Super Mario Galaxy 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2010"
    },
    {
      "name": "Mario Kart DS",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "Kirby & The Amazing Mirror",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Diddy Kong Racing",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "Terraria",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Pokemon Shield",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Pikmin 3",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii U",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Hey! Pikmin",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Animal Crossing: Let's Go to the City",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2008"
    },
    {
      "name": "Super Princess Peach",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "Yu-Gi-Oh! Ultimate Masters: World Championship Tournament 2006",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Super Smash Bros.",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Tilt Brush",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Mario Kart 8 Deluxe",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Fire Emblem Fates",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Okami",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Sonic Rush",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "Turbo Turtle Adventure",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Gameboy Advance",
      "year": "older",
      "release": "2002"
    },
    {
      "name": "1080° Snowboarding",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1998"
    },
    {
      "name": "Undertale",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "The Legend of Zelda: Link's Awakening",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "1993"
    },
    {
      "name": "Super Smash Bros. for 3DS",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2014"
    },
    {
      "name": "Fire Emblem: Radiant Dawn",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Pokemon Mystery Dungeon: Explorers of Sky",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Pokemon Snap",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Deltarune: Chapter 1",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Cadence of Hyrule: Crypt of the NecroDancer featuring The Legend of Zelda",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Yoshi's New Island",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "De Blob",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2008"
    },
    {
      "name": "Mario Party DS",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Snowboard Kids",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "Worms 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1997"
    },
    {
      "name": "Baba is You",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Star Fox 64 3D",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "WarioWare: Smooth Moves",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Advance Wars: Days of Ruin",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Iggy's Reckin' Balls",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Nintendo 64",
      "year": "older",
      "release": "1998"
    },
    {
      "name": "Command & Conquer: Red Alert",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1996"
    },
    {
      "name": "Super Mario Maker 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Pilotwings Resort",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "3DS",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Pikmin 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Yoshi's Island DS",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "RollerCoaster Tycoon",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Crypt of the NecroDancer",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "Wii Fit",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2008"
    },
    {
      "name": "Phoenix Wright: Ace Attorney",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "The Sims",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2000"
    },
    {
      "name": "Shovel Knight: Treasure Trove",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Donkey Kong: Barrel Blast",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Custom Robo Arena",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "Runescape",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Pokemon Mystery Dungeon Red Rescue Team DX",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2020"
    },
    {
      "name": "Bit.Trip Runner",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Wii",
      "year": "older",
      "release": "2010"
    },
    {
      "name": "Professor Layton and Pandora's Box",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Minecraft",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Overcooked",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "42 All-Time Classics",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "AM2R: Another Metroid 2 Remake",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Golf Story",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Diddy Kong Racing DS",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Chasm",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "The Messenger",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Worms: Open Warfare",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "DS",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Zoombinis",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1996"
    },
    {
      "name": "Yooka-Laylee and the Impossible Lair",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Zool 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1993"
    },
    {
      "name": "Prison Architect",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2015"
    },
    {
      "name": "World of Warcraft",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Return of the Obra Dinn",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Lemmings",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1991"
    },
    {
      "name": "Mega Man 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "1989"
    },
    {
      "name": "Frogger",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1981"
    },
    {
      "name": "Mega Man 3",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "1990"
    },
    {
      "name": "Neopets",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Mega Man 4",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "1991"
    },
    {
      "name": "Lemmings 3D",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "1995"
    },
    {
      "name": "VA-11 HALL-A",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Worms 3D",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Yooka Laylee",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Snake Pass",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Shantae: Half-Genie Hero",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Dandara",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Hyper Light Drifter",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Owlboy",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Just Shapes and Beats",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Guacamelee!",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Enter the Gungeon",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Katana Zero",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Mega Man 11",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Rivals of Aether",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Untitled Goose Game",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Kirby Star Allies",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Snipperclips",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "SteamWorld Dig 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Dragon Quest XI S: Echoes of an Elusive Age",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Overcooked 2",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Cuphead",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Worms W.M.D",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Oxenfree",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Firewatch",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2016"
    },
    {
      "name": "Valkyria Chronicles 4",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Teenage Mutant Ninja Turtles: Shredder's Revenge",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2022"
    },
    {
      "name": "Minit",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Fortnite",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Bioshock",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Nickelodeon All Star Brawl",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2021"
    },
    {
      "name": "Don't Starve",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Rayman Legends",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Crash Bandicoot N-Sane Trilogy",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Reigns: Kings & Queens",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Bastion",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2011"
    },
    {
      "name": "Desert Child",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Heave Ho",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2019"
    },
    {
      "name": "Superliminal",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2020"
    },
    {
      "name": "Scott Pilgrim vs The World: The Game",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "Switch",
      "year": "older",
      "release": "2010"
    },
    {
      "name": "Marvel's Spider-Man",
      "vibes": "",
      "gameplay": "",
      "review": [],
      "image": "",
      "platform": "PlayStation 4",
      "year": "older",
      "release": "2018"
    },
    {
      "name": "Farmville",
      "vibes": "1",
      "gameplay": "2",
      "review": [
        "This was the first major game to exist with microtransactions. At first, I was excited. It's a facebook game that EVERYONE was playing. It was so cool growing my plants and visiting all my facebook friends' farms to get rewards. I got hooked. Eventually though, more and more people at school quit it because they saw it for what it really was: a soulless money making scheme. I eventually got the memo and deleted it, but not before I spend 5 pounds on a decorative tea house for my farm. Why the fuck did I do that? It was an eye opening moment that really turned me off of games with microtransactions forever after."
      ],
      "image": "farmville.webp",
      "platform": "PC",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Fishville",
      "vibes": "0",
      "gameplay": "1",
      "review": [
        "Another horrible facebook game that I played parallel to Farmville. No soul, no life, just a young me not yet understanding the power of microtransactions."
      ],
      "image": "fishville.jpg",
      "platform": "PC",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Insaniquarium",
      "vibes": "3",
      "gameplay": "1",
      "review": [
        "It's a browser game from Addicting Games dot com or something. It was great. A special time when there was just these flash or java games on the computer. This was the first time I ever played a browser game and I remember being blown away that it could remember how my aquarium looked without saving anything. That's the day I learned what cookies were."
      ],
      "image": "insaniquarium.webp",
      "platform": "PC",
      "year": "older",
      "release": "2001"
    },
    {
      "name": "Cookie Clicker",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2013"
    },
    {
      "name": "Universal Paperclips",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "",
      "platform": "PC",
      "year": "older",
      "release": "2017"
    },
    {
      "name": "Plague Inc",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "plague.jpg",
      "platform": "Mobile",
      "year": "older",
      "release": "2012"
    },
    {
      "name": "Yeti Sports",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "yeti-sports.webp",
      "platform": "PC",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Falling Sand",
      "vibes": "",
      "gameplay": "",
      "review": [
        "This is a sick browser game which I had a lot of fun fucking around with. Physics! I feel like this little game is timeless. You can still play it <a href=\"https://boredhumans.com/falling_sand.php\">here</a>."
      ],
      "image": "falling-sand.webp",
      "platform": "PC",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Flea Circus",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "flea-circus.webp",
      "platform": "PC",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Microsoft Pinball Arcade",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "pinball.webp",
      "platform": "PC",
      "year": "older",
      "release": "1998"
    },
    {
      "name": "Microsoft Hearts",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "hearts.png",
      "platform": "PC",
      "year": "older",
      "release": "1992"
    },
    {
      "name": "Microsoft Hearts",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "hearts.png",
      "platform": "PC",
      "year": "older",
      "release": "1992"
    },
    {
      "name": "Microsoft Solitaire",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "solitaire.webp",
      "platform": "PC",
      "year": "older",
      "release": "1990"
    },
    {
      "name": "Words with Friends",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "words.webp",
      "platform": "PC",
      "year": "older",
      "release": "2009"
    },
    {
      "name": "Bubble Trouble",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "bubble-trouble.jpg",
      "platform": "PC",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Club Penguin",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "club-penguin.webp",
      "platform": "PC",
      "year": "older",
      "release": "2005"
    },
    {
      "name": "The Impossible Quiz",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "impossible-quiz.jpg",
      "platform": "PC",
      "year": "older",
      "release": "2007"
    },
    {
      "name": "Cyber Mice Party 2003",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "cyber-mice.jpg",
      "platform": "PC",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Minesweeper",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "minesweeper.jpg",
      "platform": "PC",
      "year": "older",
      "release": "1990"
    },
    {
      "name": "Bug on a Wire",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "bug-wire.webp",
      "platform": "PC",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Red Beard",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "red-beard.png",
      "platform": "PC",
      "year": "older",
      "release": "2004"
    },
    {
      "name": "Twiddlestix",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "twiddlestix.jpg",
      "platform": "PC",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Line Rider",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "linerider.webp",
      "platform": "PC",
      "year": "older",
      "release": "2006"
    },
    {
      "name": "The Classroom",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "classroom.webp",
      "platform": "PC",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Kellogg's Frosties Gr-r-rand Prix",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "frosties.webp",
      "platform": "PC",
      "year": "older",
      "release": "2003"
    },
    {
      "name": "Lego Racers",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "lego-racers.png",
      "platform": "PC",
      "year": "older",
      "release": "1999"
    },
    {
      "name": "Snake",
      "vibes": "",
      "gameplay": "",
      "review": [
      ],
      "image": "snake.png",
      "platform": "Mobile",
      "year": "older",
      "release": "1998"
    }
  ]
}
