{
  "tracks": [
    {
      "id": 1,
      "name": "Mario Circuit 1",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "4",
      "vibes": "1",
      "track": "0",
      "ranking": "13",
      "description": "The music is great, iconic even, but I don't like the colours, and this one is very plain indeed. It's the tutorial level.",
      "image": "snes-mario-circuit-1.webp"
    },
    {
      "id": 1,
      "name": "Mario Circuit 1",
      "game": "Mario Kart DS",
      "original": "Super Mario Kart",
      "music": "4",
      "vibes": "1",
      "track": "0",
      "ranking": "31",
      "description": "Incredible that in a game which contains Figure-8 Circuit you could also put in the next most boring track too. There is nothing going on here. At least the classic music is great.",
      "image": "ds-mario-circuit-1.png"
    },
    {
      "id": 1,
      "name": "Mario Circuit",
      "game": "Mario Kart World",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "3",
      "track": "4",
      "ranking": "19",
      "description": "This is such a fun interpretation of this classic! They combined Mario Circuit 1, 2 and 3 (RIP Mario Circuit 4) into one, with each lap going around a different classic course. Unlike the rest of the game, they are all flat and don't lend themselves to fun shortcuts, but rather just good driving. I like it! And I love that they finally remixed this song!! And leaned into its latin flavour. Love the music that plays as you approach this stage. Great.",
      "image": "world-mario-circuit.jpg"
    },
    {
      "id": 2,
      "name": "Donut Plains 1",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "1",
      "track": "1",
      "ranking": "6",
      "description": "I love the samba inspired music of Donut Plains. Otherwise, the vibe is very plain. Donut Plains 1 has nothing special going for it, you can't even fall into the water.",
      "image": "snes-donut-plains-1.webp"
    },
    {
      "id": 2,
      "name": "Donut Plains 1",
      "game": "Mario Kart DS",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "1",
      "track": "1",
      "ranking": "28",
      "description": "This stage is really boring! It has some shortcuts with a mushroom but that is it. The original music is there and good, though.",
      "image": "ds-donut-plains-1.png"
    },
    {
      "id": 3,
      "name": "Ghost Valley 1",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "0",
      "vibes": "1",
      "track": "3",
      "ranking": "18",
      "description": "Fuck Ghost Valley, what a miserable vibe. Those ghosts look like shit and it's just copied music from Super Mario World. At least this version trained you up to be able to race on Rainbow Road and doesn't have too much bullshit.",
      "image": "snes-ghost-valley-1.webp"
    },
    {
      "id": 4,
      "name": "Bowser Castle 1",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "3",
      "vibes": "4",
      "track": "3",
      "ranking": "9",
      "description": "Bowser Castle's vibes are all sharp corners, thwomps and falling into lava. Luckily, this version is very forgiving, so you can enjoy the vibe without dying constantly. It's kinda cool that the music is the same as the final boss music from Super Mario World but maybe that's also kinda lame too.",
      "image": "snes-bowser-castle-1.webp"
    },
    {
      "id": 5,
      "name": "Mario Circuit 2",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "4",
      "vibes": "1",
      "track": "3",
      "ranking": "12",
      "description": "This one contains a jump! It jumps over a previous section of the course which for the time was very exciting.",
      "image": "snes-mario-circuit-2.webp"
    },
    {
      "id": 5,
      "name": "Mario Circuit 2",
      "game": "Mario Kart 7",
      "original": "Super Mario Kart",
      "music": "4",
      "vibes": "1",
      "track": "1",
      "ranking": "23",
      "description": "This is a boring level, having a jump means nothing at this point. But the music is classic. There's a really nice video of the TAS time trial for this track: https://www.youtube.com/watch?v=0498-yr5CLI&ab_channel=MKWilliam",
      "image": "3ds-mario-circuit-2.webp"
    },
    {
      "id": 6,
      "name": "Choco Island 1",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "1",
      "track": "1",
      "ranking": "8",
      "description": "Love the music of Choco Island. It's like salsa music! And it has a great drum break at the end of the loop. The level looks like shit though, literally. Is it chocolate, or is it poo? Choco Island 1 specifically has got nothing interesting going for it.",
      "image": "snes-choco-island-1.png"
    },
    {
      "id": 7,
      "name": "Ghost Valley 2",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "0",
      "vibes": "1",
      "track": "3",
      "ranking": "19",
      "description": "This level is harder than the first one but still has wide paths so it's doable. Hate the disappearing blocks mechanic and the vibe in general.",
      "image": "snes-ghost-valley-2.png"
    },
    {
      "id": 7,
      "name": "Ghost Valley 2",
      "game": "Mario Kart Wii",
      "original": "Super Mario Kart",
      "music": "0",
      "vibes": "3",
      "track": "3",
      "ranking": "25",
      "description": "I always disliked this track because when I was younger I felt like this was a try-hard stage for boring people who just want to go fast around boring flat tracks. I think it looks kinda special on the Wii though. But the music is so bad.",
      "image": "wii-ghost-valley-2.webp"
    },
    {
      "id": 8,
      "name": "Donut Plains 2",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "1",
      "track": "1",
      "ranking": "4",
      "description": "At least this one features a lake, but you probably won't fall into it. It's a long and boring track. Luckily you have the music to keep you going.",
      "image": "snes-donut-plains-2.webp"
    },
    {
      "id": 9,
      "name": "Bowser Castle 2",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "3",
      "vibes": "4",
      "track": "0",
      "ranking": "11",
      "description": "This stage literally features a dead end! What the actual fuck. You're just minding your own business playing Mario Kart and then bam, you have to REVERSE and go back to the track because there was a fake end. Fuck that terrible design. No. Oh my god.",
      "image": "snes-bowser-castle-2.png"
    },
    {
      "id": 10,
      "name": "Mario Circuit 3",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "4",
      "vibes": "1",
      "track": "1",
      "ranking": "14",
      "description": "It's quite long and has a sharp corner, otherwise it's unremarkable. The pipes just get in the way in an annoying way.",
      "image": "snes-mario-circuit-3.webp"
    },
    {
      "id": 10,
      "name": "Mario Circuit 3",
      "game": "Mario Kart Wii",
      "original": "Super Mario Kart",
      "music": "2",
      "vibes": "1",
      "track": "1",
      "ranking": "30",
      "description": "Always hated this level. It looks so bad and the music sounds really shit with the SNES instruments on the Wii. The stage is boring to drive on and I don't like the colours.",
      "image": "wii-mario-circuit-3.webp"
    },
    {
      "id": 10,
      "name": "Mario Circuit 3",
      "game": "Mario Kart 8 Deluxe",
      "original": "Super Mario Kart",
      "music": "2",
      "vibes": "1",
      "track": "1",
      "ranking": "85",
      "description": "They made such an effort with all the other snes retro tracks, and they left this one looking like all the snes Mario Circuits: shit. Even the music sounds bad and it's a classic banger. I kinda wish they remade Mario Circuit 4 instead then they've done them all. We had enough of this one on the Wii.",
      "image": "mk8-mario-circuit-3.webp"
    },
    {
      "id": 11,
      "name": "Koopa Beach 1",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "2",
      "description": "I love beach levels and this one does not disappoint! Beautiful bossa nova inspired music and a great all-round vibe. In this stage you have to drive through the water which slows you down, but you can be tactical about it and jump or use a mushroom at the right moments to keep your speed. It's a lot of fun. It's a classic.",
      "image": "snes-koopa-beach-1.png"
    },
    {
      "id": 12,
      "name": "Choco Island 2",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "1",
      "track": "3",
      "ranking": "7",
      "description": "This one actually has a big pile of poo that you have to drive through, it's a little more interesting and fun.",
      "image": "snes-choco-island-2.png"
    },
    {
      "id": 12,
      "name": "Choco Island 2",
      "game": "Mario Kart DS",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "1",
      "track": "3",
      "ranking": "22",
      "description": "What a garish yellow this stage is! It's not even poo-coloured, it's vomit-coloured. This stage features a bit pile of brown goop at the end. Something to enjoy the salsa music to.",
      "image": "ds-choco-island-2.webp"
    },
    {
      "id": 13,
      "name": "Vanilla Lake 1",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "2",
      "vibes": "4",
      "track": "0",
      "ranking": "16",
      "description": "It's exciting to get to this late-game stage with a complete vibe switch to all the other tracks, but don't let it fool you. This level is bullshit. It has these tiny ice cubes that block the road in these tight tunnels. Fuck that! Also, the beta music for this level is way better than the actual music.",
      "image": "snes-vanilla-lake-1.webp"
    },
    {
      "id": 14,
      "name": "Bowser Castle 3",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "3",
      "vibes": "4",
      "track": "1",
      "ranking": "10",
      "description": "This stage is super hard because of all the sharp turns and Thwomps. Nothing compared the horror that is Bowser Castle 2 but still.",
      "image": "snes-bowser-castle-3.png"
    },
    {
      "id": 14,
      "name": "Bowser Castle 3",
      "game": "Mario Kart 8 Deluxe",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "18",
      "description": "What a banger remake! This is what I'm talking about! They took the plain-ass snes track, and for the first time a Bowser Castle and completely transformed it into a super fun, super intense track. I love the music remix a lot - it's the rock remix that it deserved! I enjoy that there are these super thin platforms to get boosts on.",
      "image": "mk8-bowser-castle-3.webp"
    },
    {
      "id": 15,
      "name": "Mario Circuit 4",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "4",
      "vibes": "1",
      "track": "0",
      "ranking": "15",
      "description": "Disappointing, this is definitely just a Platzhalter. It's just the same as Mario Circuit 3 but mirrored and with more Monty Moles and pipes to annoy you. No wonder this stage was never brought back, it sucks.",
      "image": "snes-mario-circuit-4.webp"
    },
    {
      "id": 16,
      "name": "Donut Plains 3",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "1",
      "track": "0",
      "ranking": "6",
      "description": "Alright, this one finally has some special stuff going on, but it's all BULLSHIT! You have to actually jump over the hole in the second bridge, and the first bridge is super deceptive. This level is tough as nails and I hate it. Not even the music is enough to keep me going.",
      "image": "snes-donut-plains-3.webp"
    },
    {
      "id": 16,
      "name": "Donut Plains 3",
      "game": "Mario Kart 8 Deluxe",
      "original": "Super Mario Kart",
      "music": "4",
      "vibes": "4",
      "track": "5",
      "ranking": "21",
      "description": "I love Donut Plains 3. This was the first time they revealed the HD reimagination of snes tracks and I was so shook. It looks so good! With the nice water, the hills in the background, and the remix of the music. It was so exciting to see the glow up! And I love this track layout. I learned that you could drift through the water and skip a corner and I feel like it's my little secret shortcut that nobody knows about.",
      "image": "mk8-donut-plains-3.webp"
    },
    {
      "id": 17,
      "name": "Koopa Beach 2",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "5",
      "track": "3",
      "ranking": "3",
      "description": "This stage is all about finding that perfect line around the island between the grass and the water. There's the bit at the start where you have to go in the water and there's not much you can do about it. But it's still fun. I like that this is just one big island and not an archipelago like the other one.",
      "image": "snes-koopa-beach-2.png"
    },
    {
      "id": 17,
      "name": "Koopa Troopa Beach",
      "game": "Mario Kart World",
      "original": "Super Mario Kart",
      "music": "2",
      "vibes": "3",
      "track": "1",
      "ranking": "25",
      "description": "Man, they took one of my favourite tracks from the super nintendo and they kinda fumbled it. It's a tiny island that you go around 5 times. It's not as chaotic as Baby Park but equally as boring. For some reason, this level is insanely bright and you can barely see anything. The thing that made this level the most special was the music, and now it's just a generic sounding EDM track. The Koopa Troopa DJ is not enough to save this track.",
      "image": "world-koopa-beach.jpg"
    },
    {
      "id": 17,
      "name": "Koopa Beach 2",
      "game": "Mario Kart DS",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "7",
      "description": "They improved this stage by making it so that going in the water doesn't slow you down. It's a good change turning one of the best SNES tracks into an even better one! I love love love this music.",
      "image": "ds-koopa-beach-2.png"
    },
    {
      "id": 18,
      "name": "Ghost Valley 3",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "0",
      "vibes": "1",
      "track": "1",
      "ranking": "20",
      "description": "Hate that this has all the misery of the previous Ghost Valleys, except ALSO holes in the ground. I'm happy this was never recreated as a retro course because it's shit.",
      "image": "snes-ghost-valley-3.png"
    },
    {
      "id": 19,
      "name": "Vanilla Lake 2",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "2",
      "vibes": "4",
      "track": "0",
      "ranking": "17",
      "description": "I don't know how they did it but they made this stage even more bullshit than the first one. This time the ice cubes are EVERYWHERE and it is impossible to navigate the track. I enjoy that this stage features a big lake that you drive around but it has nothing else to offer. I think it deserves a remake but said remake would have to completely rework it.",
      "image": "snes-vanilla-lake-2.webp"
    },
    {
      "id": 20,
      "name": "Rainbow Road",
      "game": "Super Mario Kart",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "1",
      "description": "This stage is iconic. This is where the genre of 'fantasy space adventure rainbow music' was invented! The B section of this music introduces us to the classic Rainbow Road music that we know and love and I am just so thankful. I think the idea to make a rainbow racetrack in space was inspired. The track itself is plain, but has no walls! So you need to have learned how to use the drift button properly by this point.",
      "image": "snes-rainbow-road-snes.webp"
    },
    {
      "id": 20,
      "name": "Rainbow Road",
      "game": "Mario Kart 7",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "4",
      "description": "When I first learned about this, I was so shook. I didn't know they could not only bring back retro courses, but recreate them, shaping them into something new. It looks so silly having a Rainbow Road like this but it's also delightful and charming. I love it. And we have a great upgraded version of the classic music too!",
      "image": "3ds-rainbow-road-snes.webp"
    },
    {
      "id": 20,
      "name": "Rainbow Road",
      "game": "Mario Kart 8 Deluxe",
      "original": "Super Mario Kart",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "11",
      "description": "They remade it... again!! I can't believe it. This time it's floating above some land and comes with a brand new remix, which I love. It looks noticeably better than the 3DS version and is such a vibe. I love the concept of a flat Rainbow Road like this.",
      "image": "mk8-rainbow-road-snes.webp"
    },
    {
      "id": 21,
      "name": "Luigi Raceway",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "2",
      "track": "1",
      "ranking": "16",
      "description": "A very boring level. It's a tutorial level for the tutorials, absolutely no shenanigans at all. Only that absolutely banging music.",
      "image": "n64-luigi-raceway.webp"
    },
    {
      "id": 21,
      "name": "Luigi Raceway",
      "game": "Mario Kart 7",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "1",
      "track": "1",
      "ranking": "24",
      "description": "This is a boring track from the N64 and it's boring here too. Only its immense soundtrack keep this high up the rankings.",
      "image": "3ds-luigi-raceway.webp"
    },
    {
      "id": 22,
      "name": "Moo Moo Farm",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "1",
      "vibes": "2",
      "track": "2",
      "ranking": "11",
      "description": "I don't love the music in this. It's hard to love this track when Moo Moo Meadows exists. The racetrack itself is just a super wide dirt track in a big circle.",
      "image": "n64-moo-moo-farm.webp"
    },
    {
      "id": 22,
      "name": "Moo Moo Farm",
      "game": "Mario Kart DS",
      "original": "Mario Kart 64",
      "music": "1",
      "vibes": "2",
      "track": "2",
      "ranking": "26",
      "description": "This is just as lame as it was on Nintendo 64. I remember playing it a lot because of the download multiplayer.",
      "image": "ds-moo-moo-farm.webp"
    },
    {
      "id": 23,
      "name": "Koopa Troopa Beach",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "2",
      "track": "4",
      "ranking": "6",
      "description": "Looks-wise, this level looks so drab. These colours should not be used in a beach level. Luckily, the music is top notch. This level has this really difficult jump into a shortcut which is really cool.",
      "image": "n64-koopa-troopa-beach.webp"
    },
    {
      "id": 23,
      "name": "Koopa Troopa Beach",
      "game": "Mario Kart 7",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "2",
      "track": "5",
      "ranking": "13",
      "description": "I quite like this level, especially the music, and the shortcut is totally manageable in this game thanks to the gliding. The colours are a bit boring.",
      "image": "3ds-koopa-troopa-beach.webp"
    },
    {
      "id": 24,
      "name": "Kalimari Desert",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "3",
      "vibes": "4",
      "track": "2",
      "ranking": "8",
      "description": "They made the insane design choice to make the train come right in front of the track, meaning everyone has to wait for it to go past in the first lap. Nuts. Actually it's kinda funny. Kind of an iconic level.",
      "image": "n64-kalimari-desert.webp"
    },
    {
      "id": 24,
      "name": "Kalimari Desert",
      "game": "Mario Kart 7",
      "original": "Mario Kart 64",
      "music": "3",
      "vibes": "4",
      "track": "3",
      "ranking": "19",
      "description": "This is a classic from the N64 and they've changed a few things up. In the original, everyone had to wait for the first train, which is insane, so that's fixed. However originally you could choose to drive through the tunnel, but that's been removed here. All in all hard to say if it's a good track now. Music is alright.",
      "image": "3ds-kalimari-desert.webp"
    },
    {
      "id": 24,
      "name": "Kalimari Desert",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 64",
      "music": "3",
      "vibes": "4",
      "track": "5",
      "ranking": "47",
      "description": "They really did this one up! The original track, while cool because it has a train, was actually kinda of a boring course. Now they switched it up so you can go through the train tunnel, which is just so cool! Especially because you could actually drive through the tunnel in the original one. I'm also a sucker for a sunset level, and it does look quite good here. The remix is good but not outstanding.",
      "image": "mk8-kalimari-desert.webp"
    },
    {
      "id": 25,
      "name": "Toad's Turnpike",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "1",
      "description": "This stage is such a VIBE! That music, the beautiful sky, the driving at night-time feeling, so fucking good. I even enjoy drifting around all the cars. It's such a good racetrack. It makes you wonder where all these cars are actually going though!",
      "image": "n64-toads-turnpike.png"
    },
    {
      "id": 25,
      "name": "Toad's Turnpike",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "14",
      "description": "I love Toad's Turnpike so much! This music is such a vibe and they made it even better in this remix. I have to say though, this version of the stage doesn't quite capture the imagination of the nation like the original N64 version. Still love it though.",
      "image": "mk8-toads-turnpike.webp"
    },
    {
      "id": 26,
      "name": "Frappe Snowland",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "4",
      "vibes": "2",
      "track": "2",
      "ranking": "10",
      "description": "I love this classic winter music, that alone carries the track. Otherwise the scenery is very sparse and I'm not seeing much in the way of 'frappé'. There's an ominous ice statue of Mario which makes me uneasy.",
      "image": "n64-frappe-snowland.webp"
    },
    {
      "id": 26,
      "name": "Frappe Snowland",
      "game": "Mario Kart DS",
      "original": "Mario Kart 64",
      "music": "4",
      "vibes": "2",
      "track": "2",
      "ranking": "23",
      "description": "This classic winter music is so good. Otherwise this is just the same as the N64 version, not too much to enjoy here.",
      "image": "ds-frappe-snowland.webp"
    },
    {
      "id": 27,
      "name": "Choco Mountain",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "15",
      "description": "What's going on with Choco Mountain? It looks like it's made of shit, not chocolate. Why choose the colours grey and brown as the theme for the level? Also I don't like all the curvy valleys and bumps in the road.",
      "image": "n64-choco-mountain.webp"
    },
    {
      "id": 27,
      "name": "Choco Mountain",
      "game": "Mario Kart DS",
      "original": "Mario Kart 64",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "27",
      "description": "I hate that this brought this back and with the DS's draw distance it looks even worse. Is it meant to look foggy like this? Who concocted this vibe. It's horrible.",
      "image": "ds-choco-mountain.webp"
    },
    {
      "id": 27,
      "name": "Choco Mountain",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 64",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "91",
      "description": "Why do I keep having to look at this stage?! They're bringing it back to the new game too, what the fuck. Even in high definition here it looks like shit. Who decided to make a foggy brown mountain of shit level like this. Still don't love the music.",
      "image": "mk8-choco-mountain.webp"
    },
    {
      "id": 27,
      "name": "Choco Mountain",
      "game": "Mario Kart World",
      "original": "Mario Kart 64",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "30",
      "description": "Ugh I've never liked this track and they brought it back for a FOURTH TIME? And they STILL haven't themed it around chocolate at all. If it were me, I would literally make the mountain out of chocolate or something. Instead they changed the vibe to Monster Rally with a bunch of mud everywhere. I hate it. Also, it's so similar to Wario Stadium in terms of vibes, they should have done something else here.",
      "image": "world-choco-mountain.jpg"
    },
    {
      "id": 28,
      "name": "Mario Raceway",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "2",
      "track": "3",
      "ranking": "9",
      "description": "It's kinda iconic I guess because it appeared in Mario Kart Wii. I always enjoyed the big pipe but now as I type this I'm asking myself why. What even is this place and why does it looks like this?",
      "image": "n64-mario-raceway.webp"
    },
    {
      "id": 28,
      "name": "Mario Raceway",
      "game": "Mario Kart Wii",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "2",
      "track": "3",
      "ranking": "26",
      "description": "I think this track is one of the better Mario Circuit levels, and they made it look a lot nicer on the Wii. But I'm asking myself why does this stage have all these objects in it.",
      "image": "wii-mario-raceway.webp"
    },
    {
      "id": 29,
      "name": "Wario Stadium",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "1",
      "track": "0",
      "ranking": "14",
      "description": "I have to give it a 5 in music because it's that banger Mario Raceway music, but I do wish this track had its own Wario-style music. Otherwise, this track is to be avoided. It's insanely long, really boring, and has this jump near the end where if you get hit by a lightning, you fall to an earlier part of the track. Fuck that.",
      "image": "n64-wario-stadium-n64.png"
    },
    {
      "id": 29,
      "name": "Wario Stadium",
      "game": "Mario Kart World",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "3",
      "track": "4",
      "ranking": "22",
      "description": "I'm happy they brought it back, I never thought they would considering the original is so terrible, and they really successfully turned things around! Shout-outs to the Mario Kart team for saving this forgotten, terrible track! I love that they remixed the already banger music into a rockier version. I'm excited to learn how to do all the tricks on the rails that this stage has. There's a lot going on!",
      "image": "world-wario-stadium.jpg"
    },
    {
      "id": 30,
      "name": "Sherbet Land",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "4",
      "vibes": "4",
      "track": "4",
      "ranking": "4",
      "description": "That classic winter music just like Frappe Snowland, but this time used for a track that actually looks good. You're on an iceberg and you have navigate around these sharp breaks in the ice. There are penguins, and a reflective surface on the ground. It's super cool.",
      "image": "n64-sherbet-land-n64.webp"
    },
    {
      "id": 30,
      "name": "Sherbet Land",
      "game": "Mario Kart Wii",
      "original": "Mario Kart 64",
      "music": "4",
      "vibes": "4",
      "track": "4",
      "ranking": "12",
      "description": "Great track! One of my favourites from the Wii era. I actually almost got a world record on the online on this stage because I knew the secret of the Magikoopa going faster on this stage than other bikes. I even beat some of those crazy 9999 players online with that trick and I loved it. It looks great on the Wii and the music is a classic.",
      "image": "wii-sherbet-land-n64.webp"
    },
    {
      "id": 31,
      "name": "Royal Raceway",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "1",
      "track": "2",
      "ranking": "12",
      "description": "This track is super lame, it's very plain and even less interesting than the other two Raceways. This one does have a massive jump which at the time was everything. So it gets some points for that. Also the excellent music.",
      "image": "n64-royal-raceway.webp"
    },
    {
      "id": 31,
      "name": "Royal Raceway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "2",
      "track": "2",
      "ranking": "84",
      "description": "They remixed this absolute banger and it sounds great. But here we are, still looking at standard Mario Circuits. They made this one look kinda good with the hot air balloons, but underneath the surface it's just more of the same generic shit.",
      "image": "mk8-royal-raceway.webp"
    },
    {
      "id": 32,
      "name": "Bowser's Castle",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "3",
      "vibes": "5",
      "track": "5",
      "ranking": "3",
      "description": "Such a creepy and interesting direction for a Bowser's Castle! That ominous music, what feels like a vampire castle. It's one of the best Bowser's Castles if you ask me. There's a lot of fun shit in the level, those classic tight corners, lava, a cool corner for drifting.",
      "image": "n64-bowsers-castle-n64.webp"
    },
    {
      "id": 32,
      "name": "Bowser's Castle",
      "game": "Mario Kart Wii",
      "original": "Mario Kart 64",
      "music": "3",
      "vibes": "5",
      "track": "5",
      "ranking": "18",
      "description": "Great rendition of a great track. This is one of my favourite Bowser Castles and it was an absolute banger on the Wii. Landing on the side on the final jump to shortcut past the building? Pure drama.",
      "image": "wii-bowsers-castle-n64.webp"
    },
    {
      "id": 33,
      "name": "D.K.'s Jungle Parkway",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "0",
      "vibes": "2",
      "track": "2",
      "ranking": "13",
      "description": "DK got hard done by on this level. There is no music, it's just a 15 second drum loop. How disappointing is that? The level itself is just endless jungle and one cave. The jump is kinda cool I guess.",
      "image": "n64-dks-jungle-parkway.webp"
    },
    {
      "id": 33,
      "name": "D.K.'s Jungle Parkway",
      "game": "Mario Kart Wii",
      "original": "Mario Kart 64",
      "music": "0",
      "vibes": "2",
      "track": "2",
      "ranking": "28",
      "description": "The terrible drum loop was carried over to the Wii version. I repeat, there is no music just shit-sounding bongo drums. The vibes of the stage are also still bad. It looks like crap.",
      "image": "wii-dks-jungle-parkway.webp"
    },
    {
      "id": 34,
      "name": "Yoshi Valley",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "2",
      "vibes": "3",
      "track": "5",
      "ranking": "7",
      "description": "The original multi-pathed track and honestly the best. I think everyone agrees the little shortcut on the left is the fastest. I like that taking that path is a little risky. I don't love the music but I enjoy that they put in a massive, inexplicably spinning Yoshi egg in there at the end just to make this valley into Yoshi Valley.",
      "image": "n64-yoshi-valley.webp"
    },
    {
      "id": 34,
      "name": "Yoshi Valley",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 64",
      "music": "2",
      "vibes": "4",
      "track": "5",
      "ranking": "27",
      "description": "This is such a fun track! It branches off into a bunch of different paths, although the bridge on the left is still the fastest route. I just think this stage would be more special if all the routes were viable. The morning light looks good here and the spinning egg continues spinning in all its glory.",
      "image": "mk8-yoshi-valley.webp"
    },
    {
      "id": 35,
      "name": "Banshee Boardwalk",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "3",
      "vibes": "5",
      "track": "4",
      "ranking": "5",
      "description": "They really nail the vibe in this one! I love the massive cheep cheep, the dark water, the weird bat building and ghosts that come out at the end of the track. It's kinda difficult.",
      "image": "n64-banshee-boardwalk.webp"
    },
    {
      "id": 35,
      "name": "Banshee Boardwalk",
      "game": "Mario Kart DS",
      "original": "Mario Kart 64",
      "music": "3",
      "vibes": "5",
      "track": "4",
      "ranking": "8",
      "description": "This is much the same as the N64 version, a lot to enjoy in this level. The vibe is good and real.",
      "image": "ds-banshee-boardwalk.webp"
    },
    {
      "id": 143,
      "name": "Rainbow Road",
      "game": "Mario Kart 64",
      "original": "Mario Kart 64",
      "music": "5",
      "vibes": "5",
      "track": "3",
      "ranking": "2",
      "description": "Absolutely iconic stage, one of the greatest in Mario Kart history. This level was so hard, but when you got good at the game and just sailed by in first place on this stage, it felt like magic. The music is like fantasy space adventure to the max. The track is insanely long. Way too long, in fact, I don't know what they were thinking. But the big drop at the beginning is so good. It's so funny how your character just starts drifting into space for a while. It's like when the drugs hit.",
      "image": "n64-rainbow-road-n64.webp"
    },
    {
      "id": 143,
      "name": "Rainbow Road",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 64",
      "music": "4",
      "vibes": "5",
      "track": "2",
      "ranking": "24",
      "description": "This stage looks so gooooood! In terms of vibes it might be the best Rainbow Road. The music is good but in my opinion not as good as the original. Also, I think it's good that they made it shorter, but it's actually too short! And I remember this stage being really hard, now it's just a flat course with little to nothing going on.",
      "image": "mk8-rainbow-road-n64.webp"
    },
    {
      "id": 36,
      "name": "Peach Circuit",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "4",
      "vibes": "0",
      "track": "1",
      "ranking": "19",
      "description": "A very plain circuit. It's an introduction to the game. The generic music is good though, better than most generic mario kart music. Otherwise it's literally just driving on a road.",
      "image": "gba-peach-circuit.png"
    },
    {
      "id": 36,
      "name": "Peach Circuit",
      "game": "Mario Kart DS",
      "original": "Mario Kart: Super Circuit",
      "music": "4",
      "vibes": "1",
      "track": "1",
      "ranking": "29",
      "description": "They went for a plain and easy one from Super Circuit which I guess is fine because the music is great, but it is quite boring.",
      "image": "ds-peach-circuit.png"
    },
    {
      "id": 37,
      "name": "Shy Guy Beach",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "3",
      "description": "Iconic stage with some of my favourite beach music in the series. That bassline. I love that in the track you can choose which side of the islands you can go around. The crabs are cute.",
      "image": "gba-shy-guy-beach.webp"
    },
    {
      "id": 37,
      "name": "Shy Guy Beach",
      "game": "Mario Kart Wii",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "6",
      "description": "Shy Guy Beach my beloved. I used to cheese really fast times on this stage (just like Sherbet Land) by using the Magikoopa in the sea, because this bike goes faster offroad. I'm also a lover of beach levels and this one is great. Sure it's flat but it's special.",
      "image": "wii-shy-guy-beach.webp"
    },
    {
      "id": 38,
      "name": "Riverside Park",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "4",
      "vibes": "5",
      "track": "3",
      "ranking": "11",
      "description": "I have core memories associated with playing this stage on the bus as a child. I loved the colours, the jungle vibe. The track is quite forgiving but featured a cool jump.",
      "image": "gba-riverside-park.webp"
    },
    {
      "id": 38,
      "name": "Riverside Park",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Super Circuit",
      "music": "4",
      "vibes": "5",
      "track": "3",
      "ranking": "26",
      "description": "Very cool reimagination of a GBA track that I always liked! It's honestly unrecognisable from the original but that's fine, it looks so nice. They've changed the colours up, now it's sunset, and I love sunset so it's a yes from me. The music remix is also great.",
      "image": "mk8-riverside-park.jpg"
    },
    {
      "id": 144,
      "name": "Bowser's Castle 1",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "3",
      "ranking": "6",
      "description": "I love the music from the Bowser's Castle levels, when it gets to that B section, it goes off so hard. Otherwise the tracks differentiate themselves by their fun backgrounds and increasingly long and difficult tracks. I like this one the most because it's not too punishing. However it's not long enough to listen to the whole song.",
      "image": "gba-bowsers-castle-1.webp"
    },
    {
      "id": 144,
      "name": "Bowser's Castle 1",
      "game": "Mario Kart 7",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "4",
      "ranking": "12",
      "description": "really love this faithful rendition of this GBA track that I really like. The upgraded soundfont does the already excellent music wonders, and the sharp corners are totally doable in this game's mechanics. It just looks great!",
      "image": "3ds-bowsers-castle-1.jpg"
    },
    {
      "id": 39,
      "name": "Mario Circuit",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "4",
      "vibes": "0",
      "track": "1",
      "ranking": "20",
      "description": "It's just driving on a road, this stage has nothing to give. The generic mario kart music is nice though.",
      "image": "gba-mario-circuit-gba.png"
    },
    {
      "id": 39,
      "name": "Mario Circuit",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "3",
      "track": "5",
      "ranking": "39",
      "description": "Incredible how they took a track with so few vibes and made this banger! Just by making the area look nicer and adding a fun anti-gravity section, they turned a standard race-track into a fun race-track. They even added a little pitstop with an item box in it. So fun! This saxophone-heavy remix of the original music is also excellent.",
      "image": "mk8-mario-circuit-gba.webp"
    },
    {
      "id": 40,
      "name": "Boo Lake",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "2",
      "track": "1",
      "ranking": "16",
      "description": "In my opinion, this ghost music is some of the best in the series. However, what I don't like about this track is that it's meant to be a lake but there's no water. I never liked the SNES-style ghost levels with these weird blocks that break when you hit them. The stages are so perilous!",
      "image": "gba-boo-lake.webp"
    },
    {
      "id": 40,
      "name": "Boo Lake",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "12",
      "description": "This might be my favourite reimagining of a retro track ever! They took the very mediocre original, made it into an actual lake and added sick underwater sections. They took the ghostly boardwalk concept and went ham with it. And they added the most insane drums to the music. It goes so hard for no reason!",
      "image": "mk8-boo-lake.webp"
    },
    {
      "id": 41,
      "name": "Cheese Land",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "3",
      "ranking": "14",
      "description": "Stunning landscape, I love that they made the whole place out of cheese with little mice running round. Music is a party banger.",
      "image": "gba-cheese-land.webp"
    },
    {
      "id": 41,
      "name": "Cheese Land",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "4",
      "ranking": "22",
      "description": "Oh my god they took some already fantastic music and turned it into an absolute banger. It might not be the music you expect for a desert made out of cheese but it's so fun. I love the section at the end before it loops. The stage also looks completely unrecognisable from the original but that's fine. They did a lot of cheese-themed stuff to the level but I think they could have gone harder.",
      "image": "mk8-cheese-land.webp"
    },
    {
      "id": 145,
      "name": "Bowser's Castle 2",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "2",
      "ranking": "7",
      "description": "Amazing music, I like the purple background a lot, but this is where shit starts to get difficult. We have the metal grating sections without walls, all those 90 degree turns and so much lava. Difficult.",
      "image": "gba-bowsers-castle-2.webp"
    },
    {
      "id": 145,
      "name": "Bowser's Castle 2",
      "game": "Mario Kart DS",
      "original": "Mario Kart: Super Circuit",
      "music": "3",
      "vibes": "4",
      "track": "2",
      "ranking": "12",
      "description": "How did they fuck up this music so much!? The original is so good, and this sounds just absolutely terrible on the DS. What the fuck. The stage looks really good though.",
      "image": "ds-bowsers-castle-2.png"
    },
    {
      "id": 42,
      "name": "Luigi Circuit",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "4",
      "vibes": "5",
      "track": "3",
      "ranking": "13",
      "description": "For some reason Luigi's circuit is pelting it down with rain and I'm not against it. I think only Neo Bowser City had rain outside of this so it's pretty unique. I also think this generic 'mario circuit' music is super good.",
      "image": "gba-luigi-circuit-gba.webp"
    },
    {
      "id": 42,
      "name": "Luigi Circuit",
      "game": "Mario Kart DS",
      "original": "Mario Kart: Super Circuit",
      "music": "4",
      "vibes": "5",
      "track": "3",
      "ranking": "17",
      "description": "Interesting to see this rainy vibe translate into a more 3D space. There is actually a modelled zepellin in this version. Music is great.",
      "image": "ds-luigi-circuit-gba.png"
    },
    {
      "id": 43,
      "name": "Sky Garden",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "4",
      "description": "I loved this track as a child. Driving around on clouds? Sure it looks like trash on the GBA but my brain filled in all the gaps and I loved it. Music is uplifting and great. There's a cool shortcut if you mushroom on this ramp somewhere.",
      "image": "gba-sky-garden.webp"
    },
    {
      "id": 43,
      "name": "Sky Garden",
      "game": "Mario Kart DS",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "11",
      "description": "They put in the Luigi Circuit zeppelin! Otherwise this stage is delight. I love the setting and this was one of my favourites as a child. The music sounds good here!",
      "image": "ds-sky-garden.png"
    },
    {
      "id": 43,
      "name": "Sky Garden",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "3",
      "ranking": "62",
      "description": "I think this stage looks alright and I'm happy this stage is here, but I would be lying if I said I wasn't so taken by this version. Something about it just using all the assets from Cloudtop Cruise makes me feel like it wasn't made with love.",
      "image": "mk8-sky-garden.webp"
    },
    {
      "id": 44,
      "name": "Cheep-Cheep Island",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "2",
      "description": "The unappreciated sibling to Shy Guy Beach, same banging beach music that I love, and this time with added vibes with the sunset and massive fish jumping in the distance. It's got two difficult 90 degree turns near the end to make sure that the beginners know their place.",
      "image": "gba-cheep-cheep-island.webp"
    },
    {
      "id": 45,
      "name": "Sunset Wilds",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "3",
      "vibes": "5",
      "track": "3",
      "ranking": "12",
      "description": "The vibes of this stage are off the charts. That sunset is so good and I LOVE how it sets over the course of the three laps. They took the desert level vibe and transformed it into something super special. The track and music are kinda mid.",
      "image": "gba-sunset-wilds.webp"
    },
    {
      "id": 45,
      "name": "Sunset Wilds",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Super Circuit",
      "music": "3",
      "vibes": "1",
      "track": "1",
      "ranking": "89",
      "description": "This retro track is so upsetting. Why the fuck did they take out the sunset from Sunset Wilds? What were they thinking? Now the sun doesn't even set, it just sits there. The whole amazing vibe of the original came from the sky changing colour each lap and they just ignored that entirely. I don't enjoy driving around the track because of this, the wasted potential.",
      "image": "mk8-sunset-wilds.webp"
    },
    {
      "id": 46,
      "name": "Snow Land",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "2",
      "vibes": "4",
      "track": "1",
      "ranking": "15",
      "description": "This stage has little to no coins meaning I was constantly spinning out of control when doing my research for this ranking. All the coins are in one spot lined up in the middle. If you miss that for whatever reason, it's over! When you do get it though, it feels great. Also, is it harder to drift on this slippery stage? Falling in water feels terrible as well. The music is kinda plain but I love the pink sky.",
      "image": "gba-snow-land.webp"
    },
    {
      "id": 46,
      "name": "Snow Land",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Super Circuit",
      "music": "3",
      "vibes": "4",
      "track": "4",
      "ranking": "35",
      "description": "I think they did a great job with this track. They breathed life into an otherwise annoying stage. Now the line of coins come and follow the track for a bit, it's a cool throwback. I love the pink and blue colours!",
      "image": "mk8-snow-land.webp"
    },
    {
      "id": 47,
      "name": "Ribbon Road",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "2",
      "vibes": "5",
      "track": "2",
      "ranking": "9",
      "description": "I have a strong memory of this being the stand-out track on the GBA. The whole land is made of presents! What a fun concept! Although did you know that there is a busted shortcut on this track? I also think it's kind unfair with lots of difficult turns.",
      "image": "gba-ribbon-road.webp"
    },
    {
      "id": 47,
      "name": "Ribbon Road",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Super Circuit",
      "music": "2",
      "vibes": "3",
      "track": "4",
      "ranking": "66",
      "description": "Baffling that they took the original concept of a land made out of presents and instead remade it as a child's bedroom! I'm not saying it looks bad, far from it, but like why. I think the music was never that good and this updated version doesn't do too much to impress me. I don't feel like it fits to the this land of toys vibe. The track itself is quite chaotic with the moving ribbon, it's quite fun.",
      "image": "mk8-ribbon-road.webp"
    },
    {
      "id": 48,
      "name": "Yoshi Desert",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "3",
      "vibes": "2",
      "track": "2",
      "ranking": "18",
      "description": "A plain and trope-y Egyptian style desert level. Music is alright, but this has nothing on Sunset Wilds. I like the Yoshi Sphinx.",
      "image": "gba-yoshi-desert.webp"
    },
    {
      "id": 142,
      "name": "Bowser's Castle 3",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "3",
      "ranking": "5",
      "description": "Great music as usual, I like the stormy outdoors background, and the track itself isn't so ridiculous. I like the diagonal bit through the corners. There's less bullshit happening on this track.",
      "image": "gba-bowsers-castle-3.webp"
    },
    {
      "id": 142,
      "name": "Bowser's Castle 3",
      "game": "Mario Kart Wii",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "3",
      "ranking": "16",
      "description": "I think this is the version that put GBA Bowser's Castle into the collective consciousness. The music sounds great here and it's one of the better of the originals. I think this is the reason I love this music so much.",
      "image": "wii-bowsers-castle-3.webp"
    },
    {
      "id": 49,
      "name": "Lakeside Park",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "4",
      "vibes": "5",
      "track": "3",
      "ranking": "10",
      "description": "This and Riverside Park are both kinda iconic for me. They really represent this era of Mario Kart. I really enjoy how they made two similar tracks and this one is like a remix of the first one, with alternative music and fun volcano eruptions, and even the sky turns darker as the race goes on. Awesome.",
      "image": "gba-lakeside-park.webp"
    },
    {
      "id": 50,
      "name": "Broken Pier",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "2",
      "track": "1",
      "ranking": "17",
      "description": "True to its name, this stage is perilous and difficult, but I actually feel like it's on the same level as Boo Lake. What's going on with the weird mountains in the background. The music is great though.",
      "image": "gba-broken-pier.webp"
    },
    {
      "id": 51,
      "name": "Bowser's Castle 4",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "4",
      "track": "0",
      "ranking": "8",
      "description": "Great music, interesting background, not sure what's going on. But this stage is so long and so fucking hard. There are so many 90 degree turns, so much lava to fall into, there are even multiple routes, and in general far too much chaos. I like that it has mechakoopas.",
      "image": "gba-bowsers-castle-4.webp"
    },
    {
      "id": 146,
      "name": "Rainbow Road",
      "game": "Mario Kart: Super Circuit",
      "original": "Mario Kart: Super Circuit",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "1",
      "description": "Had a good think about it and I think this is actually one of those all time great tracks. Super Circuit is a great time and when you finally unlock this super hard stage, it's so fun. They took the music in a different direction for this Rainbow Road but it still has that magic in the intro and the special section at the end. I loved when they featured that little section at the end in the Rainbow Road smash medley - that is a deep cut! The sad part is that when playing this game though, you'll probably finish the race before the song gets to that part. Otherwise this track is hard is nails because there are jumps instead of edges, but it allows for some wild shortcuts.",
      "image": "gba-rainbow-road-gba.webp"
    },
    {
      "id": 147,
      "name": "Luigi Circuit",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "1",
      "track": "4",
      "ranking": "13",
      "description": "I like that they did something interesting with their tutorial level in Double Dash. In this stage, half of the lap is spent going one way, and then the other is going back on the other way on the same road, so you often come into contact with people further behind you in the lap. It's a great little idea and the music is cute.",
      "image": "gcn-luigi-circuit-gcn.webp"
    },
    {
      "id": 147,
      "name": "Luigi Circuit",
      "game": "Mario Kart DS",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "1",
      "track": "4",
      "ranking": "24",
      "description": "They took yet another beginner stage with not much going on. DS retro tracks are really not all that. At least this one has the fun two-way street gimmick.",
      "image": "ds-luigi-circuit-gcn.webp"
    },
    {
      "id": 52,
      "name": "Peach Beach",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "2",
      "description": "Peach Beach has some of the most perfect beach music you could ever imagine. Couple that with a Super Mario Sunshine themed level complete with Cataquacks, and you have yourself a recipe for a perfect stage. So delightful and a personal favourite of mine.",
      "image": "gcn-peach-beach.webp"
    },
    {
      "id": 52,
      "name": "Peach Beach",
      "game": "Mario Kart Wii",
      "original": "Mario Kart: Double Dash!!",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "7",
      "description": "Huge track, I love it so much. This perfect beach music, the vibe, the jump over the water. Even the fact that there's a random place near the end on the left with item boxes you can visit. Why did they add that. Is one of those cruise ships Daisy Cruiser?",
      "image": "wii-peach-beach.webp"
    },
    {
      "id": 52,
      "name": "Peach Beach",
      "game": "Mario Kart World",
      "original": "Mario Kart: Double Dash!!",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "2",
      "description": "I was soooo excited when I learned that one of my favourite ever tracks was coming back! And thank GOD they did a good remix of the music this time. The Mario Kart 8 Daisy Cruiser music was not it for me. And now they changed this stage a bunch to turn it into an entire resort island, which I love. Vibes are great and all three laps are different. Actually the stage is kinda unrecognisable, but at least those Cataquacks are still there causing trouble. I just love the look of this place the most.",
      "image": "world-peach-beach.avif"
    },
    {
      "id": 53,
      "name": "Baby Park",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "3",
      "track": "4",
      "ranking": "8",
      "description": "This stage changed everything. Everyone fucking loved it because it's so simple and chaotic. I remember always kinda resenting it. There's no way to play competitively on this stage. They designed the music which goes up really well for the stage though.",
      "image": "gcn-baby-park.webp"
    },
    {
      "id": 53,
      "name": "Baby Park",
      "game": "Mario Kart DS",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "2",
      "track": "3",
      "ranking": "18",
      "description": "Also on the DS this was deemed to be a fan favourite, although in my opinion, it didn't hit quite as hard as the original. The background looks worse and did they make the stage bigger?",
      "image": "ds-baby-park.png"
    },
    {
      "id": 53,
      "name": "Baby Park",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "2",
      "track": "3",
      "ranking": "74",
      "description": "Baby Park is a pretty different time compared to the previous versions but it's hard to put my finger on why. One thing they changed was they made the music go up a key each time you complete a lap. This is a cool idea, but it means you'll never get to hear the whole music track. I like the updated graphics and background but this stage is all a bit too much for my taste.",
      "image": "mk8-baby-park.webp"
    },
    {
      "id": 54,
      "name": "Dry Dry Desert",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "2",
      "vibes": "2",
      "track": "1",
      "ranking": "12",
      "description": "One of the worse desert levels, that's for sure. The music is grating, and the level is kinda annoying with the curves, bumps and pokeys. Also nobody ever actually falls into the quicksand.",
      "image": "gcn-dry-dry-desert.webp"
    },
    {
      "id": 54,
      "name": "Dry Dry Desert",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "3",
      "track": "2",
      "ranking": "65",
      "description": "They improved the vibe a lot from the original, thank god, but this stage doesn't reach the heights of Dry Dry Ruins or Bone Dry Desert. I like this music for its constant guitar strumming and beat. The stage is kinda boring to drive though.",
      "image": "mk8-dry-dry-desert.jpg"
    },
    {
      "id": 55,
      "name": "Mushroom Bridge",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "1",
      "vibes": "0",
      "track": "2",
      "ranking": "15",
      "description": "I don't understand why there is a bridge going between these two places when there's literally a motorway across the coast. It's clearly just trying to emulate the highs (and lows) of motorway driving. In my opinion it's a bad vibe. This is trying to be Toad's Turnpike but failing, instead it's just making me think about how much I hate cars and car infrastructure.",
      "image": "gcn-mushroom-bridge.webp"
    },
    {
      "id": 55,
      "name": "Mushroom Bridge",
      "game": "Mario Kart DS",
      "original": "Mario Kart: Double Dash!!",
      "music": "1",
      "vibes": "0",
      "track": "2",
      "ranking": "25",
      "description": "This is just like the gamecube version. I don't like it in just the same way. Actually I think it even looks worse.",
      "image": "ds-mushroom-bridge.webp"
    },
    {
      "id": 148,
      "name": "Mario Circuit",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "1",
      "track": "2",
      "ranking": "16",
      "description": "Wow, this is so much more boring than Luigi Circuit. This really has got nothing going for it. I guess the last couple of corners and the little bridge are kinda satisfying.",
      "image": "gcn-mario-circuit-gcn.webp"
    },
    {
      "id": 148,
      "name": "Mario Circuit",
      "game": "Mario Kart Wii",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "1",
      "track": "2",
      "ranking": "29",
      "description": "Why did they add this to Mario Kart Wii? It's a totally generic Mario Circuit and there's already Mario Raceway. Life is full of little disappointments.",
      "image": "wii-mario-circuit-gcn.webp"
    },
    {
      "id": 56,
      "name": "Daisy Cruiser",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "5",
      "vibes": "4",
      "track": "4",
      "ranking": "3",
      "description": "This shares the same beautiful music with Peach Beach. I'll always love Peach Beach more but this is also a real fun track. I like that the tables and item boxes roll with the waves inside the boat.",
      "image": "gcn-daisy-cruiser.webp"
    },
    {
      "id": 56,
      "name": "Daisy Cruiser",
      "game": "Mario Kart 7",
      "original": "Mario Kart: Double Dash!!",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "10",
      "description": "I like how they switched up this retro course by adding the underwater sections! Otherwise this is a delightful rendition of an already excellent track with excellent music. I'll always love Peach Beach more but I can't say why.",
      "image": "3ds-daisy-cruiser.webp"
    },
    {
      "id": 56,
      "name": "Daisy Cruiser",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "4",
      "track": "5",
      "ranking": "29",
      "description": "This is totally ridiculous but I'm totally hung up on loving this stage because of this weird thing in the music where the steel drum doesn't do a tremolo thing. In the original the steel drums are really subtle and this remix just does it so differently that it's jarring. It bothers me so much because otherwise this would be a perfect remix of a perfect song, especially with the beautiful strings. But this one annoyance is truly stopping me from loving Daisy Cruiser. The stage itself is fine, just same as the 3DS verison really.",
      "image": "mk8-daisy-cruiser.jpg"
    },
    {
      "id": 57,
      "name": "Waluigi Stadium",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "1",
      "vibes": "3",
      "track": "5",
      "ranking": "6",
      "description": "This is a pretty fun stage! This is the stadium dirt-track level that N64 Wario Stadium dreamed of being. I feel like the music is a bit shit.",
      "image": "gcn-waluigi-stadium.webp"
    },
    {
      "id": 57,
      "name": "Waluigi Stadium",
      "game": "Mario Kart Wii",
      "original": "Mario Kart: Double Dash!!",
      "music": "1",
      "vibes": "3",
      "track": "5",
      "ranking": "23",
      "description": "Fun stage! It looks nicer than the original and you can hug the half pipe boosters which is fun and requires skill. Lots to enjoy, just the music is pretty bad.",
      "image": "wii-waluigi-stadium.webp"
    },
    {
      "id": 57,
      "name": "Waluigi Stadium",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Double Dash!!",
      "music": "1",
      "vibes": "3",
      "track": "5",
      "ranking": "55",
      "description": "This is much the same as the Wii version, although with some nicer browns on the dirt. Not any noticeable improvements in the music really.",
      "image": "mk8-waluigi-stadium.webp"
    },
    {
      "id": 149,
      "name": "Sherbet Land",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "2",
      "track": "3",
      "ranking": "9",
      "description": "Decorations-wise this stage a bunch of random shit, ice-skating shy guys, freezies that freeze and bounce off of you and blowing clouds. It's going for the 'more is more' approach, which I respect, but results in a lack of cohesion. What is even going on in this level. The music's alright.",
      "image": "gcn-sherbet-land-gcn.webp"
    },
    {
      "id": 149,
      "name": "Sherbet Land",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Double Dash!!",
      "music": "4",
      "vibes": "3",
      "track": "4",
      "ranking": "54",
      "description": "I really like the remixed music, it sounds so nice and contains the classic Double Dash whistle. I think this stage is really fun to drive in with the new underwater sections too. Yeah, great little ice level, I support it. It feels more cohesive than the original in terms of style.",
      "image": "mk8-sherbet-land-gcn.webp"
    },
    {
      "id": 58,
      "name": "Mushroom City",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "1",
      "vibes": "4",
      "track": "5",
      "ranking": "4",
      "description": "What a wild level! It's very chaotic! There is loads of shit on the roads, loads of 90 degree turns, and even a split path. At the end a crazy against-the-traffic part. Lots of shenanigans! The music is a bit shit.",
      "image": "gcn-mushroom-city.webp"
    },
    {
      "id": 59,
      "name": "Yoshi Circuit",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "1",
      "track": "3",
      "ranking": "14",
      "description": "The whole thing is that the island is shaped like a Yoshi, but driving around the island you don't really feel like you're riding on a Yoshi. In fact it feels generic and boring. There's a cool mushroom shortcut through a waterfall.",
      "image": "gcn-yoshi-circuit.webp"
    },
    {
      "id": 59,
      "name": "Yoshi Circuit",
      "game": "Mario Kart DS",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "1",
      "track": "3",
      "ranking": "21",
      "description": "This is just the same as the gamecube version but looks worse. I find it quite boring and not enough to do with Yoshi.",
      "image": "ds-yoshi-circuit.webp"
    },
    {
      "id": 59,
      "name": "Yoshi Circuit",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "1",
      "track": "3",
      "ranking": "76",
      "description": "I kinda enjoy this track with its many curves but other than that there's not too much going on. I resent that there's nothing really Yoshi-related here, apart from the shape of the course.",
      "image": "mk8-yoshi-circuit.webp"
    },
    {
      "id": 60,
      "name": "DK Mountain",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "2",
      "vibes": "4",
      "track": "5",
      "ranking": "5",
      "description": "This is an iconic level. Shooting out of the barrel, bumping down the rocky bit at the top, attempting to jump the crevasse, getting a green shell on the rickety bridge. So many excellent shenanigans. As far as minimal drumming music, it's alright I guess.",
      "image": "gcn-dk-mountain.webp"
    },
    {
      "id": 60,
      "name": "DK Mountain",
      "game": "Mario Kart Wii",
      "original": "Mario Kart: Double Dash!!",
      "music": "2",
      "vibes": "4",
      "track": "5",
      "ranking": "22",
      "description": "Super fun stage equally as good as the original if not better thanks to the better mechanics, making it more possible than ever to cross that crevasse!",
      "image": "wii-dk-mountain.webp"
    },
    {
      "id": 60,
      "name": "DK Mountain",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart: Double Dash!!",
      "music": "3",
      "vibes": "4",
      "track": "5",
      "ranking": "36",
      "description": "Such a great track now looking good in fancy HD. So much potential for shenanigans on that final bridge, and that crevasse in the ground is still a lot of fun.",
      "image": "mk8-dk-mountain.webp"
    },
    {
      "id": 61,
      "name": "Wario Colosseum",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "2",
      "vibes": "4",
      "track": "3",
      "ranking": "11",
      "description": "Of all the levels, this is the one that feels most like a rollercoaster. It's insane! If you've got the drifting down in this game, it can be a fun level, but otherwise it's too much. It's too long! Vibes are good though.",
      "image": "gcn-wario-colosseum.webp"
    },
    {
      "id": 62,
      "name": "Dino Dino Jungle",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "2",
      "vibes": "5",
      "track": "4",
      "ranking": "7",
      "description": "I remember this track being so difficult. But it's hard to deny that it's super cool. I mean, dinosaurs are great. I love that you get to see the dinosaur's feet as well as its head later on in the track.",
      "image": "gcn-dino-dino-jungle.webp"
    },
    {
      "id": 62,
      "name": "Dino Dino Jungle",
      "game": "Mario Kart 7",
      "original": "Mario Kart: Double Dash!!",
      "music": "2",
      "vibes": "5",
      "track": "4",
      "ranking": "15",
      "description": "Super fun level with a big dinosaur in it! I remember it being really hard on the gamecube but totally fine here, although that's probably just because I grew up.",
      "image": "3ds-dino-dino-jungle.webp"
    },
    {
      "id": 62,
      "name": "Dino Dino Jungle",
      "game": "Mario Kart World",
      "original": "Mario Kart: Double Dash!!",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "4",
      "description": "The drums in this remix are so good. I love arriving to this track in the game because it just goes so hard. And then theres dinosaurs everywhere? Fucking love it. There's more dinosaurs than in the original. There's straight up dinosaurs everywhere! And they innovated by changing the vibe to a Jurassic Park situation. It's a lot of fun. I mean hello, you can do tricks off of the Triceratops!",
      "image": "world-dino-dino-jungle.png"
    },
    {
      "id": 150,
      "name": "Bowser's Castle",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "1",
      "vibes": "1",
      "track": "4",
      "ranking": "10",
      "description": "This Bowser's Castle feels a bit random. Sure, it has cool elements in it, lots of fun obstacles, but it doesn't have a coherent vibe. Nor does it have good music.",
      "image": "gcn-bowsers-castle-gcn.webp"
    },
    {
      "id": 151,
      "name": "Rainbow Road",
      "game": "Mario Kart: Double Dash!!",
      "original": "Mario Kart: Double Dash!!",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "1",
      "description": "Let me tell you the fact that this Rainbow Road was set floating above a city in the nighttime was so fucking cool back then. It was inspired. This level was so beautiful. I love it! And the music just perfect. Maybe it's the best ever Rainbow Road music, and that's saying something with all those incredible Mario Kart 8 remixes. It's just timeless!",
      "image": "gcn-rainbow-road-gcn.webp"
    },
    {
      "id": 63,
      "name": "Figure-8 Circuit",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "2",
      "vibes": "1",
      "track": "0",
      "ranking": "32",
      "description": "Wild that this lame-ass, boring-ass track got the highest honour of being a stage in Super Smash Bros. The music is cute but not nearly enough to save this plain-ass, sleepy-ass racetrack.",
      "image": "ds-figure-8-circuit.webp"
    },
    {
      "id": 64,
      "name": "Yoshi Falls",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "2",
      "vibes": "2",
      "track": "3",
      "ranking": "13",
      "description": "What a bizarre design for a stage. Why does it look like this. I guess it's kinda fun to risk it all and drive on the sloped bit. This particular minimal drum music is at least catchy.",
      "image": "ds-yoshi-falls.webp"
    },
    {
      "id": 64,
      "name": "Yoshi Falls",
      "game": "Mario Kart Wii",
      "original": "Mario Kart DS",
      "music": "2",
      "vibes": "2",
      "track": "3",
      "ranking": "24",
      "description": "A third retro track in Mario Kart Wii with jungle-drums music. This one is pretty boring but thinking back maybe I did have a lot of fun on this stage after all.",
      "image": "wii-yoshi-falls.webp"
    },
    {
      "id": 65,
      "name": "Cheep Cheep Beach",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "4",
      "vibes": "3",
      "track": "4",
      "ranking": "6",
      "description": "I like the beach music a lot, and although it does have that bland, Koopa Troopa Beach look to it, it's not nearly as bad as that, and also features different sections. All in all a worthy entry into the Mario Beach level canon.",
      "image": "ds-cheep-cheep-beach.webp"
    },
    {
      "id": 65,
      "name": "Cheep Cheep Beach",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "31",
      "description": "I love all the lighting effects they added to this stage to make it feel like you're in the Caribbean. I like the remix of the music, which is hugely giving Mario Sunshine energy. This version might be one of my favourite beach levels!",
      "image": "mk8-cheep-cheep-beach.webp"
    },
    {
      "id": 66,
      "name": "Luigi's Mansion",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "1",
      "vibes": "4",
      "track": "2",
      "ranking": "20",
      "description": "Always kinda hated this level for some reason. On paper it's alright, but something about constantly playing it with the free download multiplayer thing made me hate it. Don't like the music or the swamp bit.",
      "image": "ds-luigis-mansion.webp"
    },
    {
      "id": 66,
      "name": "Luigi's Mansion",
      "game": "Mario Kart 7",
      "original": "Mario Kart DS",
      "music": "1",
      "vibes": "4",
      "track": "2",
      "ranking": "22",
      "description": "At least it's a new kind of spooky level, you get to go in the mansion and stuff. But the music doesn't fit and I just have this personal thing against this stage because I disliked it on the DS.",
      "image": "3ds-luigis-mansion.webp"
    },
    {
      "id": 67,
      "name": "Desert Hills",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "3",
      "vibes": "2",
      "track": "4",
      "ranking": "14",
      "description": "I think this level low-key taught me how to snake in this game. Those turns at the end around the hills require constant drifting and before you know it, you're snaking. The music is cheeky and the vibe is plain, but I enjoy the Super Mario Bros 3-style sun spitting out fireballs.",
      "image": "ds-desert-hills.webp"
    },
    {
      "id": 67,
      "name": "Desert Hills",
      "game": "Mario Kart Wii",
      "original": "Mario Kart DS",
      "music": "3",
      "vibes": "2",
      "track": "4",
      "ranking": "20",
      "description": "This level is kinda shit compared to Dry Dry Ruins but there are good times to be had here. I just think it looks and sounds kinda shit.",
      "image": "wii-desert-hills.webp"
    },
    {
      "id": 67,
      "name": "Desert Hills",
      "game": "Mario Kart World",
      "original": "Mario Kart DS",
      "music": "2",
      "vibes": "1",
      "track": "1",
      "ranking": "29",
      "description": "Listen, I'm not the biggest Desert Hills hater but why did they pick this when they already have two good DS tracks, no GBA tracks, and Yoshi Desert is RIGHT THERE! Not only that but they flattened the eponymous hills! The music or the generic desert vibe of the area does is no favours either. Sad to say that they fucked up on desert hills lads. They could have added the angry sun at least.",
      "image": "world-desert-hills.avif"
    },
    {
      "id": 68,
      "name": "Delfino Square",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "4",
      "track": "4",
      "ranking": "4",
      "description": "Delightful DS classic! I feel that this music really captures the 'peachy' vibe of a lot of the 'urban'-style tracks. The track itself is really hard with all the hard-to-see sharp corners and the pier. There's a cool little shortcut between the buildings which I like.",
      "image": "ds-delfino-square.webp"
    },
    {
      "id": 68,
      "name": "Delfino Square",
      "game": "Mario Kart Wii",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "14",
      "description": "I was so excited when one of my favourite DS tracks came back on the Wii, and it sounds so good now! The streets are a bit bigger which makes it a bit nicer to drive in. I think it looks great.",
      "image": "wii-delfino-square.webp"
    },
    {
      "id": 69,
      "name": "Waluigi Pinball",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "1",
      "description": "An all-time Mario Kart classic! Waluigi Pinball is so iconic. The music goes so hard, and the level itself is just so inspired. I'm a huge fan.",
      "image": "ds-waluigi-pinball.webp"
    },
    {
      "id": 69,
      "name": "Waluigi Pinball",
      "game": "Mario Kart 7",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "3",
      "description": "It's hard to give this a perfect score because Waluigi literally isn't a playable character in Mario Kart 7. It's kinda scandalous if you think about it. Anyway this is an all time classic track and it's almost wasted on Mario Kart 7.",
      "image": "3ds-waluigi-pinball.jpg"
    },
    {
      "id": 69,
      "name": "Waluigi Pinball",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "23",
      "description": "This classic track is remade again with new graphics and I'm in. Well, I'm in it for the music! Except what I hadn't realised while popping off during the reveal of this track was we already had a remix of this music in Wario Stadium! Whatever, this stage is still great and a lot of fun. although, is it possible that this stage is too big now? I never get hit by the balls anymore.",
      "image": "mk8-waluigi-pinball.webp"
    },
    {
      "id": 70,
      "name": "Shroom Ridge",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "4",
      "vibes": "3",
      "track": "4",
      "ranking": "10",
      "description": "For a road through green fields stage, this is actually alright! The music is very uplifting and fun, although in this version there is traffic coming towards you as well as going away, which makes it stressful. Driving along the cliffside is fun and dangerous!",
      "image": "ds-shroom-ridge.png"
    },
    {
      "id": 70,
      "name": "Shroom Ridge",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "2",
      "track": "4",
      "ranking": "34",
      "description": "I just love this positive-sounding and uplifting music! Sounds like partying with a smile on your face. They rocked it with the remix, although I don't think they rocked it with the graphics. It looks very plain and I feel like they could have done more with it.",
      "image": "mk8-shroom-ridge.webp"
    },
    {
      "id": 71,
      "name": "DK Pass",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "1",
      "vibes": "2",
      "track": "3",
      "ranking": "19",
      "description": "One of two DK-goes-skiing stages. I find it quite plain and the music quite annoying. Hard to appreciate this when DK's Snowboard Cross exists.",
      "image": "ds-dk-pass.webp"
    },
    {
      "id": 71,
      "name": "DK Pass",
      "game": "Mario Kart 7",
      "original": "Mario Kart DS",
      "music": "1",
      "vibes": "2",
      "track": "3",
      "ranking": "21",
      "description": "It's alright I guess but I don't like that violin sound in the music. Definitely one of the weaker snow levels and this version brings nothing new to the table.",
      "image": "3ds-dk-pass.jpg"
    },
    {
      "id": 71,
      "name": "DK Pass",
      "game": "Mario Kart World",
      "original": "Mario Kart DS",
      "music": "3",
      "vibes": "2",
      "track": "3",
      "ranking": "23",
      "description": "They turned this stage into a ski resort which I enjoy! It's a nice look, although why did they take away the snowmen at the end of the track? Baffling decision. They went full christmas on the soundtrack which I'm not against. This track is neither here nor there for me.",
      "image": "world-dk-pass.avif"
    },
    {
      "id": 72,
      "name": "Tick Tock Clock",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "3",
      "vibes": "4",
      "track": "4",
      "ranking": "9",
      "description": "Making a level out of Super Mario 64's clock level is so inspired! The music is better than you might think on first listen and they did a great job with the visuals.",
      "image": "ds-tick-tock-clock.png"
    },
    {
      "id": 72,
      "name": "Tick Tock Clock",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart DS",
      "music": "4",
      "vibes": "4",
      "track": "4",
      "ranking": "57",
      "description": "So fun that they brought back this niche DS track based on the Super Mario 64 clock level. I love what they did with the place! I think the music sounds better than ever and the stage remains a lot of fun to play.",
      "image": "mk8-tick-tock-clock.webp"
    },
    {
      "id": 152,
      "name": "Mario Circuit",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "2",
      "vibes": "1",
      "track": "1",
      "ranking": "30",
      "description": "This Mario Circuit really brings nothing to the table. There's nothing here. At least it's not Figure-8 Circuit.",
      "image": "ds-mario-circuit-ds.png"
    },
    {
      "id": 152,
      "name": "Mario Circuit",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart DS",
      "music": "2",
      "vibes": "1",
      "track": "1",
      "ranking": "96",
      "description": "Super lame that they brought back this boring ass Mario Circuit. There are so few good Mario Circuits why does this have to keep happening! This one really has nothing of note in the track. I guess there's a big wiggler. Not enough to impress me.",
      "image": "mk8-mario-circuit-ds.webp"
    },
    {
      "id": 73,
      "name": "Airship Fortress",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "3",
      "description": "Hidden gem! Great western-style music and a super unique setting: the airships from Super Mario Bros 3! Then you get shot into a building with a sick twisty tower. There's a lot to love, mainly the banging music.",
      "image": "ds-airship-fortress.webp"
    },
    {
      "id": 73,
      "name": "Airship Fortress",
      "game": "Mario Kart 7",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "2",
      "description": "A unique and fun track from the DS days. I just really enjoy the vibe of the area and the especially the upbeat western-style music.",
      "image": "3ds-airship-fortress.webp"
    },
    {
      "id": 73,
      "name": "Airship Fortress",
      "game": "Mario Kart World",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "1",
      "description": "So happy they brought back this classic from DS! They made it look soooo good! Wild that they have this cartoonish open world where all the tracks are connected, and this one is just a literal war zone. They went super hard on the music and drifting around that tower remains as much fun as always. Love love love.",
      "image": "world-airship-fortress.webp"
    },
    {
      "id": 153,
      "name": "Wario Stadium",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "2",
      "track": "4",
      "ranking": "15",
      "description": "This also uses the same music as Waluigi Pinball so you are jamming your way through this dirt-track stadium. Seriously why are there so many levels that look like this. This one is kinda hard to get right in terms of turning the corners. I like that there are lots of boosters.",
      "image": "ds-wario-stadium-ds.webp"
    },
    {
      "id": 153,
      "name": "Wario Stadium",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "2",
      "track": "4",
      "ranking": "52",
      "description": "They had some fun with this level and added an anti-gravity section which I like! Otherwise it's the same fun obstacles in this same-y dirt track place. The music is Waluigi Pinball so hell yeah it's great.",
      "image": "mk8-wario-stadium-ds.webp"
    },
    {
      "id": 74,
      "name": "Peach Gardens",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "5",
      "description": "This is how you make a Peach level! The vibes are on point. It looks like royal gardens, not a racetrack, which just makes it fun, almost like you're trespassing. Music is in a rare 3/4 and nails the feeling perfectly.",
      "image": "ds-peach-gardens.png"
    },
    {
      "id": 74,
      "name": "Peach Gardens",
      "game": "Mario Kart Wii",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "19",
      "description": "Beautiful track with loads of fun routes to take. As good as the DS version if not better. A delight.",
      "image": "wii-peach-gardens.png"
    },
    {
      "id": 74,
      "name": "Peach Gardens",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "15",
      "description": "They changed it around so that in the final lap you go a different way around the track! It's inspired and I love it. The new remix of the music is great.",
      "image": "mk8-peach-gardens.webp"
    },
    {
      "id": 154,
      "name": "Bowser's Castle",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "1",
      "vibes": "3",
      "track": "4",
      "ranking": "16",
      "description": "The most memorable part of this level is the massive twisting pole that you ride towards the end of the track. Why on earth did they put that in. Apart from that, there's your typical Bowser's Castle full of traps and stuff. I feel like the ending is a call back to the GBA Bowser's Castles which is nice.",
      "image": "ds-bowsers-castle-ds.webp"
    },
    {
      "id": 155,
      "name": "Rainbow Road",
      "game": "Mario Kart DS",
      "original": "Mario Kart DS",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "2",
      "description": "This Rainbow Road isn't like the others, I feel like the music has a slightly melancholic edge to it. I remember enjoying playing it on the piano but really slow like a ballad. That's how much Rainbow Road has touched me. Driving on this one was so fun because it had a loop-the-loop and a really cool spiral section. A lot to love.",
      "image": "ds-rainbow-road-ds.webp"
    },
    {
      "id": 156,
      "name": "Luigi Circuit",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "2",
      "vibes": "1",
      "track": "1",
      "ranking": "32",
      "description": "I always thought this track was lame, and to this day I do not understand why everyone always picked it when playing online. It's just a plain boring racetrack with nothing.",
      "image": "wii-luigi-circuit-wii.webp"
    },
    {
      "id": 75,
      "name": "Moo Moo Meadows",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "3",
      "vibes": "2",
      "track": "5",
      "ranking": "21",
      "description": "This level is iconic and well-loved by many. In this game it's really giving Moo Moo Farm, a stage I really dislike. The cows are great though. It's just a really great track.",
      "image": "wii-moo-moo-meadows.webp"
    },
    {
      "id": 75,
      "name": "Moo Moo Meadows",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "4",
      "vibes": "5",
      "track": "5",
      "ranking": "33",
      "description": "They took a (in my opinion) mediocre stage from the Wii and made it STUNNING! The morning light and updated look is just so good, and the new music has beautiful strings now. It creates a super special vibe and thus solidifies itself as the best farm-themed level.",
      "image": "mk8-moo-moo-meadows.webp"
    },
    {
      "id": 75,
      "name": "Moo Moo Meadows",
      "game": "Mario Kart World",
      "original": "Mario Kart Wii",
      "music": "3",
      "vibes": "4",
      "track": "4",
      "ranking": "26",
      "description": "I think I'm just really bored of this track by now. They did nothing new with it really, so I'm not excited to drive there in this game. I think it looks worse than the previous game, and the music isn't anything new. More of the same. It's become like a new Mario Circuit.",
      "image": "world-moo-moo-meadows.webp"
    },
    {
      "id": 76,
      "name": "Mushroom Gorge",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "0",
      "vibes": "1",
      "track": "2",
      "ranking": "27",
      "description": "I never liked this stage, mainly because of the ugly music. That flute and synth combo just sounds clown-like and shit. The level looks pretty shit too, and bouncing on mushrooms is not enough to keep me interested.",
      "image": "wii-mushroom-gorge.png"
    },
    {
      "id": 76,
      "name": "Mushroom Gorge",
      "game": "Mario Kart 7",
      "original": "Mario Kart Wii",
      "music": "0",
      "vibes": "1",
      "track": "2",
      "ranking": "29",
      "description": "I've always hated Mushroom Gorge. The music sounds so shit and it looks and is boring as a stage. Mario Kart 7 has taken no steps to improve it.",
      "image": "3ds-mushroom-gorge.jpg"
    },
    {
      "id": 76,
      "name": "Mushroom Gorge",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "0",
      "vibes": "1",
      "track": "2",
      "ranking": "88",
      "description": "They barely remixed the music at all meaning that this music sounds equally as shit as before. And the stage remains boring. There is now a new, blue mushroom to bounce on and that's it.",
      "image": "mk8-mushroom-gorge.jpg"
    },
    {
      "id": 77,
      "name": "Toad's Factory",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "10",
      "description": "This is a classic and a banger! The music is an easy 10/10, it has that wild piano section at the start which is so hard to play on the piano - what key is it even in? And the track just gets wilder as it goes on. For effect, they reset the track when you shoot out of the factory at the end of the lap, but this means that you never hear the whole music track, which is actually tragic. It's also super cool how this track is all about how they make those item boxes. Awesome.",
      "image": "wii-toads-factory.webp"
    },
    {
      "id": 77,
      "name": "Toad's Factory",
      "game": "Mario Kart World",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "9",
      "description": "So happy they brought back this classic from the Wii! It's pretty faithful, and the remixed music is great, and crucially, you can hear the whole track this time! Everything about this track is just excellent.",
      "image": "world-toads-factory.webp"
    },
    {
      "id": 157,
      "name": "Mario Circuit",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "2",
      "vibes": "1",
      "track": "1",
      "ranking": "31",
      "description": "A pretty boring Mario Circuit. Why are there so many of these. This is bringing nothing to the table, only this part with the chain chomp. Better than Luigi Circuit I guess.",
      "image": "wii-mario-circuit-wii.webp"
    },
    {
      "id": 78,
      "name": "Coconut Mall",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "3",
      "description": "This level is a classic! There's so much to enjoy - the escalators changing directions, the multiple paths, the shortcut through the shop, the awkward jumps in the garden area, and most importantly the cars with the miis in them. I have fond memories of my Obama mii smiling at me after running me over at the end of the lap. And the music! The little excited build up at the start and then the ding! So good.",
      "image": "wii-coconut-mall.webp"
    },
    {
      "id": 78,
      "name": "Coconut Mall",
      "game": "Mario Kart 7",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "8",
      "description": "A banger classic from the Wii era. Great music, fun premise. Much the same as the Wii version.",
      "image": "3ds-coconut-mall.webp"
    },
    {
      "id": 78,
      "name": "Coconut Mall",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "13",
      "description": "It's so hype that they brought back this track! It's an absolute classic and it still holds up today. It looks great and they even mixed up the cars at the end with these crazy spin moves that they do. Whatever I'm all for it. The music sounds so good.",
      "image": "mk8-coconut-mall.jpg"
    },
    {
      "id": 79,
      "name": "DK's Snowboard Cross",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "5",
      "description": "Such a fun stage to play on! I love the half pipe at the end when you can hug the walls to go really fast. And I love the two massive crevasses that I always attempt to jump over. The 1% of times that I actually pull it off feel good enough to make up for all the times I fail. The music is also so good! It's way more vibes than DK Pass and features what sounds like K.K. Slider saying '1234' at the start. I don't know if that's real.",
      "image": "wii-dks-snowboard-cross.webp"
    },
    {
      "id": 79,
      "name": "DK's Snowboard Cross",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "20",
      "description": "An excellent upgrade to an already excellent stage! All the random jumps and stuff are equally as fun here as on the Wii. It looks great and has a fantastic soundtrack. So much to enjoy, especially attempting to jump over the massive crevasse.",
      "image": "mk8-dks-snowboard-cross.jpg"
    },
    {
      "id": 80,
      "name": "Wario's Gold Mine",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "3",
      "vibes": "5",
      "track": "5",
      "ranking": "15",
      "description": "Super fun level with insane steep ups and downs! Also a sick shortcut at the end in the mine. Music is alright and I like the vibe a lot.",
      "image": "wii-warios-gold-mine.webp"
    },
    {
      "id": 80,
      "name": "Wario's Gold Mine",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "3",
      "vibes": "5",
      "track": "5",
      "ranking": "30",
      "description": "They made this level look really good! I am a sucker for a sunset though. Now the minecarts are little boosters which make a different kind of vibe in the underground part. You still need to time it right for the shortcut which is fun.",
      "image": "mk8-warios-gold-mine.webp"
    },
    {
      "id": 81,
      "name": "Daisy Circuit",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "1",
      "description": "Potentially my all-time favourite Mario Kart track ever! This music is everything. This is music for going shopping with the girls. It's hopeful and lovely and there is a gorgeous sunset. I just love it. I will always feel happy driving on this course, even if it's pretty simple. It's got the hidden jump in the house, the corner at the end with the pavement. It's just great.",
      "image": "wii-daisy-circuit.webp"
    },
    {
      "id": 81,
      "name": "Daisy Circuit",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "2",
      "description": "I love Daisy Circuit with all my heart! They remixed the music and I couldn't be happier with it. I love the positive vibe of this stage, the sunset of course, and the strange piranha plant cardboard pop-up that obstructs the little staircase in the house that you can drive up.",
      "image": "mk8-daisy-circuit.webp"
    },
    {
      "id": 82,
      "name": "Koopa Cape",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "4",
      "vibes": "4",
      "track": "5",
      "ranking": "13",
      "description": "This course really has everything! The cliffside at the start, then the river, then the underwater bit. This was the bees knees. I love that the music changes for the river and the underwater part, although it's not the best music ever.",
      "image": "wii-koopa-cape.webp"
    },
    {
      "id": 82,
      "name": "Koopa Cape",
      "game": "Mario Kart 7",
      "original": "Mario Kart Wii",
      "music": "3",
      "vibes": "4",
      "track": "5",
      "ranking": "14",
      "description": "Inexplicably, there is no river rapids variation of the song. Why go to the effort of remastering the soundtrack and missing that? They also made the underwater section actually underwater and I'm kinda not cool with that. Still a good track.",
      "image": "3ds-koopa-cape.webp"
    },
    {
      "id": 82,
      "name": "Koopa Cape",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "4",
      "vibes": "4",
      "track": "5",
      "ranking": "32",
      "description": "They remixed the music and this time they did three different variations which is good and proper, and respectful to the original. Good. The underwater bit is still underwater though and I think the original Wii did that better.",
      "image": "mk8-koopa-cape.webp"
    },
    {
      "id": 83,
      "name": "Maple Treeway",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "4",
      "vibes": "5",
      "track": "4",
      "ranking": "8",
      "description": "What a fun and new vibe for a Mario Kart track! I love the colours and the cozy feel. The music is great, and the course has some fun shenanigans to enjoy.",
      "image": "wii-maple-treeway.webp"
    },
    {
      "id": 83,
      "name": "Maple Treeway",
      "game": "Mario Kart 7",
      "original": "Mario Kart Wii",
      "music": "4",
      "vibes": "5",
      "track": "4",
      "ranking": "11",
      "description": "I of course loved Maple Treeway on the Wii but this doesn't bring too much new to the table if I'm honest. With time I've realised I don't love the music as much as I thought I did.",
      "image": "3ds-maple-treeway.webp"
    },
    {
      "id": 83,
      "name": "Maple Treeway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "28",
      "description": "They improved the music with those lush strings so I'm totally sold on this stage now. I think it's a lot of fun and I really enjoy the autumn theme.",
      "image": "mk8-maple-treeway.jpg"
    },
    {
      "id": 84,
      "name": "Grumble Volcano",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "4",
      "description": "So rare to see a lava level that isn't Bowser's Castle! I think this level is an unsung hero from the Wii. People always talk about Coconut Mall this, Maple Treeway that, but never appreciate how much fun Grumble Volcano is. The collapsing track is inspired, and in my opinion actively inspired the direction the series began to go where each lap is different. The music is also so intense! It's so good!",
      "image": "wii-grumble-volcano.png"
    },
    {
      "id": 84,
      "name": "Grumble Volcano",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "17",
      "description": "An underrated banger! This stage's music was SO GOOD on the Wii that they didn't even bother remixing. Honestly, right call. The stage falls apart over time and that adds to the intensity in a major way. It's just a great course!",
      "image": "mk8-grumble-volcano.webp"
    },
    {
      "id": 85,
      "name": "Dry Dry Ruins",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "3",
      "track": "5",
      "ranking": "11",
      "description": "Lowkey the best desert track in Mario Kart ever. The music is catchy and fun, with that stereotypical instrumentation but fuck it it sounds so good. And I love how it changes to this mysterious Egyptian mummy music when you enter the ruins. This stage also changes each lap and features a key mushroom shortcut right before the end. It may not look like much but this stage has so much to offer.",
      "image": "wii-dry-dry-ruins.webp"
    },
    {
      "id": 86,
      "name": "Moonview Highway",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "2",
      "description": "This stage was famous for being super difficult, especially when we were young and shit at drifting. Now I just love it for its immaculate vibes. The stage is split between a country motorway and a bustling city, one is cramped and one is open, it's like two different racetracks in one. The music is so dramatic, I love it. And I love that there are different versions for the two halves of the track.",
      "image": "wii-moonview-highway.webp"
    },
    {
      "id": 86,
      "name": "Moonview Highway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "7",
      "description": "They did a great job of translating this stage into the modern era. It looks stunning and the soundtrack is awesome. I love the switch between countryside motorway and big multi-lane city streets. The clarinet and vibraphone of the city section's music... so good. Vibes off the charts to be honest.",
      "image": "mk8-moonview-highway.webp"
    },
    {
      "id": 158,
      "name": "Bowser's Castle",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "4",
      "vibes": "3",
      "track": "3",
      "ranking": "17",
      "description": "Those opening notes in the song are so amazing!! Such a good intro to the track. Then you arrive in the castle and it changes to a much slower song, which is actually a remix of the melody from Maple Treeway! The stage itself is kinda hard with all the sharp turns and traps.",
      "image": "wii-bowsers-castle-wii.png"
    },
    {
      "id": 159,
      "name": "Rainbow Road",
      "game": "Mario Kart Wii",
      "original": "Mario Kart Wii",
      "music": "4",
      "vibes": "5",
      "track": "5",
      "ranking": "9",
      "description": "This Rainbow Road is giving Mario Galaxy, which makes sense. The music has the gusty garden theme woven in and you can see starbits around the course. I remember it being hard as nails! Very few guardrails to stop you from falling and in some parts the track is not wide at all. But vibes are still excellent and this stage is a total delight to play on. It's dangerous and exciting and I love it.",
      "image": "wii-rainbow-road-wii.webp"
    },
    {
      "id": 159,
      "name": "Rainbow Road",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Wii",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "8",
      "description": "They did an excellent job capturing the original vibe of this track! This rainbow was always more pastel than other ones and that is well represented here. It's so nice to drive on, is still kinda difficult as well. The music sounds excellent with this remix.",
      "image": "mk8-rainbow-road-wii.webp"
    },
    {
      "id": 87,
      "name": "Toad Circuit",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "26",
      "description": "What a plain and boring track. It's got a slowed down version of the otherwise excellent main theme that I really don't fuck with.",
      "image": "3ds-toad-circuit.webp"
    },
    {
      "id": 87,
      "name": "Toad Circuit",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 7",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "95",
      "description": "Such a plain and boring track. The big toads are kinda creepy and otherwise it had nothing. I don't like the music of this stage either.",
      "image": "mk8-toad-circuit.webp"
    },
    {
      "id": 88,
      "name": "Daisy Hills",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "0",
      "vibes": "1",
      "track": "1",
      "ranking": "31",
      "description": "Listening to the Daisy Hills music makes me react so violently that I had to put this so low. I even give this stage a point for sharing some vibes with Bianca Hills from Super Mario Sunshine but that couldn't save it.",
      "image": "3ds-daisy-hills.webp"
    },
    {
      "id": 89,
      "name": "Cheep Cheep Lagoon",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "0",
      "vibes": "0",
      "track": "0",
      "ranking": "32",
      "description": "This music is an insult to Mario beach music. It sounds like an assault on the ears. The steel drums sound terrible and I hate it. If Peach Beach were dead, she would be rolling in her grave (she's back baby!!). This stage is also just a boring circle, meant to show off a meaningless underwater mechanic. One of my least favourite Mario Kart tracks ever.",
      "image": "3ds-cheep-cheep-lagoon.webp"
    },
    {
      "id": 90,
      "name": "Shy Guy Bazaar",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "4",
      "vibes": "5",
      "track": "4",
      "ranking": "9",
      "description": "A rare interesting track from the new levels. I love the Arabian nights vibe! The music is weird but good.",
      "image": "3ds-shy-guy-bazaar.webp"
    },
    {
      "id": 90,
      "name": "Shy Guy Bazaar",
      "game": "Mario Kart World",
      "original": "Mario Kart 7",
      "music": "4",
      "vibes": "5",
      "track": "5",
      "ranking": "3",
      "description": "Wow, they really took the best of the bunch from the 3DS tracks, good for them. They really radically changed this stage to include way more paths and places to do tricks. It really feels like getting lost in a busy market town when you drive through. Sometimes, you get to even drive through a new palace that has been put there, themed after Daisy!",
      "image": "world-shy-guy-bazaar.avif"
    },
    {
      "id": 91,
      "name": "Wuhu Loop",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "4",
      "vibes": "5",
      "track": "5",
      "ranking": "6",
      "description": "Another stunning Wuhu Island track - I love these! Having mario kart tracks which don't repeat 3 times is actually a revolution. It's so fun to just tour around one big mountain and end up where you started. Great level.",
      "image": "3ds-wuhu-loop.webp"
    },
    {
      "id": 160,
      "name": "Mario Circuit",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "1",
      "vibes": "0",
      "track": "0",
      "ranking": "30",
      "description": "This is Toad Circuit but you can go into Peach's Castle. That's the only thing it has. Even that is ridiculous because Peach wouldn't sign that contract unless her name was on the track - why is it even Mario Circuit. I resent that so much that I pushed this one right down to the bottom of the rankings. Such a boring and dumb track.",
      "image": "3ds-mario-circuit-3ds.webp"
    },
    {
      "id": 92,
      "name": "Melody Motorway",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "2",
      "vibes": "4",
      "track": "4",
      "ranking": "20",
      "description": "This is kind of fun with the pianos and xylophones and other instruments. Novel concept and quite fun to play on.",
      "image": "3ds-music-park.webp"
    },
    {
      "id": 92,
      "name": "Melody Motorway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 7",
      "music": "2",
      "vibes": "4",
      "track": "4",
      "ranking": "60",
      "description": "It's quite fun to play on! They made it look nicer here. The dynamic music is still there and sounding great.",
      "image": "mk8-music-park.webp"
    },
    {
      "id": 93,
      "name": "Alpine Pass",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "27",
      "description": "I don't love this track. It's samey and boring. It's meant to show off the flying mechanic but in my opinion it's too much flying. Also why did they call it Alpine Pass in the European version? Do we only understand the 'Alps' and not the 'Mountain'?",
      "image": "3ds-alpine-pass.webp"
    },
    {
      "id": 93,
      "name": "Alpine Pass",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 7",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "87",
      "description": "I don't think this track looks very good at all in this version. It looks plain and generic, and driving it isn't that fun. I don't really like the new remix.",
      "image": "mk8-alpine-pass.webp"
    },
    {
      "id": 94,
      "name": "Piranha Plant Pipeway",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "4",
      "vibes": "4",
      "track": "4",
      "ranking": "16",
      "description": "I enjoy this create take on the Super Mario Bros 1-1 and 1-2 vibes. Reimagining the pipes this way is a lot of fun, and I like the blast through the castle that looks like the NES game at the end. Music is heavy with that slap bass and I'm all for it.",
      "image": "3ds-piranha-plant-pipeway.webp"
    },
    {
      "id": 94,
      "name": "Piranha Plant Pipeway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 7",
      "music": "4",
      "vibes": "4",
      "track": "4",
      "ranking": "46",
      "description": "This stage looks great in this game. I love that this level asks the critical question, what is going on inside those green pipes? Here they are present liked sewers and I like the vibe and the music.",
      "image": "mk8-piranha-plant-pipeway.webp"
    },
    {
      "id": 95,
      "name": "Wario Shipyard",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "3",
      "vibes": "5",
      "track": "5",
      "ranking": "7",
      "description": "This is a fun and wild way to make use of the new driving underwater stuff. You really go up and down a lot! I like it though. It's kind of a different vibe to what we're used to.",
      "image": "3ds-wario-shipyard.webp"
    },
    {
      "id": 95,
      "name": "Wario Shipyard",
      "game": "Mario Kart World",
      "original": "Mario Kart 7",
      "music": "4",
      "vibes": "5",
      "track": "4",
      "ranking": "13",
      "description": "The new vibe of this place is so good! It looks so gloomy and stormy and fun. At first I liked the change from the underwater sections to the riding the waves, but over time I've become frustrated with the waves. Having a few of those sections is fine, but this track is all about how good you are at driving on water. Maybe my opinion will change once I get better at that.",
      "image": "world-warios-shipyard.webp"
    },
    {
      "id": 96,
      "name": "Neo Bowser City",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "3",
      "vibes": "4",
      "track": "4",
      "ranking": "18",
      "description": "Despite the fact that this music literally has Toad's Turnpike in it, this music doesn't spark joy in me. The stage itself, while doing something with the rain, doesn't inspire much delight in me. It's alright, I guess.",
      "image": "3ds-neo-bowser-city.webp"
    },
    {
      "id": 96,
      "name": "Neo Bowser City",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 7",
      "music": "3",
      "vibes": "5",
      "track": "4",
      "ranking": "61",
      "description": "Nice to have such a cool rainy effect! On this and Luigi Circuit on the GBA have rain in them. Otherwise this track is harder than Rainbow Road, there's so much going on and so many serious curves on thin tracks. The music is alright.",
      "image": "3ds-neo-bowser-city.webp"
    },
    {
      "id": 97,
      "name": "Maka Wuhu",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "4",
      "vibes": "5",
      "track": "5",
      "ranking": "5",
      "description": "I love the Wuhu levels! Along with Rainbow Road they are just one long lap! So much to enjoy as you tour the amazing Wuhu island, one of my favourite Nintendo creations. This place just screams Nintendo Wii and I love it. The music is even Wii Sports, which is so good, except it sounds really tinny here. Anyway both Wuhu tracks are great but this one has you jumping off a mountain into the sunset so it's the winner.",
      "image": "3ds-maka-wuhu.webp"
    },
    {
      "id": 98,
      "name": "DK Jungle",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "1",
      "vibes": "5",
      "track": "4",
      "ranking": "17",
      "description": "Wild that they made a track based on Donkey Kong Country Returns! But I like it! I love that game and this vibe is awesome. I wish the music were more of a banger. How could they take such an iconic theme and ruin it like this.",
      "image": "3ds-dk-jungle.webp"
    },
    {
      "id": 98,
      "name": "DK Jungle",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 7",
      "music": "1",
      "vibes": "5",
      "track": "4",
      "ranking": "42",
      "description": "I'm glad this stage for a remake because it looks really great. It makes me want to play Donkey Kong Country Returns! They added an anti-gravity part which is fun. The music remains a bit of a mystery though. Why did they go for this sound? Otherwise they love making super drum-level typically jungle level music so I don't see why they didn't do that here.",
      "image": "mk8-dk-jungle.webp"
    },
    {
      "id": 99,
      "name": "Rosalina's Ice World",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "0",
      "vibes": "3",
      "track": "2",
      "ranking": "28",
      "description": "OK it does look nice and the colours are good, it's nice to have a mystical icy level like this. But I hate it. The music is so horrible like what is even going on. Why is half of Rosalina's observatory just a snowy teepee now. This whole track feels forced.",
      "image": "3ds-rosalinas-ice-world.png"
    },
    {
      "id": 99,
      "name": "Rosalina's Ice World",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 7",
      "music": "0",
      "vibes": "4",
      "track": "3",
      "ranking": "70",
      "description": "Can't bring myself to like this because the music is so weird. I guess it's nice to have a magical icy level like this to mix things up, but it just needs some actual good ice level music to go with it.",
      "image": "mk8-rosalinas-ice-world.webp"
    },
    {
      "id": 162,
      "name": "Bowser's Castle",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "1",
      "vibes": "1",
      "track": "2",
      "ranking": "25",
      "description": "Horrible music, weird design, why are we in a volcano? Why are there underwater parts in the volcano. It's ugly.",
      "image": "3ds-bowsers-castle-3ds.webp"
    },
    {
      "id": 163,
      "name": "Rainbow Road",
      "game": "Mario Kart 7",
      "original": "Mario Kart 7",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "1",
      "description": "I really feel like the team put all their eggs in one basket with this one. One of the very few new 3ds tracks that I genuinely love, this Rainbow Road perfectly continues the tradition, while also creating the series' first track which is different every lap! This paved the way for those city levels and Mount Wario and I love that it just has so much random shit in it. I love the planetary theme, and that the music changes when you're on the moon's surface. It's a fantastic track.",
      "image": "3ds-rainbow-road-3ds.webp"
    },
    {
      "id": 163,
      "name": "Rainbow Road",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 7",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "4",
      "description": "How do they keep coming up with different vibes and styles for all these different Rainbow Roads? This one is very blue and looks stunning. This one also has way more than your average Rainbow Road going on. I'm talking planets, stars, rings, everything. I love how the music calms down for a bit when you land on the moon. I think this might be the best Rainbow Road actually. It's just got everything.",
      "image": "mk8-rainbow-road-3ds.webp"
    },
    {
      "id": 100,
      "name": "Mario Kart Stadium",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "93",
      "description": "If you think about it, this is just the same as Mario Circuit GBA, but that stage has way more vibes than this one. This is a boring stage and the music is also boring.",
      "image": "mk8-mario-kart-stadium.webp"
    },
    {
      "id": 101,
      "name": "Water Park",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "1",
      "vibes": "1",
      "track": "1",
      "ranking": "92",
      "description": "This stage has nothing going for it. Not even the kinda cute underwater version of the music makes up for the fact that this is a boring course, just meant to show off that this game can do underwater too. You don't even notice that you're on the loop-the-loop on the anti-gravity section.",
      "image": "mk8-water-park.webp"
    },
    {
      "id": 102,
      "name": "Sweet Sweet Canyon",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "2",
      "vibes": "3",
      "track": "3",
      "ranking": "77",
      "description": "This isn't too bad. It's gone for a theme and committed to it (unlike you, Choco Mountain) but I don't get too excited about Sweet Sweet Canyon.",
      "image": "mk8-sweet-sweet-canyon.webp"
    },
    {
      "id": 103,
      "name": "Thwomp Ruins",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "5",
      "vibes": "3",
      "track": "3",
      "ranking": "45",
      "description": "This music is pretty special! The B section is this really intense and harmonic section which sounds like it's straight out of Pokemon or Xenoblade. That alone makes me quite like the stage.",
      "image": "mk8-thwomp-ruins.webp"
    },
    {
      "id": 164,
      "name": "Mario Circuit",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "1",
      "vibes": "2",
      "track": "1",
      "ranking": "94",
      "description": "This track is in the shape of a Möbius Strip, which is really cool in theory, but in practice is just one long corner. It makes for boring driving! And because the whole thing in anti-gravity, it feels like it might as well habe not been anti-gravity at all.",
      "image": "mk8-mario-circuit-mk8.webp"
    },
    {
      "id": 104,
      "name": "Toad Harbour",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "2",
      "vibes": "2",
      "track": "4",
      "ranking": "79",
      "description": "I'm asking myself why I like Daisy Circuit so much and find this stage boring in comparison. They share a lot in common. But what can I say, it's the music. This music is alright but it doesn't hit the same. I like the stage though it's quite fun.",
      "image": "mk8-toad-harbour.png"
    },
    {
      "id": 105,
      "name": "Twisted Mansion",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "3",
      "vibes": "5",
      "track": "4",
      "ranking": "50",
      "description": "This stage actually looks so good and is super fun! It's giving Ocarina of Time Forest Temple with its twisting pathways, it has an inexplicable underwater section and the anti-gravity hallway is super cool. The music is very generic spooky music but this is the first time we're getting an original spooky level in a long time and I think they did well.",
      "image": "mk8-twisted-mansion.webp"
    },
    {
      "id": 106,
      "name": "Shy Guy Falls",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "3",
      "vibes": "3",
      "track": "3",
      "ranking": "67",
      "description": "This music is sounding like some South American folky music and is a lot of fun. The stage concept is alright although I wish the shy guys featured more.",
      "image": "mk8-shy-guy-falls.webp"
    },
    {
      "id": 107,
      "name": "Sunshine Airport",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "4",
      "vibes": "4",
      "track": "5",
      "ranking": "25",
      "description": "I've had a lot of fun on this stage over the years. The jumping off the luggage carrier, crashing into the plane wheels, and especially taking off like a plane! They really nailed the vibe of the music for this one, the chords they chose match taking off in the first lap perfectly, and then when you fly down again the music changes to this really cool dreamy section. Great concept and a great course.",
      "image": "mk8-sunshine-airport.webp"
    },
    {
      "id": 108,
      "name": "Dolphin Shoals",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "5",
      "vibes": "4",
      "track": "5",
      "ranking": "41",
      "description": "What a fun level! The music is of course great, with three distinct sounding variations, Koopa Cape style, except arguably better. That sax solo goes crazy in the final part of the lap, love it. And I enjoy the underwater bit with the pipes and the eel that you can spam tricks on.",
      "image": "mk8-dolphin-shoals.webp"
    },
    {
      "id": 109,
      "name": "Electrodrome",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "3",
      "vibes": "4",
      "track": "3",
      "ranking": "64",
      "description": "Did you know that Electrodrome is the only Mario Kart stage to consist of only one word? I really love that piece of trivia. Like why didn't they call it party party pandemonium? I think this stage is fun though.",
      "image": "mk8-electrodrome.webp"
    },
    {
      "id": 110,
      "name": "Mount Wario",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "16",
      "description": "I mean of course this is a top tier track, I love all the 3-laps-in-1 courses! And this one is just a great time, starting at the top of the mountain, going through all these different sections and eventually going on this epic final straight at the end. It's just great! I love the way the music changes as you go down.",
      "image": "mk8-mount-wario.webp"
    },
    {
      "id": 111,
      "name": "Cloudtop Cruise",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "3",
      "vibes": "4",
      "track": "3",
      "ranking": "73",
      "description": "People tlak about this being one of the best new stages but honestly I'm just not feeling it. Like sure the Gusty Garden Galaxy theme works wonders, the switch to electric guitars in the thundercloud, it's good. But I just don't love it as much as I maybe should for some reason.",
      "image": "mk8-cloudtop-cruise.webp"
    },
    {
      "id": 112,
      "name": "Bone Dry Dunes",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "4",
      "vibes": "5",
      "track": "4",
      "ranking": "38",
      "description": "Love this track! I think it's an underrated banger. The music is great, the vibe is a bit different to your standard Dry Dry Desert or something with the sunset, the skeleton versions of piranha plants, the bones everywhere. I think it looks great and I love to come to this track.",
      "image": "mk8-bone-dry-dunes.webp"
    },
    {
      "id": 165,
      "name": "Bowser's Castle",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "4",
      "vibes": "4",
      "track": "3",
      "ranking": "59",
      "description": "Finally some actual banging rock/metal style music for a Bowser's Castle. It's great! This stage is super bombastic, although I will say it's quite light on the weird and wacky obstacles.",
      "image": "mk8-bowsers-castle-mk8.webp"
    },
    {
      "id": 166,
      "name": "Rainbow Road",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "2",
      "vibes": "3",
      "track": "4",
      "ranking": "58",
      "description": "Putting Rainbow Road on a space station is inspired, and I approve the mixup! However at the end of the day, this stage isn't serving that Rainbow Road vibe that I crave. It starts off with a tight figure of 8, which is cool, then you land on a space station, which is cool, then the path splits in two, which is cool. Yet somehow the vibes are off.",
      "image": "mk8-rainbow-road-mk8.webp"
    },
    {
      "id": 113,
      "name": "Excitebike Arena",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "1",
      "vibes": "2",
      "track": "4",
      "ranking": "81",
      "description": "Did you know this stage is randomly generated?? I didn't know that until writing this. It gives me more respect for a track that I originally felt was boring. I guess it is quite fun to do all the jumps! I don't love the music and environment though.",
      "image": "mk8-excitebike-arena.webp"
    },
    {
      "id": 114,
      "name": "Dragon Driftway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "3",
      "vibes": "5",
      "track": "4",
      "ranking": "43",
      "description": "This stage looks super good! Is this the dragon from Yoshi's Story?? I like that it snakes around so much, the curves are satisfying, the music is pretty good. It's all anti-gravity which for me is a bit of a negative because it loses the magic a bit.",
      "image": "mk8-dragon-driftway.webp"
    },
    {
      "id": 115,
      "name": "Mute City",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "6",
      "description": "Yeeeees this stage is super good! The soundtrack goes crazy and the speed is just so fast, just like F-Zero. I love that there aren't any coins, just the purple bars instead. There are constant boosts so you're constantly at max speed. I also like the purple colour scheme.",
      "image": "mk8-mute-city.webp"
    },
    {
      "id": 116,
      "name": "Ice Ice Outpost",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "1",
      "vibes": "1",
      "track": "3",
      "ranking": "75",
      "description": "What is this course meant to be? A roller coaster in Antarctica? It's whole gimmick is having the track constantly split into two, which is quite fun, and there are some seriously tough shortcuts. But I don't like the music or vibe very much.",
      "image": "mk8-ice-ice-outpost.webp"
    },
    {
      "id": 117,
      "name": "Hyrule Circuit",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "2",
      "vibes": "2",
      "track": "3",
      "ranking": "69",
      "description": "I don't feel like this track truly represents Hyrule in the same way Yoshi's Island, Animal Crossing and F-Zero are represented. It has the castle, the chamber of sages, the rupees, the master sword, the sound effect from Skyward Sword and that's about it. Otherwise the track is plain. The music is a rock remix of the main theme and also Zelda's lullaby but it's not blowing my socks off.",
      "image": "mk8-hyrule-circuit.webp"
    },
    {
      "id": 118,
      "name": "Wild Woods",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "5",
      "description": "This stage looks so good! And there's so much going on here. If you look there are the Shy Guys in the tree with their cute treehouses, and then after you get to the bottom of the tree are the toads with their different kinds of houses! I love the lush forest vibe of this stage too, the water rapids, the pond, the twisting branches. They really decided to go super hard on this one! And the music is also pretty out there, Mario Kart's only music in 5/4 time! This feels like Maple Treeway but better in every way.",
      "image": "mk8-wild-woods.jpg"
    },
    {
      "id": 119,
      "name": "Animal Crossing",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "5",
      "vibes": "5",
      "track": "4",
      "ranking": "10",
      "description": "What a fantastic course! It's just four different courses in one! I never get tired of this because it's literally going to take 4 times as many goes before I get bored. I love the music of all the seasons, each one starting with the New Leaf theme but then evolving into a second different theme. The Winter music in particular has a special place in my heart.",
      "image": "mk8-animal-crossing.png"
    },
    {
      "id": 120,
      "name": "Super Bell Subway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "5",
      "vibes": "4",
      "track": "4",
      "ranking": "40",
      "description": "Wow the bass player on this track is going crazy! When you go to the underground part of the course, the slap bass goes ham on that underground theme. Hell yeah. It's fun to drive around the U-Bahn here!",
      "image": "mk8-super-bell-subway.webp"
    },
    {
      "id": 121,
      "name": "Big Blue",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "1",
      "description": "YEEEEES this stage has everything it's so good! You go fast just like in F-Zero, you can jump between different tracks for speed, you are constantly on max speed thanks to the water stream and the boosts and anti-gravity stuff. It's all one big lap which is always super fun. Only problem is it's over too soon! And shoutouts to the music, hell yes. That fast-paced F-Zero music, the best music track from that game by the way, combined with the Mario Kart 8 saxophone? Incredible.",
      "image": "mk8-big-blue.webp"
    },
    {
      "id": 122,
      "name": "Yoshi's Island",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "4",
      "vibes": "5",
      "track": "5",
      "ranking": "19",
      "description": "This stage looks so good! It's so faithful to the Yoshi's Island and full to the brim with fun references. Hyrule Circuit needs to learn from this! I love all the different sections and the special shortcut at the end. The music is great.",
      "image": "mk8-yoshis-island.webp"
    },
    {
      "id": 123,
      "name": "Squeaky Clean Sprint",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart 8 Deluxe",
      "music": "3",
      "vibes": "5",
      "track": "5",
      "ranking": "51",
      "description": "I'm not sure why the music is like Frank Sinatra swing music but that's the situation, we're swinging around a bathroom! Honestly, great concept for a track. I enjoy the wedding ring in the drain, the mechanical cheep-cheeps (what are they doing there?), all the random household objects. Really great that Mario Kart finally has a toilet for us to drive on.",
      "image": "mk8-squeaky-clean-sprint.webp"
    },
    {
      "id": 124,
      "name": "Paris Promenade",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "3",
      "vibes": "4",
      "track": "3",
      "ranking": "63",
      "description": "A rare Mario Kart waltz, only Peach Gardens had ever done it before this. It's good! This stage presents Paris like a very pleasant place, which it isn't. But we can live in the dream for a few laps at least. This stage is a little confusing with all the sharp and changing turns.",
      "image": "mk8-paris-promenade.png"
    },
    {
      "id": 125,
      "name": "Tokyo Blur",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "4",
      "vibes": "2",
      "track": "2",
      "ranking": "72",
      "description": "If it were me designing a course based on Tokyo I would have gone in a more City Pop direction. But this track feels like what I imagine driving to work is like in Japan. The final lap is literally just a motorway. I do like the music a bit but this stage could have been so much more.",
      "image": "mk8-tokyo-blur.webp"
    },
    {
      "id": 126,
      "name": "Ninja Hideaway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "2",
      "vibes": "5",
      "track": "5",
      "ranking": "56",
      "description": "I think this stage is kinda kooky and fun! I'm not too keen on the music but I love how it looks. What is going on with Mario Kart 8's DLC and driving up stairs at ridiculous angles though. That's not how things work! Whatever, there's lots of fun little nooks and crannies and shortcuts here to enjoy.",
      "image": "mk8-ninja-hideaway.webp"
    },
    {
      "id": 127,
      "name": "New York Minute",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "2",
      "vibes": "2",
      "track": "2",
      "ranking": "71",
      "description": "This stage doesn't have too much going on for it in my opinion. I don't like the swing music and the only nice thing about how it looks is the Central Park sections. But even then there's this one part where you can try and mushroom through the trees for a cheeky shortcut, but Lakitu will pick you up for being out of boards! Annoying.",
      "image": "mk8-new-york-minute.webp"
    },
    {
      "id": 128,
      "name": "Sydney Sprint",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "6",
      "vibes": "4",
      "track": "4",
      "ranking": "3",
      "description": "It's Sydney motherfucking Sprint everyone!!!!! I give this track's music and unprecented 6 stars because there is nothing that goes as hard as this!!! My enthusiasm for this course is sky high. We've got the harbour bridge and of course the opera house, it all looks great. It's got some straight streets with things in the way but it's still a fun little stage. Totally carried by the music. I'm obsessed.",
      "image": "mk8-sydney-sprint.webp"
    },
    {
      "id": 129,
      "name": "Sky-High Sundae",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "1",
      "vibes": "0",
      "track": "1",
      "ranking": "90",
      "description": "This level is trying too hard. There's so many bright colours and the concept of flying ice cream is too extreme. The stage is also really weird with the anti-gravity stuff, it seems like impossible physics are at play. Also you drive up stairs which annoys me. And at the end of the day, this stage is just a plain loop. The music is also very questionable. I respect experimental stuff but this is just a little much.",
      "image": "mk8-sky-high-sundae.webp"
    },
    {
      "id": 129,
      "name": "Sky-High Sundae",
      "game": "Mario Kart World",
      "original": "Mario Kart Tour",
      "music": "2",
      "vibes": "4",
      "track": "4",
      "ranking": "16",
      "description": "Talk about a GLOW UP! They really turned things around with this god-awful track. They really plonked a bunch of huge floating ice creams in the open world and brought back Sky-High Sundae. Thankfully, the new mechanics really make this stage way more interesting. The music is better but still baffling.",
      "image": "world-sky-high-sundae.jpg"
    },
    {
      "id": 130,
      "name": "London Loop",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "2",
      "vibes": "2",
      "track": "2",
      "ranking": "78",
      "description": "Music-wise they went for 70s rock which makes sense but I don't love the vibe they went for. Also I find the stage quite plain. Maybe it's because I hate London in real life. Probably.",
      "image": "mk8-london-loop.webp"
    },
    {
      "id": 131,
      "name": "Berlin Byways",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "2",
      "vibes": "5",
      "track": "4",
      "ranking": "48",
      "description": "So wild to play this stage!! Because I cycle through the Brandenburg Gate and past the Siegessäule all the time, and now I can just do it in Mario Kart! Also we go past the East Side Gallery and over the Oberbaumbrücke, which is so close to where I live. Awesome. The stage itself is really hard with all the streets and cars, it's not clear where to go next, especially with it changing every lap. The music is an enigma though. It's a mixture of some kind of techno and like... Mozart? I honestly think it sounds like shit. They should have gone full techno and made the final lap be in Berghain.",
      "image": "mk8-berlin-byways.jpg"
    },
    {
      "id": 132,
      "name": "Merry Mountain",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "2",
      "vibes": "2",
      "track": "1",
      "ranking": "86",
      "description": "Funny to think there was a time when Nintendo straight up avoided talking about Christmas, I'm talking about you Animal Crossing Wild World, and now here we are with Santa's sleigh, this Christmas-ass music and literally Whoville from the Grinch. Well I think this Christmas-ass music is kinda lame and the stage itself is super boring.",
      "image": "mk8-merry-mountain.webp"
    },
    {
      "id": 133,
      "name": "Amsterdam Drift",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "0",
      "vibes": "3",
      "track": "3",
      "ranking": "83",
      "description": "Super cool of them to include driving in the canal, north Amsterdam with the countryside, and the fields of tulips. I'm missing the coffeeshops though. When will weed be canon in Mario Kart? I have to say though, I will never like this stage because of the music. I just think it's terrible. I hate this choir thing they've got going on.",
      "image": "mk8-amsterdam-drift.jpg"
    },
    {
      "id": 134,
      "name": "Bangkok Rush",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "4",
      "vibes": "4",
      "track": "4",
      "ranking": "53",
      "description": "This stage is so fun! There's a lot of nonsense going on. Driving on the water at the start is cool. I like the colours and the vibe. The music is pretty good too.",
      "image": "mk8-bangkok-rush.jpg"
    },
    {
      "id": 135,
      "name": "Singapore Speedway",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "4",
      "vibes": "5",
      "track": "5",
      "ranking": "44",
      "description": "Wow this stage looks so good! I love the swimming pool on the skyscraper roof! I love the chinatown section with the different music. The vibe is expensive hotels and rich people and I'm here for it. It looks like a futuristic paradise. So much to enjoy!",
      "image": "mk8-singapore-speedway.jpg"
    },
    {
      "id": 136,
      "name": "Athens Dash",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "2",
      "vibes": "1",
      "track": "3",
      "ranking": "80",
      "description": "This stage takes place entirely in the ruins of Acropolis which makes it feel like a very ancient city track. But I think it looks kinda shit if I'm honest. The music isn't enough to make up for it.",
      "image": "mk8-athens-dash.webp"
    },
    {
      "id": 137,
      "name": "Los Angeles Laps",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "1",
      "vibes": "1",
      "track": "2",
      "ranking": "82",
      "description": "I imagine Los Angeles to be one of the worst places on earth. Even this racetrack kinda contributes to that imagine with the whole oil rig thing. Otherwise this stage is totally forgettable! The music is a bit different and I appreciate that, but it's not actually good.",
      "image": "mk8-los-angeles-laps.jpg"
    },
    {
      "id": 138,
      "name": "Vancouver Velocity",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "5",
      "vibes": "4",
      "track": "4",
      "ranking": "37",
      "description": "Ironically it's this track, not Tokyo Blur that gets the Japanese fusion funk music. Whatever. I love it. And I love how this stage looks! The wintry city vibe is great, and there's quite a lot of nature for one of these tracks. Not one but two trips to the ice rink, why not. Lots to enjoy, especially that banging music.",
      "image": "mk8-vancouver-velocity.webp"
    },
    {
      "id": 139,
      "name": "Rome Avanti",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "4",
      "vibes": "3",
      "track": "3",
      "ranking": "68",
      "description": "I really like this music! The stage itself it lots of driving on stairs which ruins it for me a bit. I like the cloudy evening atmosphere but it's not what I associate with Italy. They should have done this for London instead. The stage doesn't have too much else to offer.",
      "image": "mk8-rome-avanti.webp"
    },
    {
      "id": 140,
      "name": "Piranha Plant Cove",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "5",
      "vibes": "5",
      "track": "5",
      "ranking": "9",
      "description": "This is like a beautiful underwater sequel to Wild Woods and I love it. It's such a vibe! It changes ever lap and feels a bit like playing Temple Run with all the corners. I feel like I haven't had all the time necessary to discover all of this track's many secrets.",
      "image": "mk8-piranha-plant-cove.webp"
    },
    {
      "id": 141,
      "name": "Madrid Drive",
      "game": "Mario Kart 8 Deluxe",
      "original": "Mario Kart Tour",
      "music": "4",
      "vibes": "2",
      "track": "4",
      "ranking": "49",
      "description": "Great flamenco music!! Very rarely we get flamenco-inspired Nintendo music so we have to soak this up the max, guys. It sounds so good, even the variations for the football stadium and the museum, although the museum is so tiny, what was even the point? Anyway this track is great.",
      "image": "mk8-madrid-drive.webp"
    },
    {
      "id": 142,
      "name": "Mario Bros. Circuit",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "28",
      "description": "Thoughts coming soon...",
      "image": "world-mario-bros-circuit.png"
    },
    {
      "id": 143,
      "name": "Crown City",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "24",
      "description": "Thoughts coming soon...",
      "image": "world-crown-city.avif"
    },
    {
      "id": 144,
      "name": "Whistlestop Summit",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "17",
      "description": "Thoughts coming soon...",
      "image": "world-whistlestop-summit.png"
    },
    {
      "id": 145,
      "name": "DK Spaceport",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "14",
      "description": "Thoughts coming soon...",
      "image": "world-dk-spaceport.webp"
    },
    {
      "id": 146,
      "name": "Starview Peak",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "12",
      "description": "Thoughts coming soon...",
      "image": "world-starview-peak.jpg"
    },
    {
      "id": 147,
      "name": "Faraway Oasis",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "20",
      "description": "Thoughts coming soon...",
      "image": "world-faraway-oasis.jpg"
    },
    {
      "id": 148,
      "name": "Peach Stadium",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "27",
      "description": "Thoughts coming soon...",
      "image": "world-peach-stadium.avif"
    },
    {
      "id": 149,
      "name": "Salty Salty Speedway",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "21",
      "description": "Thoughts coming soon...",
      "image": "world-salty-salty-speedway.png"
    },
    {
      "id": 150,
      "name": "Great ? Block Ruins",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "10",
      "description": "Thoughts coming soon...",
      "image": "world-great-block-ruins.jpg"
    },
    {
      "id": 151,
      "name": "Cheep Cheep Falls",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "15",
      "description": "Thoughts coming soon...",
      "image": "world-cheep-cheep-falls.png"
    },
    {
      "id": 152,
      "name": "Dandelion Depths",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "8",
      "description": "Thoughts coming soon...",
      "image": "world-dandelion-depths.jpg"
    },
    {
      "id": 153,
      "name": "Boo Cinema",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "6",
      "description": "Thoughts coming soon...",
      "image": "world-boo-cinema.jpg"
    },
    {
      "id": 154,
      "name": "Dry Bones Burnout",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "5",
      "description": "Thoughts coming soon...",
      "image": "world-dry-bones-burnout.webp"
    },
    {
      "id": 155,
      "name": "Bowser's Castle",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "11",
      "description": "Thoughts coming soon...",
      "image": "world-bowsers-castle.jpg"
    },
    {
      "id": 156,
      "name": "Acorn Heights",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "18",
      "description": "Thoughts coming soon...",
      "image": "world-acorn-heights.jpg"
    },
    {
      "id": 157,
      "name": "Rainbow Road",
      "game": "Mario Kart World",
      "original": "Mario Kart World",
      "music": "",
      "vibes": "",
      "track": "",
      "ranking": "7",
      "description": "Thoughts coming soon...",
      "image": "world-rainbow-road.png"
    }
  ]
}
