[
    {
        "unmasked": "beach.jpg",
        "description": "Victor took me to Mallorca where he grew up and it was a 10/10 holiday. We visited no fewer than 5 different beaches, all of them staggering, putting even the beaches I saw in Mexico to shame. Pictured here is the most cartoonishly beautiful one of all. Together we walked through the heat for almost two hours with Marlo here and finally arriving was so exciting. The water was so clear that you can see the fish swimming around! Most importantly, Marlo had a moment where she was so distressed that Victor and I had left her on the beach to go swim that she had to swim out to us and rescue us. She's so brave!",
        "answer": [
            "Mallorca",
            "Spain"
        ],
        "id": "0b432e75-98c6-4f3a-83cf-da3f9a63ed8a"
    },
    {
        "unmasked": "verweile.jpg",
        "description": "Victor sings in a choir! I went to deep Brandenburg to see them perform in a church. Victor is pictured here looking stunning in amongst all the Germans. Pictured is also the accordion player, who I quickly identified as the weak link. It's a shame because they were singing an absolute banger 'Libertango' by Astor Piazzola. The title of the concert was this Goethe quote which I found to be so bewildering.",
        "answer": [
            "Victor",
            "Víctor",
            "Víctor's Choir",
            "Victor's Choir",
            "Collegium Aurinum"
        ],
        "id": "8077001d-ffa4-441a-9369-4f5379221b4e"
    },
    {
        "unmasked": "da2a1704-98be-4048-a7bd-6e1a456cf94d.jpg",
        "description": "Wolf organised a little painting date with me and Simon, and I was looking after Marlo that weekend, so I brought her along! Both Wolf and Marlito are looking splendid in this photo. I used the opportunity to do something I've been meaning to do for a while: paint two matching pictures of one of my favourite pokemon: Bruxish.",
        "answer": [
            "Marlo",
            "Marlito",
            "Wolf",
            "Vilhelm"
        ],
        "id": "da2a1704-98be-4048-a7bd-6e1a456cf94d"
    },
    {
        "unmasked": "belch.jpg",
        "description": "Anni blew me away by making (!) this flower out of beads and wire. For months I was stumped about what to do with it. I wanted to honour it with a place of honour in my apartment. I started by buying this vitrine, which I will use to display ugly things (I love ugly things). The thing is, the flower isn't ugly. Unrelated to all of this, I had been meaning to forge a closer relationship with my ceramicist friend Renné. Turns out she was offering beginner workshops and I was more than happy to throw my money at her if it meant that we could chat about boys and make cool ceramics together. In the end I decided to honour Anni's flower by making a pile of sentient toxic sludge! It's loosely based on Master Belch from Earthbound or maybe the pokemon Grimer. I'm so proud of it.",
        "answer": [
            "Ceramic",
            "Ceramics",
            "Clay"
        ],
        "id": "613617ce-f45b-4628-bced-ab1a9ead9058"
    },
    {
        "unmasked": "45c1b2ed-892d-46a2-afe6-782c15001e4d.jpg",
        "description": "My friend Sam put on a party where the theme was bobs! Pictured here is Victor, sorry I mean Christine who looks great in her bob. For the day I became Stella, but I didn't look as good as her. Impressively, a good 70-80% of attendees had bobs, and it was so easy to be sociable and outgoing because you could start every conversation with 'Hey, nice bob!'",
        "answer": [
            "Bob",
            "Bobs",
            "Bob Hairstyle"
        ],
        "id": "0b432e75-98c6-4f3a-83cf-da3f9a63ed8a"
    },
    {
        "unmasked": "5fff695e-0f26-4d20-9cad-fca2534de95b.jpg",
        "description": "Our friends Marta and Víctor asked us to commentate their kicker tournament, which we immediately said yes to. When the day came, it hit Diego and I that we had to entertain a whole crowd for like 3 hours! The event went super well thankfully. One highlight for me personally was being able to set up a projection of the table on the wall using a combination of my streaming skills from smash and Diego's shibari skills - he hung the webcam from the ceiling, pointing it down at the table! And on the day we set it up and it just worked! That is the power of friendship right there.",
        "answer": [
            "Dick"
        ],
        "id": "539bc807-cec8-4212-820a-0c10a3feff55"
    },
    {
        "unmasked": "a9809a2f-711b-4400-8923-9b1619bd5a86.jpg",
        "description": "We threw a big party at Mauersegler! This time I was the one responsible because it was my birthday, which meant that I got loads of attention, which I loved. I wore a dress for the first time in my life and kinda enjoyed it. I made sashes for everyone so we could all be beauty pageant queens, because I made the theme of the party 'World Peace' and 'Disco'. Not easy themes to work with but the people came through and it was a huge success!",
        "answer": [
            "World Peace",
            "Disco",
            "Disco and World Peace",
            "World Peace and Disco"
        ],
        "id": "c8d5da29-b4f4-4bf0-9fe7-730f9dd0e43a"
    },
    {
        "unmasked": "choir.jpg",
        "description": "For the second time, Diego prepared an insane trip to the Philharmonie to listen to some beautiful choral music while we took mushrooms. Somehow I'm always tripping when I'm in this place. At first, like 10 individual choirs came and sang one song each for us, which was everything: funny, shocking, dramatic, culturally insensitive. Then after the break, all the choirs came together and sang - 400+ people! They filled up most of the seats in the room already. It was insane. This totally shut us up as our eyes glazed over in a trance. A very special moment.",
        "answer": [
            "Mushrooms",
            "Drugs",
            "Psychedelics",
            "Diego",
            "Shrooms"
        ],
        "id": "838d91a1-310e-47a0-8506-c5f7cd3c621f"
    },
    {
        "unmasked": "88fcf26d-cd4c-45da-a2a4-41497f2aff6a.jpg",
        "description": "We were invited to DJ at this really cool weekend away in Sachsen! Everyone there had jobs like cooking, operating the sauna, putting on workshops etc. Jack famously put on a workshop about putting stuff up your butt. My job was to decorate the dancefloor which was a huge success! It was a great bonding experience for WEYES. There is not much photo evidence of the weekend's shenanigans because of the lack of phones but here's a photo of a printed out picture from an analog camera of me and Jack looking cute. This was also the first outing of my new moustache.",
        "answer": [
            "Phones",
            "Digital Camera",
            "Digital Cameras",
            "Phone",
            "Handy",
            "Cellphone",
            "Mobile Phone",
            "Smartphone",
            "Smartphones"
        ],
        "id": "f6b4dad7-2b9e-417f-8923-931222d73e1e"
    },
    {
        "unmasked": "tea.jpg",
        "description": "Víctor and I took half a tab of acid and enjoyed the wonders of the Botanischer Garten! It was so good. We found a tree who didn't have any branches, she just became a single long branch. Feeling inspired, we decided to go into Steglitz where we ate at a chinese restaurant. They sold flower tea and I mean look at it, it's gorgeous. We felt like children giggling in the corner of the restaurant and ogling at the tea and it was great",
        "answer": [
            "Acid",
            "LSD",
            "Trip"
        ],
        "id": "18b245ab-66eb-49e2-b51b-c5bc31d748d5"
    },
    {
        "unmasked": "beyonce.jpg",
        "description": "When I returned from being away for 6 weeks, I was always worried about my fish, but I knew they would be fed well because my neighbour Fab was looking after them while I was gone. However, I didn't tell him to change the water, and when I finally arrived home, the stench of death was evident from the Treppenhaus already. It was horrible, the algae had completely taken over the tank, water completely opaque, and the fish corpses floating on the top. I was feeling delusional because I hadn't slept on the transatlantic flight, but I still made this gravestone and put them to rest, and cleaned out the whole aquarium. All the shrimp went too. A dark day",
        "answer": [
            "Fish"
        ],
        "id": "061565bf-feb3-4588-91ee-db4f51744e13"
    },
    {
        "unmasked": "d316b419-0271-41cb-9f76-5111de2a2d79.jpg",
        "description": "I always keeping an eye open for arcade machines when I'm Mexico not only to drop everything and challenge Jack to a game of King of Fighters (which they always won and yes I am still bitter), but also to find any weird shit, like this machine which had a bunch of emulated gamecube and wii games on it. We paid a couple of pesos and had 5 minutes in Smash Melee, which was just about enough to destroy Jack with melee Peach, even though I was unable to do any float cancels with the joystick",
        "answer": [
            "Smash",
            "Super Smash",
            "Super Smash Bros",
            "Smash Ultimate",
            "Super Smash Bros. Ultimate",
            "Ultimate"
        ],
        "id": "df5f4915-036d-4617-beb5-54208e4ec4a1"
    },
    {
        "unmasked": "09c111cd-0fc7-40ec-9240-24e3945b480b.jpg",
        "description": "Jack and I were killing time in Córdoba, Veracruz when we were approached by a lovely man who gave us like a 3 hour tour of the archeology museum, which was so good. We asked a ton of questions and showed a ton of interest, so much so that at the end he let us see his office, pictured here. He had all these shelves of pieces that needed to be registered and getting that insider look was just so fucking cool",
        "answer": [
            "Mexico"
        ],
        "id": "d0c5d41a-2297-4adf-8a89-a83c0f5c05a7"
    },
    {
        "unmasked": "b90a3cc0-f68d-48c4-a004-9742999b08cd.jpg",
        "description": "Playa Colomitas in Puerto Vallarta with a certain someone. Not only was the day beautiful, the hike beautiful and the beach beautiful, but we also had an amazing moment at this beach. It started to rain, so everyone got into one of the lancha boats you can see in the picture. Everyone struggled, fell inside unceremoniously, or needed to be helped by the driver. We were the last to enter, and although I was nervous, I just went for it and hoisted myself in. By some miracle, I did a perfect flip and landed on the seat so smoothly that people behind me were audibly impressed. Then the cute boy featured in the picture comes up, passes me his shoes and bag then does an equally impressive twist into the boat right next me, then gives me a little kiss. Everyone on the boat cheered!",
        "answer": [
            "Arturo"
        ],
        "id": "51991cee-2097-4555-a168-37774d7707d6"
    },
    {
        "unmasked": "sam.jpg",
        "description": "I was so happy to be invited to Mathis' birthday where the theme was just to wear your best outfit, so I did! I wore the Trousers in combination with this matching-colour jacket I found at Humana and although I knew it was a pretty out-there outfit, I felt right at home at the party. I even won a prize!",
        "answer": [
            "Berlin"
        ],
        "id": "d2d941a3-73c7-48b5-b4a0-c5ee771cd237"
    },
    {
        "unmasked": "lickilicky.jpg",
        "description": "When I played Pokemon Brilliant Diamond, a disappointment of a game, I did take joy finding a Lickitung in the underground area. I had forgotten just how ugly that pokemon is, and if you know me well, you'll know that I love ugly pokemon the most. Then in the game, it evolved into Lickilicky and I was absolutely blown away by how ugly it is. I became obsessed - why does it have Wifi on its belly? Why is its tongue like that? I even painted a picture of Lickilicky for my house where it says, 'I choose you, Lickilicky!'. So when I saw this keychain right next to Pikachu and Charmander, I almost had a heart attack. Lickilicky was just there. Anyway I bought it and now it's my official DJ USB decoration, here pictured with Filthy Dog",
        "answer": [
            "A Pokemon",
            "Pokemon",
            "Pokémon",
            "ugly",
            "beautiful",
            "wifi"
        ],
        "id": "23a3dd20-ccbb-4ac7-9a83-a29c47c6de37"
    },
    {
        "unmasked": "faf9465e-5592-4493-8e73-95ff8da0f93a.jpg",
        "description": "I put on a new tournament at the Xperion Centre called Clash of Titans and it was a big success! This is a great pic of me and Jack commentating together in German, but my favourite memory from this day was Jack & Diego commentating together, Diego taking it all seriously and Jack just interrupting him to say 'Stunning!' just because Bayonetta is on the screen",
        "answer": [
            "Smash Tournament",
            "Tournament",
            "Smash",
            "Commentary",
            "Super Smash Bros Tournament",
            "Clash of Titans",
            "Xperion"
        ],
        "id": "3d5267c7-3d05-43e3-88b3-b8cd1461eaa4"
    },
    {
        "unmasked": "058d80dd-2643-4c05-b262-3fce5c512e4d.jpg",
        "description": "Ah, the experience of getting close friends who are noobs at video games to play smash, I love it. For the record, these two picked Olimar and Villager as their characters, which for me is a massive indication of how cool they are. Photo was taken at Whole Festival",
        "answer": [
            "Peach",
            "Princess",
            "Princess Peach",
            "Duck Hunt",
            "Duck Hunt Duo"
        ],
        "id": "30fcbad1-b9b5-41b5-9b81-4fc44b6df021"
    },
    {
        "unmasked": "claudia.jpg",
        "description": "A major WEYES event in Hasenheide. Highlight for me was Claudia wearing the Little Mac colours and doing this great light show. I got this picture of her that I really like",
        "answer": [
            "Weyes"
        ],
        "id": "9f9762ea-a7d8-411f-b895-ef705e7d8fd1"
    },
    {
        "unmasked": "quiz.jpg",
        "description": "This was peak Epitech, I got loads of attention and everything went smoothly. I put on a side event where the nerds have to guess what video game music I'm playing from a speaker, it's called Fraser's Crazy Music Quiz. Kitty Ort and Diego were watching me having my moment enthusiastically entertaining all the smash nerds and talking about one of my favourite topics",
        "answer": [
            "Epitech",
            "Epitech Chase"
        ],
        "id": "141f645e-024c-407d-a223-fdf8a058c146"
    },
    {
        "unmasked": "bday.jpg",
        "description": "For my birthday I asked all my friends to come over in their tackiest outfit, loved it. People really came through. We also did powerpoint karaoke, where Lauren smashed Jack's presentation about Liz Truss. 'Short for Lizard' still makes me chuckle whenever I think about it. In this picture I was forced to present Fab's work presentation about programming",
        "answer": [
            "Birthday",
            "Your birthday",
            "My birthday",
            "31st"
        ],
        "id": "e19d67a8-b607-4e23-b16a-30c7f346d76b"
    },
    {
        "unmasked": "planet.jpg",
        "description": "For Diego's space themed party, Jack and I sat together to make a centrepiece decoration for it, a huge planet that would hang in the middle of the dancefloor. It was a total success and we called it the Jack and Fraser Unity Planet, and it includes this fun human eye on it. Now it hangs ominously in the corner of my room",
        "answer": [
            "Diego"
        ],
        "id": "9c080a26-58a3-4b34-9194-e4a9d1f1bbf9"
    },
    {
        "unmasked": "mushroom.jpg",
        "description": "Diego got us all tickets to see this insanely wild choir, and we all went while high on mushrooms. We arrived late and Diego bless him was very anxious about not making it to our seats in time because there's no possibility to get in after they close the doors. Instead of being helpful in anyway I suggested a group photo. I dunno I was just feeling so chill, which is why I at least stopped to pose for this photo. I was high as balls though",
        "answer": [
            "Mushrooms",
            "Magic mushrooms",
            "Shrooms"
        ],
        "id": "210b4390-e8ac-4970-81fb-b78fcdf4fd71"
    },
    {
        "unmasked": "5f9f96d0-b83e-48d1-aceb-32ceb22a57f0.jpg",
        "description": "I was invited to stay with Josue's best friend's family in Córdoba, Veracruz and it was so fun! I felt like a part of the family, which in Mexico is a real thing. In this photo we are making tamales, some chicken & salsa verde and the others chocolate (!) tamales no less",
        "answer": [
            "Mexico"
        ],
        "id": "32df7aee-0cb0-48d1-b316-c967d7f13f6e"
    },
    {
        "unmasked": "f68fa6f7-1b05-46b1-8840-f9a21e87951a.jpg",
        "description": "We were told to get the tower, and that's what we did. Hell yeah. Aguachiles for days, and covered in the most acidic sauce you can imagine. Might be a top 10 lifetime meal. While waiting for this we bought two rugs from someone walking by (the yellow one in my living room is from here!)",
        "answer": [
            "Mexico City",
            "Ciudad de México",
            "La Ciudad de México",
            "CDMX",
            "Ciudad de Mexico"
        ],
        "id": "b209916e-720c-4b9c-99d6-66af6a66826d"
    },
    {
        "unmasked": "dj.jpg",
        "description": "This was my second ever outing as DJ World Peace. It was at Jack's party and it was a huge success! Clarer made this peace sign because I lost the one I made on the way there, which made me so happy",
        "answer": [
            "DJ World Peace",
            "DJWP"
        ],
        "id": "e79a70d2-8a0e-4dc3-9715-063059945ead"
    },
    {
        "unmasked": "bath.jpg",
        "description": "My mate Oscar got married in this fancy house in the countryside. One highlight for me was this insane standing bath that was just available in this weird hallway room. I immediately got in and I was spotted by Oscar soon after because there were no locks. Yes I was playing switch in the bath, I have no fear",
        "answer": [
            "Switch",
            "A Switch",
            "A Nintendo Switch",
            "Nintendo Switch",
            "Nintendo"
        ],
        "id": "a39debff-93e0-4f3d-9f87-85a6230088ad"
    },
    {
        "unmasked": "fish.jpg",
        "description": "These fish were so great. It was really hard to get them all in a shot so you just have this pic here. But there were six: Alicia Keys, Mary J. Blige, Aaliyah, Sade, Janet Jackson and Diana Ross. Mary J Blige was a total bully and is in my opinion responsible for the death of Sade, who was forced to cower behind the filter whenever Mary went on her biting rampages. In the end though it was Alicia Keys who was the final fish to stay alive. I wonder if Mary J Blige ever thinks about the consequences of her actions down in fishy hell",
        "answer": [
            "Alicia Keys",
            "Mary J. Blige",
            "Aaliyah",
            "Sade",
            "Janet Jackson",
            "Diana Ross"
        ],
        "id": "86b7ac0c-4bf9-4182-b46e-a051fd28c6f8"
    },
    {
        "unmasked": "tie-dye.jpg",
        "description": "When Ort Diego and I met up to tie-dye a bunch of things so we could have some great party outfits, I also decided to dye some underwear. I figured that dying them with yellow would be a great idea since that's my favourite colour, but it turns out it just looks like piss. When I wore them it looked like I pissed myself. Lesson learned",
        "answer": [
            "Yellow"
        ],
        "id": "edd3cf8e-d8e2-4714-a387-6b9e0fdad5a2"
    },
    {
        "unmasked": "phenomenon.jpg",
        "description": "I was flying back from Mexico experiencing the horror which is transatlantic flights, and unable to get to sleep I was in a daze. Vielleicht hatte ich einen besonderen Brownie gegessen. When I opened my eyes, the whole sky was pink, even the sun itself and I swear for like 10 full minutes I was fully convinced that I was witnessing a one-in-a-lifetime sky phenomenon. I woke up Emma, who with an incredible stroke of luck, booked the same flight and we ended up right next to each other, and she was like, Fraser it's just a filter they put at night so people can sleep. I was so embarrassed",
        "answer": [
            "Aeroplane",
            "Plane",
            "Flight"
        ],
        "id": "f1a6baad-2a78-4f08-9f94-b6d9239f66eb"
    },
    {
        "unmasked": "586748c8-ed6c-4f62-a045-67dd750f1275.jpg",
        "description": "Having given up alcohol, I had always dreaded ordering drinks in bars, because there's nothing actually good that isn't alcoholic. The real killer was fruit juice. When I think about ordering an apple juice in Germany I think about those small glass bottles with processed juice and added sugar. Then I went to Mexico, pictured here on a Grindr date, and I reluctantly ordered a papaya juice and it rocked my world. The guy just juiced a papaya right in front of me, put in a spoonful of sugar, mixed it and gave it to me and it was fucking delicious. My favourite Mexican food is genuinely just fruit",
        "answer": [
            "Jugo"
        ],
        "id": "821fd504-7842-49de-9ba7-595b7958266f"
    },
    {
        "unmasked": "bouldering.jpg",
        "description": "I wish I liked bouldering, genuinely. If I did, I would be so buff by now. But alas, scared of heights and don't like it when my fingers hurt. I've been known to go for social reasons, and in this picture I went in order to impress this guy Chris I was dating. He ended up ghosting me after this so I guess I did not successfully impress him",
        "answer": [
            "Bouldering",
            "Climbing"
        ],
        "id": "c2dbd95f-9ebf-41fa-8c23-1b2838246acf"
    },
    {
        "unmasked": "brexit.jpg",
        "description": "I used to invite people from the internet to my house every wednesday to play a 16-man bracket, and it was great. It was an awesome period of history, especially during a time when there were no tournaments in Berlin. As a human being I am very reliable and find myself unable to flake, even if that means not looking after myself. This resulted in me hosting these things even when I really didn't want to. In this picture I was actually ill, and people still came over. I just lay down in my bedroom and waited for it to all be over",
        "answer": [
            "BREXIT SUMMIT"
        ],
        "id": "f91ca037-6f79-4dd8-849b-3233def1c1fc"
    },
    {
        "unmasked": "film.jpg",
        "description": "Can you believe actual professional film-maker Dr.Puppet came to my house to set up lights and actual equipment to film interviews? And then the video was never released!! I'm still bitter about it. As visitors of this website know, I love attention, so a full half hour interview was like a dream, and I didn't even have to leave the house. He was filming a smash documentary, and my tournament series BREXIT SUMMIT was going to feature in it. Maybe one day that footage will see the light of day, but I doubt it",
        "answer": [
            "BREXIT SUMMIT",
            "Smash tournament",
            "Smash tournaments",
            "My tournaments",
            "Your tournaments"
        ],
        "id": "0733f059-b7c3-4443-8838-1126aad4c12f"
    },
    {
        "unmasked": "newyear.jpg",
        "description": "When I returned from the UK after Christmas, they had placed UK on the red list and I had to go into isolation for two weeks, which stretched through new years. Instead of celebrating new years with friends, which is one of my favourite things, I thought to myself, this is an opportunity to enjoy the new years content in Animal Crossing and boy do I REGRET IT! I should have broken the law and gone out on that night because I was MISERABLE! All the fireworks were going off and I just felt huge FOMO. I remember taking a midnight bath and just crying in the bath because I was so sad",
        "answer": [
            "Pandemic",
            "Covid",
            "Covid-19",
            "The Pandemic",
            "Corona",
            "Coronavirus",
            "Lockdown",
            "Isolation"
        ],
        "id": "2898d3b0-221c-420f-a44d-b4939e836a50"
    },
    {
        "unmasked": "vier.jpg",
        "description": "Look at this insane photo they took of me at VIER. I had my hair done the day before the photo shoot so that hairdye is fresh. I loved having my hair like this for so long, it made me feel so special. What I really enjoyed about this photo is how much it looks like a stock photo. Have to say I didn't love working at VIER though. Looking back, I could have had it so much better if I left that job earlier",
        "answer": [
            "VIER"
        ],
        "id": "ca46b076-3b19-43de-a63e-1384b9633e69"
    },
    {
        "unmasked": "como.jpg",
        "description": "The spicy gingers consists of me Kitty Lauren and Michael, and I even made badges for us. That all happened because in a not-drinking-alcohol moment I ordered a spicy ginger at a bar after literally everyone else got beer and it became a thing. Anyway we went to beautiful lake Como in Italy and that local produce is so delicious. In this picture, Jack is showing off. They made themself the goal of doing a headstand on a paddleboard and they followed through on it",
        "answer": [
            "Lake Como",
            "Como",
            "Italy"
        ],
        "id": "b9ad6c78-040f-44de-a4dd-1d00d9b92f01"
    },
    {
        "unmasked": "surfing.jpg",
        "description": "I met Chelsea in 2019 and she ended up being the reason why I got to know Lauren and many other friends, so I am grateful to her for that. But she was famous for breaking up with friends out of the blue. We were outraged and bewildered when she did it after Jack innocently asked how her surfing trip to Portugal was going, so much so that I decided to stitch this piece of art to immortalise the moment. She's a crazy a bitch",
        "answer": [
            "Chelsea"
        ],
        "id": "9d7c1601-7744-45d1-b02e-fa55b1c283d4"
    },
    {
        "unmasked": "commentary.jpg",
        "description": "Imagine my delight when the venue that we organised for our smash tournament told us they booked a drag queen for our event, because it happened to be on the day of CSD! Back then I was an up-and-coming commentator and so I volunteered to do the commentary, and then I learned she would commentate with me! Even though she knows nothing about the game. I was shitting myself because it was the first time I ever did it in German, but it was so good. She was iconic and it was so funny. She made constant sexual innuendos and was thoroughly entertained by Wario eating his own motorbike so he can fart quicker",
        "answer": [
            "Commentary",
            "Commentating",
            "Moderating",
            "Hosting",
            "Moderation"
        ],
        "id": "92ca7792-ba59-4393-b2e3-a3a1d9f0da7c"
    },
    {
        "unmasked": "boris.jpg",
        "description": "As a thank you for hosting 10 BREXIT SUMMITs, the smash community got me this Boris cut-out and it is a funny present, given I was really giving speeches about politics before each of these tournaments. I understand how people associated me (with my tag BREXIT) to him during this time when he was PM, but god it means I have this thing that I can't really throw away just in my house. He is currently hidden somewhere so I don't have to look at him. In this picture he is sitting on my beautiful orange sofa which was with me for a long time. I drove this thing across the country and I loved it so much",
        "answer": [
            "Boris",
            "Boris Johnson"
        ],
        "id": "6d7e0a7a-b595-4499-9a8a-453fc2f23435"
    }
]
