{
  "mixes": [
    {
      "filename": "animal_crossing_wild_world_mix.mp3",
      "name": "Animal Crossing Wild World Mix",
      "description": "This is a collection of all the hourly themes from this classic Animal Crossing soundtrack. It starts in the night time, so get excited for those unique cozy nighttime vibes"
    },
    {
      "filename": "animal_crossing_new_leaf_mix.mp3",
      "name": "Animal Crossing New Leaf Mix",
      "description": "Animal Crossing New Leaf really changed the vibe when it comes to the hourly themes. Richer, more lush, the loops twice as long. A special kind of vibe that we must cherish"
    },
    {
      "filename": "arms_mix.mp3",
      "name": "ARMS Mix",
      "description": "Lowkey ARMS has a great soundtrack. That legendary main theme and the various stages are all represented in this mix. Credits theme also a banger"
    },
    {
      "filename": "cadence_of_hyrule_mix.mp3",
      "name": "Cadence of Hyrule Mix",
      "description": "The moment I heard the Tal Tal Heights theme in the Cadence of Hyrule trailer I jizzed my pants. Then I learn that the main overworld theme is an incredible four minute loop combining four different classic zelda overworld themes? I had to make a mix. There are a ton of other great classic tracks, but also original tracks. I admit, having listened to this mix a bunch I kind of regret putting in the original dungeon themes. With the exception of Hyrule Castle I don't think they really slap like the other ones"
    },
    {
      "filename": "celeste_mix.mp3",
      "name": "Celeste Mix",
      "description": "Beloved indie darling Celeste deserves its own mix. Of course you can just listen to the original soundtrack on Spotify but I wanted to have the tracks transition into each other nicely and that's exactly what this is. Looking back I actually prefer the Farewell DLC music more, and that sadly isn't present in this mix"
    },
    {
      "filename": "dandara_mix.mp3",
      "name": "Dandara Mix",
      "description": "Dandara is an obscure indie game that I loved with a mind-blowing soundtrack. About 5 minutes into this mix is the incredible boss theme. Let it bless your ears and then get blown away by the FINAL boss theme at the end. Holy moly"
    }
  ]
}
