{
  "mixes": [
    {
      "filename": "animal_crossing_wild_world_mix.mp3",
      "name": "Animal Crossing Wild World Mix",
      "description": "This is a collection of all the hourly themes from this classic Animal Crossing soundtrack. It starts in the night time, so get excited for those unique cozy nighttime vibes",
      "id": "ae6b2b43-7eaa-48be-9f8c-dd9bdf497ddf"
    },
    {
      "filename": "animal_crossing_new_leaf_mix.mp3",
      "name": "Animal Crossing New Leaf Mix",
      "description": "Animal Crossing New Leaf really changed the vibe when it comes to the hourly themes. Richer, more lush, the loops twice as long. A special kind of vibe that we must cherish",
      "id": "9fcedd11-9fa9-4abb-ae22-c31182d88529"
    },
    {
      "filename": "arms_mix.mp3",
      "name": "ARMS Mix",
      "description": "Lowkey ARMS has a great soundtrack. That legendary main theme and the various stages are all represented in this mix. Credits theme also a banger",
      "id": "ed10254b-aa05-4a7e-9f98-f0522ef10e03"
    },
    {
      "filename": "cadence_of_hyrule_mix.mp3",
      "name": "Cadence of Hyrule Mix",
      "description": "The moment I heard the Tal Tal Heights theme in the Cadence of Hyrule trailer I jizzed my pants. Then I learn that the main overworld theme is an incredible four minute loop combining four different classic zelda overworld themes? I had to make a mix. There are a ton of other great classic tracks, but also original tracks. I admit, having listened to this mix a bunch I kind of regret putting in the original dungeon themes. With the exception of Hyrule Castle I don't think they really slap like the other ones",
      "id": "4a283b2f-8056-4201-8f55-e2a63b88578a"
    },
    {
      "filename": "celeste_mix.mp3",
      "name": "Celeste Mix",
      "description": "Beloved indie darling Celeste deserves its own mix. Of course you can just listen to the original soundtrack on Spotify but I wanted to have the tracks transition into each other nicely and that's exactly what this is. Looking back I actually prefer the Farewell DLC music more, and that sadly isn't present in this mix",
      "id": "3dd973cc-428d-4f81-a511-30abc0685406"
    },
    {
      "filename": "dandara_mix.mp3",
      "name": "Dandara Mix",
      "description": "Dandara is an obscure indie game that I loved with a mind-blowing soundtrack. About 5 minutes into this mix is the incredible boss theme. Let it bless your ears and then get blown away by the FINAL boss theme at the end. Holy moly",
      "id": "f8204e96-8adf-4df3-a07e-7266810dab15"
    },
    {
      "filename": "desert_mix.mp3",
      "name": "Desert Mix",
      "description": "This is the first of a series of mixes where I collected all my favourite desert themes from all sorts of video games and tried to organise them in a coherent way. Doing this was a ton of work and gave me a huge appreciation for the wide variety of desert-themed music out there. Everything from the cheesy to the genuinely good is represented here. I tried to start off the mix with bangers to keep the listener interested, but the vibe switches to peaceful, harsh, experimental and intense. A full list of tracks you will not get because some of the weirder ones later on even I forgot where I found them! But I do want to give a special shoutout to the Shantae track that kicks off the mix. Is it the best desert music ever? Maybe",
      "id": "f8b532a9-fc0d-4208-861b-80111be3d9a7"
    },
    {
      "filename": "diddy_kong_racing_mix.mp3",
      "name": "Diddy Kong Racing Mix",
      "description": "Can we please talk about how timeless and perfect this soundtrack is? Each one a banger by legend Grant Kirkhope. The space themes at the end are SUCH a vibe I can't even describe. When I was a child I named my youtube channel where I posted piano videos of video game tracks after Darkmoon Caverns because I vibed so hard. This is definitely one of the better mixes here",
      "id": "e6d4fcb3-6ca6-46cb-82cd-99b0316ffbfb"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_1.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 1",
      "description": "I split up the Tropical Freeze mix into 6 because each world in this game comes with its own vibe. Sometimes I just fancy listening to one of them. This game is so fucking good and the music is insane. Highlight of this particular mix is definitely Busted Bayou towards the end, but also shoutouts to the absolutely insane boss music of the first world called Big Top Bop, which randomly goes SO HARD",
      "id": "12b69fac-a480-49c6-ae4b-52b0a058cbed"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_2.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 2",
      "description": "The second world from this game is the European/alpine vibe. I love that this game takes you to very specific and unique locations. Highlight of this mix might be Sawmill Thrill but there's a lot to be said for Wing Ding's lofty atmosphere towards the end of the mix. The boss music after world 1 drops heavily in quality so I didn't include it",
      "id": "28546518-2b07-4b0f-99b6-1b764c9c3630"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_3.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 3",
      "description": "The absolute classic that is Grassland Groove introduces us to the African-style vibe of this world (and this mix). Then underrated huge hit Baobab Bonanza comes hard and fast behind it, followed by the amazing Cannon Canyon. These tracks are so fucking good and later in the mix there is even a remix of Stickerbrush Symphony!",
      "id": "25a68cc5-0a96-4f21-a9fd-a6a18ca24991"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_4.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 4",
      "description": "This water-level themed mix is shorter than the others and has a heavy vibe, thanks to the lengthy Aquatic Ambience tribute that starts it off. Amiss Abyss & Deep Keep keep the vibe going. At the end is the level with the giant squid and maybe I should have left that out because it makes this ultra-chill mix kinda stressful",
      "id": "c9f7b873-742b-4c0a-a10a-5d878f6d8764"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_5.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 5",
      "description": "Definitely the weirdest and hardest to define of these Donkey Kong mixes, World 5 takes place in a jungle which collects fruit juices and then freezes them to make ice lollies for the final boss. Musically it is very distinct from the rest of the soundtrack but I found that this is the one that I came back to the most",
      "id": "cd973744-a4d6-4e38-943b-be7eb91106fd"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_6.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 6",
      "description": "World 6 has ice-level remixes of the levels from the first game, and the music reflects that. The forest level's ice remix and especially the factory level too are my favourites. The second half of the mix contains some extras I also wanted to put in there, like the bonus levels and most importantly the credits. The two credits tracks are so fucking good, the smooth saxophone on the first one, and another banger Stickerbrush Symphony remix for the second. What can I say I'm just happy Donkey Kong fan",
      "id": "2fbff799-75cd-426b-a96e-15b4fd6bf4c0"
    },
    {
      "filename": "earthbound_mix.mp3",
      "name": "Earthbound Mix",
      "description": "This is unlike all my other mixes because I went out of my way to look for remixes of the original music that other artists had made. I did it because I found a few amazing remixes that I wanted to feature, and mixing in the originals wasn't right. On this journey I found even more great remixes, and now we have this pretty cool mix of different styles all coming together, taking us through the events of the game. It's an early one so sounds pretty inconsistent, but Earthbound fans will enjoy this",
      "id": "9dc2d574-7cef-454a-ab36-f048ce4b7181"
    },
    {
      "filename": "fire_emblem_mix.mp3",
      "name": "Fire Emblem Mix",
      "description": "This is a collection of my favourite smash remixes of Fire Emblem tracks. I'm not 100% what inspired me to make this, but these tracks are all great and worth a listen. It features a nice crossfade on Awakening's Conquest theme at the end, so you can look forward to that. It also features the smash remix of FE2's battle theme where they went crazy and just made up a whole new section which wasn't in the original game. I dunno though I like it",
      "id": "972d3aa9-1493-47a4-a136-1a17cae1f254"
    },
    {
      "filename": "fire_emblem_fates_mix.mp3",
      "name": "Fire Emblem Fates Mix",
      "description": "I love Fates, I don't care that the story didn't really make sense and could have been so much better, the MUSIC of this game is insanely good. The east and west are represented with European and Japanese folk instruments respectfully and it works so well. The soundtrack itself is lengthy and bewildering and difficult to listen to online, so I consider this mix the best way to experience it. It's also the mix that I'm most proud of, and one that works for so many things such as long walks, narrowboat holidays, flights. Special shoutouts to Past Light, Dark Wastes, Road Taken, Glory/Ruin and so many more of these tracks that I love love love. I did my best to represent both battle and calm versions of each track, and even threw in a few other peripheral tracks to break up the map themes",
      "id": "3ea3edd8-5695-4953-a9bb-8690015fff6f"
    },
    {
      "filename": "hat_in_time_mix.mp3",
      "name": "Hat In Time Mix",
      "description": "A Hat In Time might not be the best game ever in terms of gameplay (sorry Hat in Time fans) but it has a really impressive soundtrack! This mix kinda goes a bit too hard and has too much in it, so I rarely listen to it the whole way through. But I often listen to the parts from Mafia Town, which I love so much. The Mafia Town music is totally reminiscent of Windfall Island and I am here for it! Also shoutouts to the recording studio at night when it gets really creepy, and I genuinely think that Subcon Forest is the best 'spooky video game music' track out there",
      "id": "5b7194b1-db6c-46eb-b5fc-56c32bff074d"
    },
    {
      "filename": "hey_pikmin_mix.mp3",
      "name": "Hey! Pikmin Mix",
      "description": "If you're looking for great pikmin music, definitely check out my other pikmin mix, but once you've enjoyed that and fancy some more deep cuts from the pikmin series, then this mix is for you. The Hey! Pikmin soundtrack manages to capture the very unique pikmin vibe, even if the game is kinda shit. Highlights is the map select from World 4, and also the level from World 4. One thing I regret is putting the boss music in the second half of the mix. It doesn't need it",
      "id": "f5525b89-6cb5-4799-be00-f872c82f6828"
    },
    {
      "filename": "ice_mix.mp3",
      "name": "Ice Mix",
      "description": "This third mix I made based on a kind of level, this time ice and winter levels. These require a ton of research, which is why I haven't made one since. Learning about ice levels wasn't as cool as desert or lava levels because there is way less variety, but I was still pleasantly surprised by some of the highlights. Nonetheless, I think this is way better than for example the winter theme playlist automatically generated by the Nintendo Music App. I decided to start of the mix with the rogue choice of the Snowman theme from the cancelled Mother 4 fan game. It's just so good!",
      "id": "644b79ee-40a6-47ce-8874-603ac3377270"
    },
    {
      "filename": "kirby_mix.mp3",
      "name": "Kirby Mix",
      "description": "This is probably the worst mix on here, not gonna lie. It's an early one, just me throwing together some of my favourite kirby music, largely from smash remixes. Then I throw in a remix of Mallow Castle from OCRemix which sounds totally out of place, or this one track I like from the Rainbow Curse soundtrack. This one I'm just leaving here for historical reasons",
      "id": "adff6abb-63fb-4e91-a131-d43ff19d0646"
    },
    {
      "filename": "kirby_super_star_mix.mp3",
      "name": "Kirby Super Star Mix",
      "description": "This game has such a great soundtrack and I'm so happy I made this mix because now I get to enjoy the whole thing whenever I want. Special shoutouts to the music from Dyna Blade, Meta Knight's Revenge and especially Milky Way Wishes. Timeless",
      "id": "e47ad31d-79dc-4693-b860-22fe76048edd"
    },
    {
      "filename": "lava_mix.mp3",
      "name": "Lava Mix",
      "description": "The second of the themed mixes I made, this time focusing on lava and fire-themed levels. There is so much to discover when it comes to this kind of vibe! Having thought about it a lot I've decided that Hot Head Bop from DKC2 is the best fire level music, but you can listen to this mix which takes you through all kinds of fire-level genres and tell me if you think I'm wrong",
      "id": "ed381292-c6aa-42fc-910b-f12764e090f1"
    },
    {
      "filename": "mario_kart_mix.mp3",
      "name": "Mario Kart Mix",
      "description": "This is the big one! I really poured my heart and soul into it. I am a completionist when it comes to video games but also elsewhere in life. That's why this mix contains music from every single racetrack ever been in Mario Kart! Maybe some obscure arcade, battle and tour tracks are missing but fuck that. Mario Kart music is so good, and not only are they good at representing genres of desert, beach, jungle (etc) tracks but they are also great at subverting them. I've grouped all the tracks together according to themes for a smooth listening experience, even though it means some of the low-tier tracks have to be next to legendary tracks (example: the timeless and incredible Peach Beach right next to the tinny, shitty 3DS Cheep Cheep Lagoon). The 3DS entry is truly the big disappointment of the series, but I've made my peace with it. Otherwise we've got Mario Kart 8's rich and gorgeous arrangements taking up over 50% of these tracks, owing to its sheer number of tracks and the fact that the remixes are 90% of the time better than the original. Please, take this mix with you into the gym and enjoy the vibes, I put a lot of thought into it",
      "id": "a68b7125-8c61-4196-9a00-ba4781cc2abb"
    },
    {
      "filename": "mega_bomberman_mix.mp3",
      "name": "Mega Bomberman Mix",
      "description": "Mega Bomberman on the Sega Genesis is a banger game that I loved as a child. I'm sure that the Bomberman series has a rich history of great soundtracks but this is the one which carries the nostalgia for me. It's not just nostalgia though these tracks are genuinely great. The final level music (before the bewildering final boss music) is so intense and so good",
      "id": "ecad7b32-bdef-48f4-b047-7fc9327a846e"
    },
    {
      "filename": "metroid_prime.mp3",
      "name": "Metroid Prime Mix",
      "description": "I'm not sure why I did this but this consists solely of the battle themes from Metroid Prime 1. At the time I made this I was really vibing with the Parasite Queen theme and really just rolled with that intense vibe but looking back now I'm asking myself, why on earth does this mix not contain all the amazing area music from this game?",
      "id": "e3d0ef62-acdc-4829-bcb7-5f1369a51875"
    },
    {
      "filename": "mother_3_mix.mp3",
      "name": "Mother 3 Mix",
      "description": "This is a complete and exhaustive collection of the entire Mother 3 soundtrack, lovingly put together for your enjoyment. This soundtrack is so wild and so good, and as I learned making this, so long! It will take you through all the chapters in the game and I put a lot of thought into what track comes where. I actually spent ages on this because I remade it after I found a higher quality version half through the process",
      "id": "40176e18-e1bc-4b72-8a3e-3003168942ac"
    },
    {
      "filename": "mother_3_mix_2.mp3",
      "name": "Mother 3 Mix 2",
      "description": "A much smaller mix of some of the harder hitting emotional tracks from Mother 3. They are taken from one of the (really well put together) remix albums that Nintendo did for this game. It starts with the music that plays during the shocking twist in Chapter 1 and sticks to that theme throughout. It's sad music, guys",
      "id": "1994ffc8-f62b-4817-835a-0a07c7673f3d"
    },
    {
      "filename": "pikmin_mix.mp3",
      "name": "Pikmin Mix",
      "description": "Can we talk about how amazing Pikmin music is? If you're as enthusiastic about it as I am, you will love this mix. I spent ages combining tracks from the first three games into a coherent sequence, and I'm super happy with the outcome. It's hard to listen to these soundtracks without an official release so this is my preferred way to revisit Pikmin in my mind. I even include a lot of the music variations as much as I could",
      "id": "c18918f3-fa41-4f3e-876c-dd6ac49dcca3"
    },
    {
      "filename": "pokemon_heart_gold_soul_silver_mix.mp3",
      "name": "Pokemon Heart Gold/Soul Silver Mix",
      "description": "This is my favourite pokemon game and as such it deserves its own mix. It covers pretty much the entire soundtrack and it's just so good. There's so much to enjoy here. Making this mix also gave me a new appreciation for the Kanto themes here",
      "id": "9b7b94f7-82da-40f1-91a1-87ad3891fedb"
    },
    {
      "filename": "pokemon_mystery_dungeon_mix.mp3",
      "name": "Pokemon Mystery Dungeon Mix",
      "description": "Mystery Dungeon has some absolute corkers in its soundtracks, but not all the music is of that high standard. That's why I made this mix, which just grabs some highlights from Red/Blue Rescue Team, Explorers of Time/Darkness and also fuck it, Super Mystery Dungeon too. I liked that game. If there's one track you should listen to it's definitely Temporal Tower. Or maybe Sky Tower",
      "id": "9bf9614f-e6ef-48d3-9168-f1186a1892f2"
    },
    {
      "filename": "pokemon_sun_moon_mix.mp3",
      "name": "Pokemon Sun/Moon Mix",
      "description": "Controversial choice but I really vibed with the gen 7 soundtrack so here we are. I remember it coming out and making sure to absorb the soundtrack fully with nice headphones whenever I played it, and I was right to do that because there are some amazing tracks here. Vast Poni Canyon, some of the town themes, the standard-ass Trainer battle. It's great",
      "id": "903db550-c256-4eb5-9c31-60fca4d9feca"
    },
    {
      "filename": "shantae_half_genie_hero_mix.mp3",
      "name": "Shantae: Half-Genie Hero Mix",
      "description": "Jake Kaufmann does it again in this amazing banger of a soundtrack. It's so creative, bombastic and awesome. I love the remix of Burning Town and I've even come around to the song at the start of the mix. My absolute faves though are the desert tracks, holy damn",
      "id": "9c58ebf2-7896-4f36-a1ab-f01c1ed3c873"
    },
    {
      "filename": "shantae_pirates_curse_mix.mp3",
      "name": "Shantae and the Pirate's Curse Mix",
      "description": "The first Shantae game I played and I still remember hearing Burning Town thinking, aha this is one of those games which is about the vibe. So many great tracks. I split this into area themes and dungeon themes but looking back, I probably didn't need to do that. The mix is still good though",
      "id": "2d1528f6-e728-429b-a77a-a3affb428151"
    },
    {
      "filename": "smash_4_mix_1.mp3",
      "name": "Smash 4 Mix 1",
      "description": "This is the one that started it all! When Smash for 3DS came out back in 2014 I was so blown away by that gerudo desert remix, that f-zero mute city remix that goes CRAZY, and let me tell you I was so happy to have that brand new Pikmin remix, and the Mother tracks. The mixes between the tracks is pretty bad but it's literally my first mix. I listened to this so many times over the years",
      "id": "7a275895-c7d1-4722-b02f-1c3d1c5d6bc5"
    },
    {
      "filename": "smash_4_mix_2.mp3",
      "name": "Smash 4 Mix 2",
      "description": "Hot off the heals of the last one, I proceeded to bust several nuts listening to the full soundtrack releasing with the Wii U version a few months later. I gathered my first immediate faves in this mix, like that Pikmin 3 remix, Pedal Glider and the Mario World fortress theme",
      "id": "520e9bdb-879a-44f9-8038-7f0afd0c8ffa"
    },
    {
      "filename": "smash_4_mix_3.mp3",
      "name": "Smash 4 Mix 3",
      "description": "This one is super epic, featuring the underrated Dark Lord theme and Metroid to start us off. I was also very cheeky and started including tracks which weren't actually new smash remixes like the Pokemon X/Y Champion battle or Brawl's Fire Field",
      "id": "3bca5eb9-2cd1-4e32-9bfd-19a08059f20f"
    },
    {
      "filename": "smash_4_mix_4.mp3",
      "name": "Smash 4 Mix 4",
      "description": "Around this time I realised how good that Wii era music is, Wii Sports, Mii Channel... hell yeah. This was made at the same time as the previous one has more upbeat, happy tracks",
      "id": "54c1a666-f794-4c7d-b4c9-e8cab5bcefa3"
    },
    {
      "filename": "smash_4_mix_5.mp3",
      "name": "Smash 4 Mix 5",
      "description": "Time passed and I returned to making these with a view to collect some of the remixes that I hadn't fully appreciated on first listen but really came round to later. Turbo Jet, some of those Kirby tracks, and at the end I even threw in the controversial remix of Pokemon Diamond/Pearl's wild battle. This remix replaced the original brawl one in smash 4, and then this ended up being the ONLY remix that didn't make it back in ultimate (the original brawl one got in instead)",
      "id": "e697a612-e0cc-4219-9748-8f9fcd06bb2a"
    },
    {
      "filename": "smash_4_mix_6.mp3",
      "name": "Smash 4 Mix 6",
      "description": "This is the point when I finally started listening to the mega man remixes of which there are many. Quick man, Dark man, omg there are so many good ones. In this mix we're finding more deep cuts, and it's also like the 3rd time I mix in the melee remix of Brinstar Depths, because it's just that good",
      "id": "1c635475-25c4-4f18-9acb-2a71b777e220"
    },
    {
      "filename": "smash_4_mix_7.mp3",
      "name": "Smash 4 Mix 7",
      "description": "This is closer to the end of smash 4's life, and I was just really appreciating the fucking main theme, specifically the Battlefield music. That's why it starts like that! Because it's the best smash theme! This one is also longer than the rest, partly because I wanted to include music from the franchises that I missed out on like Street Fighter, Xenoblade, Bayonetta. It results in a bit of a forced mix. At least I didn't put Splatoon in there, that soundtrack is ass",
      "id": "4e027e95-e73c-47ee-b688-aa2de8c59a15"
    },
    {
      "filename": "smash_64_mix.mp3",
      "name": "Smash 64 Mix",
      "description": "This is the whole soundtrack of the first game and I love it so much. It's just the respective main themes and you know what I'm here for it. Bonuses include the victory themes and also the amazing credits music. This mix is definitely a great vibe",
      "id": "dd70d365-2b63-455e-8839-09fcbe38ab61"
    },
    {
      "filename": "smash_brawl_mix.mp3",
      "name": "Smash Brawl Mix",
      "description": "I went back and really appreciated how good some of the key remixes from brawl were and wanted to make a mix of it. I decided to base it roughly on the music that was most memorable from the Subspace Emissary. People don't talk about how the obscure Fire Emblem track 'with Mila's divine protection' is the reason why people love the desert sections so much",
      "id": "6e4cbaa1-f1e2-4e86-9784-2dd17777495e"
    },
    {
      "filename": "smash_melee_mix.mp3",
      "name": "Smash Melee Mix",
      "description": "Melee, absolutely legendary soundtrack. How incredible is it that most of these tracks were actually orchestrated for this soundtrack. These games just have such a rich history, man. This mix doesn't contain every single track because not all of them are great but I represent most of them in a pretty coherent way",
      "id": "6378bc1d-db2b-4116-937e-84d5c0017f8c"
    },
    {
      "filename": "smash_ultimate_mix_1.mp3",
      "name": "Smash Ultimate Mix 1",
      "description": "Smash Ultimate came out and I jizzed all over again because we were treated to a bunch more amazing remixes. This time I was prepared and I made all these mixes all at once, separating them into four different vibes. This one is reserved for intense bangers. This fucking Molgera remix makes me wet my pants every time. And we also have Crocodile Cacophony and motherfucking Snake's theme which goes OFF",
      "id": "e1630a65-ecc2-4f46-9fec-cbdf8fd5e2bf"
    },
    {
      "filename": "smash_ultimate_mix_2.mp3",
      "name": "Smash Ultimate Mix 2",
      "description": "This one is the party mix, and I love it so much. We've got the amazing Staff Credits from Kirby, the new Light Plane remix, Gravity Man... I just regret putting Snipperclips in here. Not sure what I was thinking",
      "id": "c35b60e7-fcf9-48f0-8075-a50193792621"
    },
    {
      "filename": "smash_ultimate_mix_3.mp3",
      "name": "Smash Ultimate Mix 3",
      "description": "'Epic' is how I would describe this mix, with the more orchestral stuff coming together here. Highlight for me is the new Big Blue, but also special shoutouts to the Codename STEAM music. Maybe I should play that game",
      "id": "69bb59f9-25f6-4f23-9f52-5ade63449110"
    },
    {
      "filename": "smash_ultimate_mix_4.mp3",
      "name": "Smash Ultimate Mix 4",
      "description": "Finally we have the 'other' section of just everything else. As a result this mix is pretty kooky and there's a lot going on. We've got the underrated Map theme from DKC, the Wii Fit music, and a bunch of other random ass shit. I honestly wouldn't put this on during a party",
      "id": "a1d89fd8-8995-4269-bd7a-5bd5b9857b2b"
    },
    {
      "filename": "snes_mix.mp3",
      "name": "SNES Mix",
      "description": "I decided to try my hand at curating a little mix based on a single platform, the amazing Super Nintendo. Since making this I've played a few more amazing SNES games that deserved to be here so it almost hurts to listen to this again knowing they're missing. Since making this I've also become a Patreon subscriber to GST Channel on youtube who makes the best fucking SNES mixes ever and I realised that I'm a fucking amateur. There is so much stuff out there that isn't published by Nintendo...",
      "id": "f5dac86b-9442-4582-8b48-c157af8a7f34"
    },
    {
      "filename": "sonic_1_mix.mp3",
      "name": "Sonic 1 Mix",
      "description": "Shoutouts to Tee Lopes who made these remixes of the first Sonic game before he became an actual composer for sonic. They're great, and of course the source material is great. Peep the Starlight Zone remix!",
      "id": "489d8a5e-efa9-43e5-af31-08789a864cc1"
    },
    {
      "filename": "sonic_2_mix.mp3",
      "name": "Sonic 2 Mix",
      "description": "I'm gonna be real I didn't even make this, I just ripped it directly from Youtube! Tee Lopes made it out of his own remixes and it goes so hard. The part when Hilltop Zone finally comes in with that saxophone? Heeeeell yeeeeah!",
      "id": "fe0580d6-01a3-4360-9dc2-784b8b9dcb7a"
    },
    {
      "filename": "sonic_3_mix.mp3",
      "name": "Sonic 3 Mix",
      "description": "Finally some actual source material! This is the soundtrack from Sonic 3, which has some all time classics like Hydrocity and Marble Garden. I regret that I didn't put in the tracks from Sonic 3 and Knuckles though!",
      "id": "ca5837ef-5763-4b08-b969-32bc73bc857a"
    },
    {
      "filename": "sonic_cd_mix.mp3",
      "name": "Sonic CD Mix",
      "description": "Shoutouts to Sonic CD which had an absolutely unhinged soundtrack. I never played the game but this (japanese version of the) soundtrack slaps so hard. It's giving Undertale, it's giving Jpop. Each level has four variants of the music and they're all great and worth your time!",
      "id": "8f17860b-f691-4b85-8abd-094623814748"
    },
    {
      "filename": "sonic_mania_mix.mp3",
      "name": "Sonic Mania Mix",
      "description": "Hell yes this is one of my all time favourite soundtracks and it's all thanks to Tee Lopes who went from being a fan to composing for this. He fucking smashed it. The new stages go so hard and the classics are better than ever. Too many good ones to name but can we please talk about how underrated Oil Ocean is I mean what a VIBE",
      "id": "89026ea4-ac53-4c65-99e5-d913a4724c45"
    },
    {
      "filename": "starfox_zero_mix.mp3",
      "name": "Starfox Zero Mix",
      "description": "Left field I'm aware but I was so taken by that beautiful tutorial music that I decided to do a whole mix. I didn't even play the game but enjoyed listening to the soundtrack. Staff credits 2 and also planet Fortuna are other highlights",
      "id": "c0478256-f6d9-4f3c-8db7-734f4f09c752"
    },
    {
      "filename": "streets_of_rage_2_mix.mp3",
      "name": "Streets of Rage 2 Mix",
      "description": "Does Streets of Rage 2 have the best video game soundtrack ever? Maybe. I find myself coming back to it constantly. Its vibe is unmatched. Yuzo Koshiro made a classic house soundtrack on a Genesis soundtrack and it sounds perfect. Please listen to this!",
      "id": "0806775c-5a5a-479c-ab5a-635061fb6401"
    },
    {
      "filename": "undertale_mix.mp3",
      "name": "Undertale Mix",
      "description": "Well it's a classic by now but when I made this it was still fresh! I have to say I've heard these tracks enough times that I don't come back to this mix, but that's not to say it isn't legendary. If you don't know the soundtrack inside out like I do, it's worth giving a listen",
      "id": "c935ea8f-4dc2-4a5a-81d6-4b8ce309d141"
    },
    {
      "filename": "void_stranger_mix.mp3",
      "name": "Void Stranger Mix",
      "description": "A recent one! I played this amazing indie game called Void Stranger and I wanted to neatly organise my favourite tracks together because the official soundtrack was too all over the place. This is great background music. You should play the game though",
      "id": "75e1a0a6-047d-4e8b-baaa-fd969152cbd0"
    },
    {
      "filename": "wii_fix_mix.mp3",
      "name": "Wii Fit Mix",
      "description": "I'm not proud that I made a Wii Fit Mix but I did it because I had a free afternoon and had gone to a yoga class that day or something. What can I say there are just a bunch of great Wii Fit remixes in smash and I wanted to appreciate them more",
      "id": "104cc85a-83b3-40c2-8b8c-ebf1e57b67f6"
    },
    {
      "filename": "yoshis_story_mix.mp3",
      "name": "Yoshi's Story Mix",
      "description": "Ah, one of the very first games I ever played as a child. As you can imagine, the nostalgia is running wild on this one. Everything about it fills me warmth. Everything from the first title screen track to the beautiful ending theme. So cute and I love it",
      "id": "8a990c3a-5c0e-4634-bcda-285ac37ed6f3"
    },
    {
      "filename": "yoshis_woolly_world_mix.mp3",
      "name": "Yoshi's Woolly World Mix",
      "description": "I wanted to show respect to Woolly World for its new direction in musical style. I really like some of the tracks, especially the first couple in this mix, although I admit this mix is a bit all over the place. I want to point out the specific Bowser castle 2 music which I shoehorned in at the end, which is randomly super beautiful and gorgeous. A hidden gem in the soundtrack",
      "id": "be2f7494-e63a-4eea-9d8f-6cf4a6a0dba5"
    },
    {
      "filename": "zelda_botw_mix_1.mp3",
      "name": "Zelda Breath of the Wild Mix 1",
      "description": "When the world changed in March 2017I of course had to mark the occasion with two mixes. This one is for the battle music, which is great, but I didn't end up coming back to much.",
      "id": "b51dec94-625e-42b6-abec-74bd72ef640e"
    },
    {
      "filename": "zelda_botw_mix_2.mp3",
      "name": "Zelda Breath of the Wild Mix 2",
      "description": "This is a significantly longer and more important mix of all the chill themes from the game, of which there is a lot. I put a lot of work into this and it really paid off, I still listen to this these days. I want to shout out the final dungeon music from the DLC which I added in a little update years later. It's so good",
      "id": "4efae248-1134-45f6-8cd1-e8a40d900ecc"
    },
    {
      "filename": "zelda_links_awakening_mix.mp3",
      "name": "Zelda Link's Awakening Mix",
      "description": "This mix is from the switch remake, which so very beautifully recreated the original soundtrack. I love this game so much. The original was one of the very first games I ever played and I will carry the memories of its soundtrack with me forever. PLEASE take some time to listen to Face Shrine",
      "id": "ffa9119d-223b-4f2f-a4a1-ed3b4e93f3b4"
    }
  ]
}