{
  "mixes": [
    {
      "filename": "animal_crossing_wild_world_mix.mp3",
      "name": "Animal Crossing Wild World Mix",
      "description": "This is a collection of all the hourly themes from this classic Animal Crossing soundtrack. It starts in the night time, so get excited for those unique cozy nighttime vibes"
    },
    {
      "filename": "animal_crossing_new_leaf_mix.mp3",
      "name": "Animal Crossing New Leaf Mix",
      "description": "Animal Crossing New Leaf really changed the vibe when it comes to the hourly themes. Richer, more lush, the loops twice as long. A special kind of vibe that we must cherish"
    },
    {
      "filename": "arms_mix.mp3",
      "name": "ARMS Mix",
      "description": "Lowkey ARMS has a great soundtrack. That legendary main theme and the various stages are all represented in this mix. Credits theme also a banger"
    },
    {
      "filename": "cadence_of_hyrule_mix.mp3",
      "name": "Cadence of Hyrule Mix",
      "description": "The moment I heard the Tal Tal Heights theme in the Cadence of Hyrule trailer I jizzed my pants. Then I learn that the main overworld theme is an incredible four minute loop combining four different classic zelda overworld themes? I had to make a mix. There are a ton of other great classic tracks, but also original tracks. I admit, having listened to this mix a bunch I kind of regret putting in the original dungeon themes. With the exception of Hyrule Castle I don't think they really slap like the other ones"
    },
    {
      "filename": "celeste_mix.mp3",
      "name": "Celeste Mix",
      "description": "Beloved indie darling Celeste deserves its own mix. Of course you can just listen to the original soundtrack on Spotify but I wanted to have the tracks transition into each other nicely and that's exactly what this is. Looking back I actually prefer the Farewell DLC music more, and that sadly isn't present in this mix"
    },
    {
      "filename": "dandara_mix.mp3",
      "name": "Dandara Mix",
      "description": "Dandara is an obscure indie game that I loved with a mind-blowing soundtrack. About 5 minutes into this mix is the incredible boss theme. Let it bless your ears and then get blown away by the FINAL boss theme at the end. Holy moly"
    },
    {
      "filename": "desert_mix.mp3",
      "name": "Desert Mix",
      "description": "This is the first of a series of mixes where I collected all my favourite desert themes from all sorts of video games and tried to organise them in a coherent way. Doing this was a ton of work and gave me a huge appreciation for the wide variety of desert-themed music out there. Everything from the cheesy to the genuinely good is represented here. I tried to start off the mix with bangers to keep the listener interested, but the vibe switches to peaceful, harsh, experimental and intense. A full list of tracks you will not get because some of the weirder ones later on even I forgot where I found them! But I do want to give a special shoutout to the Shantae track that kicks off the mix. Is it the best desert music ever? Maybe"
    },
    {
      "filename": "diddy_kong_racing_mix.mp3",
      "name": "Diddy Kong Racing Mix",
      "description": "Can we please talk about how timeless and perfect this soundtrack is? Each one a banger by legend Grant Kirkhope. The space themes at the end are SUCH a vibe I can't even describe. When I was a child I named my youtube channel where I posted piano videos of video game tracks after Darkmoon Caverns because I vibed so hard. This is definitely one of the better mixes here"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_1.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 1",
      "description": "I split up the Tropical Freeze mix into 6 because each world in this game comes with its own vibe. Sometimes I just fancy listening to one of them. This game is so fucking good and the music is insane. Highlight of this particular mix is definitely Busted Bayou towards the end, but also shoutouts to the absolutely insane boss music of the first world called Big Top Bop, which randomly goes SO HARD"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_2.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 2",
      "description": "The second world from this game is the European/alpine vibe. I love that this game takes you to very specific and unique locations. Highlight of this mix might be Sawmill Thrill but there's a lot to be said for Wing Ding's lofty atmosphere towards the end of the mix. The boss music after world 1 drops heavily in quality so I didn't include it"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_3.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 3",
      "description": "The absolute classic that is Grassland Groove introduces us to the African-style vibe of this world (and this mix). Then underrated huge hit Baobab Bonanza comes hard and fast behind it, followed by the amazing Cannon Canyon. These tracks are so fucking good and later in the mix there is even a remix of Stickerbrush Symphony!"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_4.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 4",
      "description": "This water-level themed mix is shorter than the others and has a heavy vibe, thanks to the lengthy Aquatic Ambience tribute that starts it off. Amiss Abyss & Deep Keep keep the vibe going. At the end is the level with the giant squid and maybe I should have left that out because it makes this ultra-chill mix kinda stressful"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_5.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 5",
      "description": "Definitely the weirdest and hardest to define of these Donkey Kong mixes, World 5 takes place in a jungle which collects fruit juices and then freezes them to make ice lollies for the final boss. Musically it is very distinct from the rest of the soundtrack but I found that this is the one that I came back to the most"
    },
    {
      "filename": "donkey_kong_tropical_freeze_mix_6.mp3",
      "name": "Donkey Kong Country: Tropical Freeze Mix 6",
      "description": "World 6 has ice-level remixes of the levels from the first game, and the music reflects that. The forest level's ice remix and especially the factory level too are my favourites. The second half of the mix contains some extras I also wanted to put in there, like the bonus levels and most importantly the credits. The two credits tracks are so fucking good, the smooth saxophone on the first one, and another banger Stickerbrush Symphony remix for the second. What can I say I'm just happy Donkey Kong fan"
    },
    {
      "filename": "earthbound_mix.mp3",
      "name": "Earthbound Mix",
      "description": "This is unlike all my other mixes because I went out of my way to look for remixes of the original music that other artists had made. I did it because I found a few amazing remixes that I wanted to feature, and mixing in the originals wasn't right. On this journey I found even more great remixes, and now we have this pretty cool mix of different styles all coming together, taking us through the events of the game. It's an early one so sounds pretty inconsistent, but Earthbound fans will enjoy this"
    },
    {
      "filename": "fire_emblem_mix.mp3",
      "name": "Fire Emblem Mix",
      "description": "This is a collection of my favourite smash remixes of Fire Emblem tracks. I'm not 100% what inspired me to make this, but these tracks are all great and worth a listen. It features a nice crossfade on Awakening's Conquest theme at the end, so you can look forward to that. It also features the smash remix of FE2's battle theme where they went crazy and just made up a whole new section which wasn't in the original game. I dunno though I like it"
    },
    {
      "filename": "fire_emblem_fates_mix.mp3",
      "name": "Fire Emblem Fates Mix",
      "description": "I love Fates, I don't care that the story didn't really make sense and could have been so much better, the MUSIC of this game is insanely good. The east and west are represented with European and Japanese folk instruments respectfully and it works so well. The soundtrack itself is lengthy and bewildering and difficult to listen to online, so I consider this mix the best way to experience it. It's also the mix that I'm most proud of, and one that works for so many things such as long walks, narrowboat holidays, flights. Special shoutouts to Past Light, Dark Wastes, Road Taken, Glory/Ruin and so many more of these tracks that I love love love. I did my best to represent both battle and calm versions of each track, and even threw in a few other peripheral tracks to break up the map themes"
    },
    {
      "filename": "hat_in_time_mix.mp3",
      "name": "Hat In Time Mix",
      "description": "A Hat In Time might not be the best game ever in terms of gameplay (sorry Hat in Time fans) but it has a really impressive soundtrack! This mix kinda goes a bit too hard and has too much in it, so I rarely listen to it the whole way through. But I often listen to the parts from Mafia Town, which I love so much. The Mafia Town music is totally reminiscent of Windfall Island and I am here for it! Also shoutouts to the recording studio at night when it gets really creepy, and I genuinely think that Subcon Forest is the best 'spooky video game music' track out there"
    },
    {
      "filename": "hey_pikmin_mix.mp3",
      "name": "Hey! Pikmin Mix",
      "description": "If you're looking for great pikmin music, definitely check out my other pikmin mix, but once you've enjoyed that and fancy some more deep cuts from the pikmin series, then this mix is for you. The Hey! Pikmin soundtrack manages to capture the very unique pikmin vibe, even if the game is kinda shit. Highlights is the map select from World 4, and also the level from World 4. One thing I regret is putting the boss music in the second half of the mix. It doesn't need it"
    },
    {
      "filename": "ice_mix.mp3",
      "name": "Ice Mix",
      "description": "This third mix I made based on a kind of level, this time ice and winter levels. These require a ton of research, which is why I haven't made one since. Learning about ice levels wasn't as cool as desert or lava levels because there is way less variety, but I was still pleasantly surprised by some of the highlights. Nonetheless, I think this is way better than for example the winter theme playlist automatically generated by the Nintendo Music App. I decided to start of the mix with the rogue choice of the Snowman theme from the cancelled Mother 4 fan game. It's just so good!"
    },
    {
      "filename": "kirby_mix.mp3",
      "name": "Kirby Mix",
      "description": "This is probably the worst mix on here, not gonna lie. It's an early one, just me throwing together some of my favourite kirby music, largely from smash remixes. Then I throw in a remix of Mallow Castle from OCRemix which sounds totally out of place, or this one track I like from the Rainbow Curse soundtrack. This one I'm just leaving here for historical reasons"
    },
    {
      "filename": "kirby_super_star_mix.mp3",
      "name": "Kirby Super Star Mix",
      "description": "This game has such a great soundtrack and I'm so happy I made this mix because now I get to enjoy the whole thing whenever I want. Special shoutouts to the music from Dyna Blade, Meta Knight's Revenge and especially Milky Way Wishes. Timeless"
    },
    {
      "filename": "lava_mix.mp3",
      "name": "Lava Mix",
      "description": "The second of the themed mixes I made, this time focusing on lava and fire-themed levels. There is so much to discover when it comes to this kind of vibe! Having thought about it a lot I've decided that Hot Head Bop from DKC2 is the best fire level music, but you can listen to this mix which takes you through all kinds of fire-level genres and tell me if you think I'm wrong"
    },
    {
      "filename": "mario_kart_mix.mp3",
      "name": "Mario Kart Mix",
      "description": "This is the big one! I really poured my heart and soul into it. I am a completionist when it comes to video games but also elsewhere in life. That's why this mix contains music from every single racetrack ever been in Mario Kart! Maybe some obscure arcade, battle and tour tracks are missing but fuck that. Mario Kart music is so good, and not only are they good at representing genres of desert, beach, jungle (etc) tracks but they are also great at subverting them. I've grouped all the tracks together according to themes for a smooth listening experience, even though it means some of the low-tier tracks have to be next to legendary tracks (example: the timeless and incredible Peach Beach right next to the tinny, shitty 3DS Cheep Cheep Lagoon). The 3DS entry is truly the big disappointment of the series, but I've made my peace with it. Otherwise we've got Mario Kart 8's rich and gorgeous arrangements taking up over 50% of these tracks, owing to its sheer number of tracks and the fact that the remixes are 90% of the time better than the original. Please, take this mix with you into the gym and enjoy the vibes, I put a lot of thought into it"
    },
    {
      "filename": "mega_bomberman_mix.mp3",
      "name": "Mega Bomberman Mix",
      "description": "Mega Bomberman on the Sega Genesis is a banger game that I loved as a child. I'm sure that the Bomberman series has a rich history of great soundtracks but this is the one which carries the nostalgia for me. It's not just nostalgia though these tracks are genuinely great. The final level music (before the bewildering final boss music) is so intense and so good"
    }
  ]
}
