{
    "timestamp": "13-01-2026",
    "title": "It's pretty alright, pretty cold",
    "description": [
        "Berlin has been hit by a pretty real cold snap this month, and I've found myself super enjoying it. I'm out and about a lot, and I'm appreciating the -6 more than usual. I feel like in this age of climate change, mother nature will be telling us that she doesn't fuck around more and more often, and I'm kinda on her side. Luckily with my lifestyle I'm only ever really out in the biting cold wind for some moments before I can enter a warm building. Some of those feedback loops are going to start hitting soon when it comes to climate change, which I'm not very excited about. But Jack being so optimist when talking about the world's issues made me feel bad about dooming so much this week so maybe in 2026 we can all get excited about the prospect of nuclear fusion working. That would be sick.",
        "I've thoroughly enjoyed this time around new years not just because of the cold though. Weyes put on not one but two great parties, and I actually had a bunch of time at home, so I finally got round to playing Clair Obscur: Expedition 33, which I loved. I can't wait to take some holidays from work exclusively to play games like this. That's where the priority is this year (sorry, Mexico).",
        "Guys, I've spent a bunch of time on the daily soundtracks part of this website - you should check it out! There is an archive of all the previous daily soundtracks I've featured, and you can listen to them directly on the site, and even organise the tracks into little playlists. Doing this was very excited but now I'm suddenly aware that it's more important than ever that I only recommend the best songs ever. Luckily I'm overflowing with ideas about which music to recommend, and I've already made posts all the way into March. Anyway I hope it offers a fun reason to come back to the website from time to time."
    ],
    "entries": [
        {
            "title": "Clair Obscur: Expedition 33",
            "description": [
                "Wow! I have not played a game with such good art direction as this! Whoever they hired to design the outfits needs a raise. This game is so aggressively French and I'm so here for it. It's got berets, famous landmarks, and I just went ahead and played it in French for the full experience. Loved it. And the environments look so gorgeous and detailed and have amazing lighting and yeah this game just looks amazing.",
                "And sounds amazing! Excellent, expansive soundtrack, unafraid to use accordion.",
                "I think the best thing about the game though is the writing. It features characters who have actual empathy for one another! And when some crazy shit happens, they take a moment to talk about it. The characters are all distinct, flawed but likeable, and have their own reactions to everything. I love that Lune just wants to ask questions about everything because the story is so wild, she's just like me. And then Sciel is like the adult in the room, aware that the world around her is bigger than what she understands and decides to be chill about the whole thing. Maelle has a moment where she was like, this is not at all what I expected and I dunno I just thought it was so real, even if her scenes were a little hard to take seriously because I gave her a ridiculous haircut.",
                "The gameplay is also good. It took me a long time to get into the parrying but towards the end of the game I started getting good at it. What's nice is that there are ways to play where you don't bother with the parrying at all. It meant I didn't feel like a total noob as I was starting the game. I will say that there is some optional content where you have to do platforming and it's totally bullshit. It was worth it to get the outfit of Verso just in his trunks though."
            ],
            "image": "games/clair-obscur.jpg",
            "metadata": "Vibes: 10, Gameplay: 10, Platform: Playstation 5, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "Wario Land 3",
            "description": [
                "Playing this game was so refreshing, it was familiar because I played and loved Wario Land 4, but also quite different to that game, and so different to your average platformer. In this game you can't die! It's more of a puzzle game - 'how do I get to this treasure chest?' rather than 'can I get to this treasure chest?'. I like all the transformations and the role they play in the puzzles. The game even has metroidvania elements the way you get new power-ups and revisit old levels.",
                "The animations are also a lot of fun. It's such a goofy game. Delightful and recommended gem on the Nintendo Switch Online!"
            ],
            "image": "games/warioland-3.png",
            "metadata": "Vibes: 6, Gameplay: 8, Platform: Gameboy, Release: 2000",
            "type": "GAME"
        },
        {
            "title": "Ball X Pit",
            "description": [
                "This is so so so addicting, just like Vampire Survivors. Loved getting absolutely absorbed by it this Christmas. The ball part has some great risk/reward or push/pull and feels great. The city building part is a bit intimidating but actually alright in the end. I don't love the overall vibe and design of it, nor do I love the music. It's kinda gruesome and unpleasant. Honestly by the end I was happy I rolled the credits and I could stop."
            ],
            "image": "games/ball-x-pit.webp",
            "metadata": "Vibes: 6, Gameplay: 8, Platform: Switch 2, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "The Legend of Zelda: Four Swords",
            "description": [
                "Always wanted to play the multiplayer Zelda games and was finally able to when Oscar Andrew and I connected out Switch 2s on the NSO app and played local multiplayer. It was awesome and we blazed through the game in one sitting! It was consistently funny to bump into each other going through little corridors and hitting each other and we loved the whole thing. There were a couple of head-scratching moments and we weren't a fan of the mysterious Rupee Wraith. We just played it through once but it turns out that there's a true ending if you play it through on harder modes two more times. I feel like there's a lot of fun to be had here! The levels are even procedurally generated before that was cool. There's also a fun competitive element where the person who got the most rupees wins, Super Mario 3D World style. Loved that! Loved the game to be honest. Great."
            ],
            "image": "games/zelda-four-swords.jpg",
            "metadata": "Vibes: 6, Gameplay: 7, Platform: Gameboy Advance, Release: 2002",
            "type": "GAME"
        },
        {
            "title": "Super Mario Land 2: 6 Golden Coins",
            "description": [
                "I enjoyed this game on the Nintendo Switch Online! Not as fun as other Mario games because of the small screen but glad to have played this one that I always missed. Cool that this is the first appearance of Wario!"
            ],
            "image": "games/super-mario-land-2.webp",
            "metadata": "Vibes: 6, Gameplay: 6, Platform: Gameboy, Release: 1992",
            "type": "GAME"
        },
        {
            "title": "Metroid Prime 4: Beyond",
            "description": [
                "This game started off so strong but by the end I decided that it isn't a true continuation of the excellent Metroid Prime series. Music and atmosphere is definitely great, although the only really memorable music is the first area, Fury Green. I feel like the game could benefit from more music tracks as actually most of the game is spent with just ambient noise.",
                "The thing that I appreciate the most is that it takes place on a planet where the architecture is so yonic! Yonic is a fun word that means 'relating to vaginas and stuff' (as opposed to phallic). Every door, switch, building looks like female genitalia. Samus is going around controlling clits with her new psychic powers and you can't convince me otherwise. There is some pretty strong lesbian energy.",
                "I also enjoy how so much random-ass shit happens in this game. When you beat one of the yonic bosses and then this pedestal appears which transports Samus to a dream realm where she grabs a magic key and then curls into a ball and learns how to boost up halfpipes. All that happens within like 2 minutes of each other.",
                "Samus is a badass lone hunter who really doesn't need anyone else, but they introduce some annoying American characters who are stranded there anyway. I appreciate that they speak to Samus like she is a divine legend, and that Samus doesn't dignify them with any response, but ultimately they have been added as plot devices to try to add emotional weight to the story. It feels fake as fuck. It's just typical tropes like sacrificing yourself (and then turning up later), and has been totally shoehorned in. Would have been better if she was just on her own as usual. The best Metroid atmosphere is the feeling of loneliness. I don't want to get a cool new item and then immediately get a call from an American man saying where I should go next.",
                "There's also a desert area where you drive around on a motorbike, a bit of a departure from the series, and it's fine, I guess. I actually appreciate how it makes it a bit more feasible to have these different climates (jungle, icy mountain, volcano) all in the same place. In Metroid Prime 1 you just hop between these biomes in a couple of seconds. That always bothered me!",
                "Well, it would have been fine, except that at the end of the game, you have to drive around the desert and collect a bunch of these green crystals in order to progress to the end of the game. When it dawned on me that I only had half the crystals necessary, my heart sank. I then spent like an hour driving in this empty ass, shitty desert crashing into crystals over and over, just for the privilege of watching the ending? Bullshit. Hated it. Felt like work!",
                "Then the ending, you don't even learn what Sylux’s whole deal is, unless you go for 100% (fuck that). I watched the secret cut scene on YouTube and well yeah that is a ridiculous backstory.",
                "The gameplay itself was just the same as Metroid prime 1. I think they could have done more backtracking in a good way. The backtracking felt quite forced (American man tells you where to go), and how come we never return to the best place, Fury Green?",
                "All in all, I'm pretty disappointed in this game and wouldn't recommend it. Play Metroid Prime 1 remastered instead!"
            ],
            "image": "games/metroid-prime-4.jpg",
            "metadata": "Vibes: 9, Gameplay: 6, Platform: Switch 2, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "Carrie",
            "description": [
                "The first half of this classic film was unbearable to watch, but from the iconic moment at the school prom onwards we were just screaming 'Yeeees fuck em up!! Burn it all down!'. If only this is what happened when people treated women so badly in real life."
            ],
            "image": "films/carrie.webp",
            "metadata": "Release: 1976",
            "type": "FILM"
        },
        {
            "title": "The Great Escape",
            "description": [
                "The family has this on the TV at Christmas quite a lot. It was alright. Got me thinking if the Germans have some kind of equivalent."
            ],
            "image": "films/great-escape.jpg",
            "metadata": "Release: 1963",
            "type": "FILM"
        },
        {
            "title": "Aftersun",
            "description": [
                "Story of a dad taking his 11 daughter on holiday, trying to keep it together. I felt a real connection to him because he's my age. It all felt very real."
            ],
            "image": "films/aftersun.jpg",
            "metadata": "Release: 2022",
            "type": "FILM"
        },
        {
            "title": "Nickel Boys",
            "description": [
                "Very upsetting film about a segregated youth detention centre where horrible shit went down. POV camera the whole time makes it all feel like it's happening to you."
            ],
            "image": "films/nickel-boys.jpg",
            "metadata": "Release: 2025",
            "type": "FILM"
        },
        {
            "title": "Mario & Luigi: Brothership",
            "description": [
                "This soundtrack is definitely the biggest and most pleasant surprise of the app so far. I honestly thought it would be super generic music, similar to Princess Peach Showtime or something, but actually this music is gorgeous! You can tell from the soundtrack alone that the game was made with love, which is very important to me. The strength of these tracks is so good that I'm lowkey thinking about playing the game because of it, even if I was never a bit fan of the series (well I only ever tried Superstar Saga).",
                "The battle theme is insanely good, and some of these tracks have stunning chord progressions (my weakness), like 'An Afternoon on an Islet' - what an incredible little tune. I was totally ready to dismiss this soundtrack but I've listened to the whole thing twice in one day and I have to say I love it."
            ],
            "image": "music/nintendo/mario-luigi-brothership.jpg",
            "metadata": "Platform: Switch, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Fire Emblem: Path of Radiance",
            "description": [
                "I have always felt like this and Radiant Dawn's soundtrack sound a bit cheap and tinny thanks to their choice of orchestra sounds. Maybe it would slap more with a real orchestra but alas the game came out in 2005. Although all my actual favourites are on the Radiant Dawn soundtrack, there are still a whole bunch of great tracks here too. And even though a lot of the music sounds the same, there is some very special music here.",
                "Some of the battle music is very lengthy and epic and multi-phased (thinking about the amazing 'Crimea Attacks' - which features in the Subspace Emissary!). Then you've got 'Against the Black Knight' which is so fucking good and perfect music for fighting an unbeatable foe. And there's this horrible character called Oliver who has his theme played on the harpsichord which is such a vibe. It's giving Castlevania and I love that."
            ],
            "image": "music/nintendo/fire-emblem-path-of-radiance.jpg",
            "metadata": "Platform: Gamecube, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Wii Party",
            "description": [
                "We are treated to some more obscure Wii-era vibes with this game that probably nobody played. Deep breaths, there's no point being upset about it, I'm sure the actual good game soundtracks will all come in 2026. This one is a bit of a slog, similar to Mario Party, but there are some gems in there. Some of these tracks like 'Garden Gridlock' really evoke 2007 hard."
            ],
            "image": "music/nintendo/wii-party.jpg",
            "metadata": "Platform: Wii, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        }
    ],
    "id": "3615d5cc-d820-4871-b49a-fac4560c3e67"
}