{
    "timestamp": "22-09-2025",
    "title": "My first newsletter",
    "description": [
        "Hello visitors to my website, welcome to my new newsletter! By popular demand, I have made available all the changes to the website as they come, you don't have to come and check it yourself every time.",
        "It's currently September 2025, around 9 months since I started working on the website, so these newsletters won't contain stuff I wrote before then. I think that just means that there is a treasure trove of stuff on here for those who want to go diving. But at least you'll be informed on any new things I'm up to.",
        "Working on this website has been such a highlight of the year. It's the first time I've ever actually enjoyed recreational programming! As an added bonus, I learned a ton about web development which is literally useful for my job.",
        "2025 is making a strong case for being the best year of my life so far, which is very exciting. Getting a boyfriend, having an unforgettable trip to Mexico, and the release of the Nintendo Music App - so much magic has happened this year!",
        "Anyway, here is a list of new things I've posted to the website recently. I'm not sure how often I will do these newsletters."
    ],
    "entries": [
        {
            "title": "The Rogue Prince of Persia",
            "description": [
                "Fab recommended me this game on his Gamepass and I gave it a go. It's a roguelite that's just the same as Dead Cells, which I never really played. I really didn't like the corporate vibe of the game. The music sounds like generic 'middle eastern' music for an epic blockbuster film. I also feel like the animations are a bit off. The artstyle is good though! They had a vision, that's for sure. But something about playing this while playing Silksong makes it feel so clunky and shit in comparison. I'm looking forward to playing Hades 2 later this year though!"
            ],
            "image": "assets/games/rogue-prince.jpg",
            "metadata": "Vibes: 3, Gameplay: 5, Platform: Xbox Gamepass, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "Donkey Kong '94",
            "description": [
                "This gameboy game has a lot going for it! I've never seen a gameboy game with this many movement options. You can do cool flips if you change direction right before jumping, and you can jump on your head and hop off higher too. Then there are just a bunch of cool levels, like little puzzles to work through. It's honestly great."
            ],
            "image": "assets/games/donkey-kong-94.png",
            "metadata": "Vibes: 5, Gameplay: 7, Platform: Gameboy, Release: 1994",
            "type": "GAME"
        },
        {
            "title": "Blue Prince",
            "description": [
                "Daaaaamn this game is so good! This is another one of those rare information games where you have to understand stuff about the lore and how things work in order to progress. I read somewhere people call them 'Metroidbrainias' which I thoroughly enjoy. Although this game is actually a roguelike! You go through a explore this mansion by drafting new rooms as you go. Each room is full of secrets about what's actually going on and it makes you want to learn everything about the game.",
                "At the time of writing this I found the 46th room and decided to call it a day because the scope of the game is terrifying. I had many amazing eureka moments throughout my playthrough but one of them was learning about a crazy chess puzzle, thanks to happening to have the device you need to light candles on me when I finally got the basement key and was able to go down the fountain to the special area at the back. When I saw that those notes I had made about chess pieces in different rooms were about to be used... wait I have to draft them ALL? On top of this, my mate Rodrigo revealed at this point that he had over 150 hours in the game. For my sanity and my safety, I have to say no to the chess puzzle. I'll probably just get another sanctum key anyway, and that puzzle where I have to learn about all the history in order to make those sigils, my GOD. I wrote like 20 pages of notes for this, and I would have needed a new book to solve that one.",
                "Anyway shout-outs to this game. So many highlights. I loved the logic puzzles, Alzara, the Aquarium puzzle, the computer system, the excitement of going to a brand new room. So much to enjoy!",
                "I highly recommend this puzzle game! Puzzle games are the best!"
            ],
            "image": "assets/games/blue-prince.jpg",
            "metadata": "Vibes: 10, Gameplay: 10, Platform: Playstation 5, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "AirBlade",
            "description": [
                "I randomly remembered this old Tony Hawk's rip off that I played at some point when I was younger. I was so impressed that you could skateboard with a hoverboard! I thought it was a revolutionary idea. Looking back, it's literally just a normal skateboarding game."
            ],
            "image": "assets/games/airblade.jpg",
            "metadata": "Vibes: 5, Gameplay: 3, Platform: PlayStation 2, Release: 2001",
            "type": "GAME"
        },
        {
            "title": "Desktop Destroyer",
            "description": [
                "I saw an image of the hammer from this game and I was launched back into the past, kinda like when you smell something from your childhood and you have this moment where you are suddenly transported back. I used to love destroying my desktop with termites, flamethrowers and chainsaws and was endlessly entertained by it. It's a real blast from the past."
            ],
            "image": "assets/games/desktop-destroyer.jpg",
            "metadata": "Vibes: 9, Gameplay: 1, Platform: PC, Release: 1999",
            "type": "GAME"
        },
        {
            "title": "Painted Boats",
            "description": [
                "Read about it in the Stoke Bruerne narrowboat museum when we had our boating holiday. Cool history lesson about life on canalboats before it became a tourism thing"
            ],
            "image": "assets/films/painted-boats.jpg",
            "metadata": "Release: 1945",
            "type": "FILM"
        },
        {
            "title": "Moonstruck",
            "description": [
                "We watched this because it has Cher in it but were horrified when the heart-throb man on the film turned out to be horrible Nicolas Cage. Cher is beautiful but the film aged badly"
            ],
            "image": "assets/films/moonstruck.png",
            "metadata": "Release: 1987",
            "type": "FILM"
        },
        {
            "title": "Cancionera",
            "description": [
                "Wow, after loving the previous album so much, here I am again, my world rocked from another Natalia record. In this one, it feels like she's playing the role of an alter-ego called 'cancionera'. Upon closer thought I realise she's talking to the version of herself which is a famous singer. Sometimes it feels like the songs are directed to another person but what if it's just her? She's got these beautiful upbeat and happy songs like 'Cocos en la playa' which feel more like putting on a smiley face to deal with the sad feelings. It feels like she's coping. In fact that track feels more like a 'fuck this I'm going to the beach' because she's tired of social media and fame and all that shit. Instead she's gonna go smoke a joint on the beach, get naked and chat with the moon. 'El Coconito' is literally about wanting to feed corn to a turkey but there's no corn. But she also bares all on the sad songs, which I love the most because I'm a sucker. 'Luna Cresciente' the perfect example: vibes-wise it feels like a huge black bird flying in the night. It's a song about longing and then sinks into this beautiful outro track. I love it. I love this whole album, it's different from the previous one but equally as stunning and the fun songs equally as fun. Each time I listen to it, I love it even more. I've even gone a compiled a list of things I love most about each track - here they are! Apertura Cancionera - starting off the album with 8 seconds of silence. Cancionera - the part when the piano solo comes in, delicious. Cocos en la Playa - the porrito reveal. Como Quisiera Quererte - when she screams 'todas mis golondrinas van confudidas al mar! Amor Clandestino - the switch from minor to major with the cheeky knowing looks on their faces. Mascaritas de Cristal - when she leans forwards and gets to the point: 'quiero ver zu verdad'. El Coconito - the gymnastics they do with their mouths on 'pero ahora no hay'. El Palomo y La Negra - just that it's a party in the middle of the album. Cariñito de Acapulco - when she calls out 'Ay mamita Guadalupe!!'. La Bruja - singing 'me agarra la bruja' like she's about collapse. Luna Creciente - 'borracha de amar' over the amazing 3 time guitar parts from Hermanos Gutierrez. Lagrimas Cancionera - calm down with a lengthy orchestral piece, love when the voice comes in."
            ],
            "image": "assets/music/albums/natalia-cancionera.jpg",
            "metadata": "Artist: Natalia Lafourcade, Release: 2025, for a list of favourite tracks, please visit the albums page!",
            "type": "ALBUM"
        },
        {
            "title": "Donkey Kong Bananza",
            "description": [
                "I was so shook when they released this special release of 9 tracks from the game as part of a promotion for the DLC on a Saturday! Talk about unpredictable. I can't help but ask myself why they didn't just release the whole soundtrack! Whatever, I need to move on. This game has some great bops in it. It's not on the level of Tropical Freeze but we do have the incredible Zebra Bananza at least."
            ],
            "image": "assets/music/nintendo/donkey-kong-bananza.jpg",
            "metadata": "Platform: Switch 2, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Super Mario Galaxy 2",
            "description": [
                "I didn't truly appreciate until this release that this soundtrack is largely orchestrated! It's a noticeable upgrade from the first game in many ways. Honestly when I was younger I didn't love this game as much as the first and I kinda slept on the soundtrack. Listening to some of Mario Kart World's remixes of these tracks opened my eyes to how great they are. For example, 'Yoshi Star Galaxy' is a huge bop, and you know what it was composed by none other than Koji Kondo! It all makes sense. Also, Digga-Leg is a total sleeper hit. Otherwise this game features a lot of the same kinds of levels as the first one, a new beach level, a new fire/ice level, a new lava, desert level etc, and I'm impressed that they managed to write a different tune with the exact same vibe for them. There are also two secret peaceful tracks which have no right being as lovely as they are, 'World 3' and 'Slimy Spring Galaxy'. Little moments of beauty in the game, love it."
            ],
            "image": "assets/music/nintendo/super-mario-galaxy-2.png",
            "metadata": "Platform: Wii, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "1Q84",
            "description": [
                "This book is a gripping tale of two seemingly unrelated people living in a world where things don't quite seem right. Illogical things start happening, like a second moon appearing in the sky. What are you supposed to do when that happens and nobody is saying anything about it? From there the books descends into conceptual madness. There is some weird sex stuff but by the end you get used to it and realise it's part of the whole vibe. The characters are so extreme and the concepts so wild (I mean just look at the word 'Air Crysalis') that it's kinda hard to put down. It's all quite abstract and I'm honestly still trying to piece together what exactly it was about. I still really recommend it though, if nothing else but for the mental images it produces as you read it."
            ],
            "image": "assets/books/1q84.jpg",
            "metadata": "Author: Haruki Murakami, Release: 2009, for the spoiler discussion please visit the books page!",
            "type": "BOOK"
        },
        {
            "title": "There Existed an Addiction to Blood",
            "description": [
                "Very dark and harrowing hip-hop/noise music"
            ],
            "image": "assets/music/albums/clipping-existed.jpg",
            "metadata": "Artist: Clipping.",
            "type": "CD"
        },
        {
            "title": "Wintersadness",
            "description": [
                "A friend in Berlin released this EP on CD! Got it at her concert in Kotti"
            ],
            "image": "assets/music/albums/gemma-winter.jpg",
            "metadata": "Artist: G'Emma",
            "type": "CD"
        },
        {
            "title": null,
            "description": [
                "Whale got me this as a gift"
            ],
            "image": "assets/misc/characters/deco/kazuya1.jpg",
            "metadata": null,
            "type": "CHARACTER_DECO"
        }
    ],
    "id": "d269bbc3-1aea-4df2-b825-0c98f74a483e"
}