{
    "timestamp": "30-01-2026",
    "title": "Moved by music",
    "description": [
        "As I listen to all my favourite songs, working hard on the 'daily soundtracks' part of this website, I am once again reminded that I am moved by music so easily and so regularly. I've already prepared song recommendations all the way up until July and it has been an utter delight. Whenever I remember a great song, I go down a rabbit hole and fill up the page with more and more of my favourite music. I've also realised that making the music player has been great for me, because it's a way I can listen to all my favourite tracks in a way that I would like. I have every intention of going crazy with this and letting hundreds of amazing songs and tracks fill up this raspberry pi, if nothing else for me, so that I can listen to it whenever I want.",
        "I nice thing about this website is that it's largely separated from the wider internet (with the exception of Cloudflare - they do my DNS and security and it's simply not worth doing that myself). People are talking about doomsday scenarios where services like Spotify disappear and suddenly all the music files are gone. We will be fine, there are cool initiatives (check out Anna's Archive, recently sued by Spotify) who are scraping the company data for public use. But it just feels nice to be starting my own little collection of beautiful little music, which will always be there for me. And if the internet goes down, I will just host it raw on my raspberry pi for anyone who's in my apartment. It'll be like a CD collection.",
        "This week, Victor broke up with me. It's been a real emotional rollercoaster. But I've listened to a lot of music, and feeling more sensitive than usual, have found myself ultra-connecting with it all. Any remotely sad song, even if it's completely unrelated to my life, I've been shedding tears. On the day of dumping it was 'To Be Loved' by Adele. The next day it was 'Lord Let That Tesla Crash' by my new obsession CMAT, which isn't even about love and relationships, but I still cried. Today I cried to 'The Linden Trees Are Still In Blosson' from Jens Lekman which is entirely unrelated but god. It hits.",
        "My main coping mechanism for bad times is to be very productive and do many things, which is why I'm happy to say that I finished a text-based adventure that I've been working on since forever! I finally got round to writing all the various endings and trying to bring it all together. It was tough and I don't think I'm a good writer, but it's quite short, and it might be a fun 15 minute read for you! It's available on the 'miscellaneous' section of my website. If you spot some typos, please let me know. If anyone is interested in also making one, I used a program called 'Twine 2' which is great, I really recommend it."
    ],
    "entries": [
        {
            "title": "Hades 2",
            "description": [
                "I'm enjoying the hypnotic loop for this game! It's hard to deny that Hades is one of the very best roguelikes out there, in a world saturated with roguelikes. It's polished, it's satisfying, and it really makes you want to keep playing.",
                "The story and world-building is nice. I like that they made all the Greek gods and characters from mythology just insanely hot. I like that a frog can follow me around now, and it's cool that you can go up as well as down.",
                "Part of me feels like I'm just going through the motions playing this. Hard to describe why."
            ],
            "image": "games/hades-2.jpg",
            "metadata": "Vibes: 9, Gameplay: 9, Platform: Switch 2, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "It Was Just an Accident",
            "description": [
                "Really great film with a horrible premise (it's about torture) but it's full of good people and a really thrilling story."
            ],
            "image": "films/it-was-just-an-accident.webp",
            "metadata": "Release: 2025",
            "type": "FILM"
        },
        {
            "title": "Heated Rivalry",
            "description": [
                "This outrageous show about gay ice hockey players features so much hot gay sex between muscular men that it's practically porn. I totally understand why this show is so popular with women! What I loved about it was that there was no major trauma."
            ],
            "image": "films/heated-rivalry.avif",
            "metadata": "Release: 2025",
            "type": "TVSHOW"
        },
        {
            "title": "Flash Gordon",
            "description": [
                "Terrible film but it was fun to laugh at it for an evening. There were some great costumes. America was America-ing hard on this one."
            ],
            "image": "films/flash-gordon.jpg",
            "metadata": "Release: 1980",
            "type": "FILM"
        },
        {
            "title": "Songs From The Big Chair",
            "description": [
                "I've been loving this classic album from Tears for Fears! There are the famous songs like 'Shout' and 'Everybody Wants To Rule The World' and they're great but it's all about the album tracks. My favourite is 'The Working Hour' with its amazing saxophone. It's such a great vibe. You've also got the amazing 'Head Over Heels' which has such an amazing ending, followed by a very ambient and cerebral final track. It's such a great album for the end of the evening."
            ],
            "image": "music/albums/tears-songs.jpg",
            "metadata": "Artist: Tears For Fears, Release: 1985, for a list of favourite tracks, please visit the albums page!",
            "type": "ALBUM"
        },
        {
            "title": "WarioWare, Inc.: Minigame Mania",
            "description": [
                "To think that they put WarioWare on here... amazing. Honestly as a soundtrack it's pretty unlistenable thanks to the vast majority of songs being just 4 seconds long. But there are some diamonds in the rough! The main title and menu themes are classics, thanks to smash, but the best song is 'Drifting Away' which is several minutes long and cycles through a bunch of different musical styles. It had compressed singing voices and it just sounds cute. It's honestly an all-time fave.",
                "Also I didn't realise until listening to this just how much Wario Land 4 music is in there! I didn't know this game came out two years after that. It means we get a little of my all-time favourite Wario-themed track 'Crescent Moon Village' in the 'Elevator: Results' track. Result!"
            ],
            "image": "music/nintendo/warioware-inc.jpg",
            "metadata": "Platform: GBA, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "The Legend of Zelda: Phantom Hourglass",
            "description": [
                "The tinny DS soundfont is back to serve bass-less budget versions of Wind Waker music! I have to say even though I have fond memories of the game, the music really leaves a lot to be desired. The main offender is the dungeon music, a 30 second loop that is played for all 6 dungeons. It's terrible and an affront to Zelda music.",
                "In an effort to be at least a little bit positive, Linebeck's theme slaps!"
            ],
            "image": "music/nintendo/zelda-phantom-hourglass.jpg",
            "metadata": "Platform: DS, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Handling power tools",
            "description": null,
            "image": "gallery/treeresa.jpg",
            "metadata": "For anecdotes about the pictures, please visit the gallery page!",
            "type": "GALLERY"
        },
        {
            "title": null,
            "description": [
                "Marta had these cool pens that you can use to decorate plates and now I have this gormless-looking Mii Gunner plate"
            ],
            "image": "misc/characters/deco/miigunner1.jpg",
            "metadata": null,
            "type": "CHARACTER_DECO"
        }
    ],
    "id": "6036307e-5252-4d27-9d94-9a698d7591eb"
}
