{
    "timestamp": "25-11-2025",
    "title": "Entitled to Nintendo Music",
    "description": [
        "Hey everyone, it's me again. Quick update about the website: I added some TV shows to the Films section. I also made a tierlist of every pokemon! It was a lot of fun and it took me a whole morning. I'm thinking about slowly ranking the pokemon within the tiers later, but we'll see. Interestingly, for that page I added over 1000 images to the website and it hit me that this website in total has around 3000 images, and a bunch of mp3s on the music page. I then spent an entire afternoon and evening reorganising my images and assets and now the website is lightweight again! Even myself I feel a little spring in my step, like a burden has been lifted from my shoulders. Anyway, on to today's main topic...",
        "As regular visitors of this site might know, my year has been drastically improved by the appearance of the new Nintendo Music App. One of the biggest parts of this site is my weekly reviews of each new release. I love it so much, I've even started observing a strange kind of mysticism in which the kind of soundtrack released on a Tuesday dictates what kind of week I'm going to have. As somebody who doesn't tolerate astrology I know that it's bullshit but I can't help but think about it whenever I am delighted or disappointed by a particular release.",
        "It's a very niche interest. Not many people I know love Nintendo music to the extent that I do. It means it's a struggle to find people to be enthusiastic about the release on Tuesday with. That's why I'm eternally grateful to my two mates from home, Oscar and Andrew, who are actually willing to discuss and rate each soundtrack when it comes! We have a little Whatsapp group for it and I honestly love it so much. As I write this, I'm listening to the Wii Fit soundtrack, which is full of surprising bangers, thinking that my week has the potential to be 'surprisingly good' and in general appreciating this era of Nintendo music vibes. It's so good.",
        "Recently I found myself wondering if anyone else out there is living their lives week to week like me, just waiting for the next release. Surely there are others who have spend the last decades lamenting the lack of official releases of these classic soundtracks? Surely other people are as excited as me by having a full on feature-rich app with a bunch of these OSTs on them, having them drip-fed to us? So I went onto reddit.com.",
        "I've been on reddit.com a couple of times and I almost always have a bad time. I get that it has real people on there, one of the few places left that does. But everytime I visit I'm reminded how they're all Americans there, and they're all Negative Nancies. They just complain! I found a subreddit r/nintendomusic where there is a bunch of spam, and then each week a thread about the week's release in the app. Excited I clicked on Wii Fit's release and all I see are a bunch of sarky comments about they don't get a real soundtrack like Mario or Zelda, how shit the app is, etc. etc.",
        "This bothers me so much because a) the app comes free with the already insanely cheap Nintendo Switch Online subscription. They were paying for this thing already and then bam, free music app to go with it. Then with each release, they go onto reddit.com and complain! They feel entitled to more. Why not release the app with all the soundtracks on it already? How dare they release Wii Fit when Majora's Mask isn't even on there yet? These keyboard warriors need to calm down, do some deep breathing and just enjoy the Wii Fit soundtrack.",
        "I mean I too have been disappointed by the initial catalog and certain releases (looking at you OOT 3D and Metroid 2) but I've learned to appreciate what I'm given. Occasionally there is an amazing release (Paper Mario, TOTK) which catapults me into two weeks of reliving those games and I love it so much. If they gave us everything from the beginning for free, I don't think I would be as hooked on the app as I am. Also, I have to say that as an app developer myself I get it. Making features takes ages and writing content takes ages. These soundtracks all have screenshots as artwork, playlists associated with each track, and all the work behind getting the soundtracks themselves. It's a bunch of work and I get it.",
        "Maybe people feel entitled to this music because it's all available on Youtube for free already. That's fair enough, and to be fair, only on this one subreddit I actually found any discussion on it. I think most people completely ignore this app. Anyway, at least there's one website covering these important releases!",
        "Here's hoping that it continues, becoming an exhaustive bank of great music over the coming years. I'll be there every step of the way. Love live the Nintendo Music App!"
    ],
    "entries": [
        {
            "title": "CloverPit",
            "description": [
                "A cool vibe from a hellish gambling game where it's not actually about gambling, it's about optimising and finding bottlenecks and scaling numbers. It's actually just Balatro. It's Balatro all over again with a slot machine instead of poker hands. Fab and I got a really good run on our first run because we got some great synergies with diamonds. I'm interested to keep playing to know if it's possible to leave the room but something tells me it's not. Cool game, just would have been better if it were released BEFORE Balatro..."
            ],
            "image": "games/cloverpit.jpg",
            "metadata": "Vibes: 9, Gameplay: 8, Platform: Xbox Gamepass, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "Kirby's Dream Land 2",
            "description": [
                "This is the kirby game with the 3 animal friends. You spend most of the game riding them and honestly I think it detracts from the experience a bit."
            ],
            "image": "games/kirby-dream-land-2.jpg",
            "metadata": "Vibes: 7, Gameplay: 5, Platform: Gameboy, Release: 1992",
            "type": "GAME"
        },
        {
            "title": "Survival Kids",
            "description": [
                "I saw that they realised a newer Survival Kids game, but only on the Nintendo Switch Online did I see that it's a long series with a Gameboy release in 1999! Turns out, this game might be the first ever survival-type game. Probably the reason why games like 'Don't Starve' exist. So for science I booted it up and gave it a good try.",
                "First, I was pleasantly surprised by the banger music. Always a great sign when the OST ist good. I was looking for materials while grooving to the max. It's almost as if the child that I'm playing as hasn't been stranded alone on an island! Considering it's a game about not dying, it's surprisingly peppy and fun. The intro story was funny, it said the child and their dad were the only crew on the boat when it was shipwrecked, and then it shows just a massive cruise ship sinking. No wonder it sank - there were only two people on board!",
                "I didn't make it far in the game, regrettably. It hit me that there's a reason that I didn't enjoy 'Don't Starve'. At any moment, my hunger or thirst could drop to zero and then bam, I have to start the whole game again! That is so stressful. And the game really doesn't do any signposting at all. I don't think it's possible to actually complete it without some kind of guide."
            ],
            "image": "games/survival-kids.jpg",
            "metadata": "Vibes: 7, Gameplay: 4, Platform: Gameboy, Release: 1999",
            "type": "GAME"
        },
        {
            "title": "Kirby's Dream Land",
            "description": [
                "I managed to beat this entire game while Victor took the dog out! It was delightful, although actually a little harder than your usual Kirby game because there were no broken copy abilities. Great to see the origin of so much Kirby stuff. Loved the King Dedede fight in which he used dash attack, up special, f-smash, neutral special. Great. Music is also 10/10."
            ],
            "image": "games/kirby-dream-land.jpg",
            "metadata": "Vibes: 8, Gameplay: 6, Platform: Gameboy, Release: 1992",
            "type": "GAME"
        },
        {
            "title": "Ristar",
            "description": [
                "I had vaguely heard of this game so I gave it a go on the Nintendo Switch Online and was delighted by the amazing soundtrack. The game itself was quite forgiving for a mega drive game! Although as a platformer it's nothing special. I'm grateful that I now know about its great OST though."
            ],
            "image": "games/ristar.jpg",
            "metadata": "Vibes: 8, Gameplay: 6, Platform: Sega Mega Drive, Release: 1995",
            "type": "GAME"
        },
        {
            "title": "Ecco the Dolphin",
            "description": [
                "I've been aware of the soundtracks of these games, made by Tim Follin, one of my favourite composers, for a long time. They are baffling, expansive and vibe-heavy games in which you play as a dolphin! Truly a first in the dolphin genre. I also heard that they are hard as balls so I was curious, and indeed, it's hard as balls. It's totally confounding and has no information about where to go or what to do. You just swim around and die to random things all the time. Definitely the kind of game to just listen to the soundtrack to and not actually play."
            ],
            "image": "games/ecco-the-dolphin.jpg",
            "metadata": "Vibes: 9, Gameplay: 4, Platform: Sega Mega Drive, Release: 1992",
            "type": "GAME"
        },
        {
            "title": "Streets of Rage 2",
            "description": [
                "Ever since falling in love with Streets of Rage 4, I've been meaning to get into this game as well, and I'm so glad I did! The reason to open up this game on the Nintendo Switch Online is so you can listen to one of the best soundtracks of all time. It's inspired by house and techno music and each track is a fucking banger. I have literally DJ'd some of these tracks before (Go Straight and Dreamer) they are that good. They hold up today!",
                "The opening music is the biggest vibe ever, although booting up the game I realised you can't actually listen to the whole opening track before the opening ends. Devastating. But it's fine because it gets straight into 'Go Straight', the most incredible first level music ever. Perfect music to beat up goons to. It's a bombastic house anthem that turns into the jazziest remix of itself when you enter the bar halfway through the level. Then in later levels you have 'Slow Moon', 'Dreamer'... just banger after banger.",
                "The game itself is doable! I got to stage 7 or so using my fundamentals from Streets of Rage 4 which felt great. I quickly realised Blaze's flip move does crazy damage. But the difficulty curve is tough, it doesn't fuck around. I think it's fine because back then these arcade-style games needed to have that replayability, and this really does. You play over and over until you know all the levels back to front, and can beat them with all the characters. Part of me wishes I was into this game as a child.",
                "It also has a really lovely co-op mode! Victor and I played together for a bit and it was awesome. Super fun to play with a second person."
            ],
            "image": "games/streets-of-rage-2.webp",
            "metadata": "Vibes: 10, Gameplay: 9, Platform: Sega Mega Drive, Release: 1992",
            "type": "GAME"
        },
        {
            "title": "One Battle After Another",
            "description": [
                "Such a great film. Thriller that takes you places! So many amazing moments and great characters. I'm going to chuckling about Christmas Adventurers for a while now."
            ],
            "image": "films/onebattle.jpg",
            "metadata": "Release: 2025",
            "type": "FILM"
        },
        {
            "title": "Frankenstein",
            "description": [
                "They decided to make the monster hot and I don't understand why! I thought it was all pretty dumb. I guess it was entertaining"
            ],
            "image": "films/frankenstein.jpg",
            "metadata": "Release: 2025",
            "type": "FILM"
        },
        {
            "title": "Absolutely Fabulous",
            "description": [
                "Love love love this show. Patsy is everything. It's so outrageous and camp and funny and I'm obsessed. Some stuff has aged very badly but it's worth it."
            ],
            "image": "films/abfab.jpg",
            "metadata": "Release: 1992-2004",
            "type": "FILM"
        },
        {
            "title": "Super Mario Party Jamboree",
            "description": [
                "Wow this soundtrack really is the definition of 'All Filler No Killer'. I make the time to listen to each soundtrack beginning to end but this is the first time since Splatoon or Sword/Shield I'm thinking about skipping out on that duty - because it's over 6 hours!",
                "Who am I kidding I'm spending all of this Tuesday evening listening to it. The music isn't memorable but there are some gems amongst all the dirt."
            ],
            "image": "music/nintendo/jamboree.jpg",
            "metadata": "Platform: Switch, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Wii Fit",
            "description": [
                "At first I rolled my eyes at this release but then I remembered that the Wii Fit soundtrack slaps. Of all the Wii-era Nintendo 'frutiger aero' music there is, this soundtrack is one of the most quintessential. Some of these tracks evoke the Nintendo Wii so hard it hurts. When I have those days when I just want to soak myself in that nostalgia, I know I can just turn on the top tracks from this soundtrack and be warped back to 2008.",
                "Some of these tracks are so outrageously Wii-era that it hurts. The best example is 'Tilt City', this track blew me away. It sounds like what Windows Vista looked like. Then there's 'Rhythm Parade (Advanced)' - the beginning I don't love but then it just keeps developing and changing throughout its almost 4 minute runtime. It's so good. And what is going on with 'Bird's-Eye Bull's-Eye' and why does it sound like that? Why is it so good? That track sounds like it could be from Pikmin 3. Also, the original credits theme so weird and hypnotic, almost creepy. I can't get enough of it.",
                "Some of the not amazing but still quite good ones like 'Hoop Dance' and 'Skateboard Arena (Free Mode)' got banger remixes in Smash. They really outdid themselves for those, you should go listen. We should all be selecting more Wii Fit music when playing on Small Battlefield.",
                "I need to express my dismay at one small thing though. Arguably the biggest banger of the soundtrack, 'Advanced Step' got shafted in this release by being the in-game version. It's slow as fuck and speeds up half way through. PLEASE do yourselves a favour and listen to the proper one: https://www.youtube.com/watch?v=4_Ir6zA10w0. This is the version they included in smash. It's a huge hit!"
            ],
            "image": "music/nintendo/wii-fit.jpg",
            "metadata": "Platform: Wii, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        }
    ],
    "id": "391b4077-e842-42b4-9622-10637e63d987"
}