{
    "timestamp": "20-12-2025",
    "title": "Shoutouts to 2025",
    "description": [
        "Merry Christmas! Welcome to the last newsletter of the year. I'm super happy to present my end of year list of video games. You can find it by going to the 'games' section and clicking '2025'. It's in order and yep, I put Hollow Knight Silksong at the top. What an amazing game!",
        "I love lists, and ultimately that's why this website exists. It just feels so satisfying knowing I'm documenting everything in my life here. Did you know I also keep a daily diary? It's a little too personal for this website but I really recommend all readers to start one. It helps with the feeling of life running away from you.",
        "It's been a particular pleasure to go to such lengths to document my life this year because this year is definitely the best of my life. It started with a super fun and life-changing trip to Mexico in January, then I continued working my excellent job which I really appreciate. I got a boyfriend! 2025 is also the year of the Nintendo Music App, which I have loved so much. It's something I've wanted since I was a child. And it's the year of this website! Working on this website has been a great learning experience and so so so fun. I'm so proud of it.",
        "You guys have any new year's resolutions? Mine is to stop saying 'having time' and instead say 'making time'. I think saying 'I will try to make time for that' sounds more positive than 'I hope I have time for that' and will go far towards making me sound less like the calendar bitch that I actually am. My other resolution is to take more holidays from work when I feel like I have no time. There's no big Mexico month this year so I'll be focus on me a bit more this year.",
        "See you guys next year!"
    ],
    "entries": [
        {
            "title": "Metroid Prime 4: Beyond",
            "description": [
                "This game is a true continuation of the excellent Metroid Prime series! Music and atmosphere is 100% there. As I write this I'm only half-way through the game so take this with a grain of salt for now, but it's great so far.",
                "I really appreciate that it takes place on the planet where the architecture is so yonic! Yonic is a fun word that means 'relating to vaginas and stuff' (as opposed to phallic). Every door, switch, building looks like a vagina. Samus is going around controlling clits with her new psychic powers and you can't convince me otherwise. The game features some weak men who speak at you with American accents, but Samus doesn't even bother replying, which I really appreciate.",
                "I also enjoy how so much random-ass shit happens in this game. When you beat one of the yonic bosses and then this pedestal appears which transports Samus to a dream realm where she grabs a magic key and then curls into a ball and learns how to boost up halfpipes. All that happens within like 2 minutes of each other.",
                "There's also a desert area where you drive around on a motorbike, a bit of a departure from the series, and it's fine, I guess. I actually appreciate how it makes it a bit more feasible to have these different climates (jungle, icy mountain, volcano) all in the same place. In Metroid Prime 1 you just hop between these biomes in a couple of seconds. That always bothered me! Anyway, I'm excited to see how this game develops, for now I'm excited to keep playing over Christmas."
            ],
            "image": "games/metroid-prime-4.jpg",
            "metadata": "Vibes: 10, Gameplay: 9, Platform: Switch 2, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "Keeper",
            "description": [
                "This game is like concept art come to life. It's got that Gris/Ori vibe of being beautiful for the sake of being beautiful. You play as a sentient lighthouse, which is a great premise, but ultimately it's another walking simulator with light puzzle elements. This one is different from other ones because it has amazing colours and psychedelic visuals. But ultimately, it's more of this same stuff. It makes me think that we really have enough indie games these days. Devs really have to stretch the imagination to think of new premises for new beautiful walking simulators these days.",
                "I think it would be good to play this while on mushrooms."
            ],
            "image": "games/keeper.jpg",
            "metadata": "Vibes: 9, Gameplay: 4, Platform: Xbox Gamepass, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "Kirby Air Riders",
            "description": [
                "So delightful to play another Sakurai game! The smash vibes are very strong in this game. The soundtrack is pretty good, with an absolute banger of a menu theme, and the levels you race on are crazy cool. You can play as Rick the hamster, which is amazing, but I'm a little broken-hearted that you can't play as Kine the fish.",
                "Controlling is kinda hard! This isn't baby mode like Mario Kart World (which I loved), you have to get a feel for it. Having both sucking in enemies and drifting being the same button is kinda confusing though. Also, there's an attack you can do if you wiggle the stick, which confuses me quite a lot. I really connected with the Road Trip mode, which in effect taught me the game. Thanks to that I tried out all the machines and got a hang of the drifting. I think my favourite is the Rocket one where you have to charge to the max each time. It's extreme but satisfying!"
            ],
            "image": "games/kirby-air-riders.jpg",
            "metadata": "Vibes: 9, Gameplay: 8, Platform: Switch 2, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "The Secret Agent",
            "description": [
                "Vibes-heavy Brazilian thriller featuring (truly) the best female characters and the worst male characters. I struggled to keep up with the plot and the events towards the end felt a bit random."
            ],
            "image": "films/secret-agent.jpg",
            "metadata": "Release: 2025",
            "type": "FILM"
        },
        {
            "title": "Bugonia",
            "description": [
                "Oh my god I loved this film so much. It was wild and hugely entertaining. Conspiracy theorist meets powerful CEO and the dialog between them is just perfect. Best ending ever"
            ],
            "image": "films/bugonia.jpg",
            "metadata": "Release: 2025",
            "type": "FILM"
        },
        {
            "title": "Super Mario Land",
            "description": [
                "This gameboy soundtrack actually has some classic bangers. It has inspired me to make a 'best bleeps and bloops' playlist. Birabuto is the classic but I am loving Muda Kingdom!"
            ],
            "image": "music/nintendo/super-mario-land.jpg",
            "metadata": "Platform: Gameboy, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Yoshi's Crafted World",
            "description": [
                "Wow this soundtrack is tragically bad. They've gone for the little kid aesthetic to the max, recorders and all, and it honestly sounds terrible. Lowlights include 'Yoshi's Expedition' and 'What's It Gonna Be?', both of which sound like infants trashing a music schoolroom.",
                "The soundtrack has two saving graces! The uncharacteristic 'A Teeny, Tiny Universe' which is good because it sounds like it came from another game, and the very last track 'Round and Round' which I guess is meant to be a joke but it low-key a bop."
            ],
            "image": "music/nintendo/yoshis-crafted-world.jpg",
            "metadata": "Platform: Switch, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Metroid Prime 4: Beyond",
            "description": [
                "Wow these tracks are super long. I love a lengthy loop, especially when you know that you're gonna be hanging out in a place for a long time. The vibes appear to be there, so I'm excited! At the time of writing, I've just started the game and experienced the majesty of 'Fury Green' in game. I think it's gonna be a banger."
            ],
            "image": "music/nintendo/metroid-prime-4.jpeg",
            "metadata": "Platform: Switch, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Visit to Müritz",
            "description": null,
            "image": "gallery/lake.jpg",
            "metadata": "For anecdotes about the pictures, please visit the gallery page!",
            "type": "GALLERY"
        },
        {
            "title": "Smash Tournament in Frankfurt",
            "description": null,
            "image": "gallery/duckhunt2.jpg",
            "metadata": "For anecdotes about the pictures, please visit the gallery page!",
            "type": "GALLERY"
        },
        {
            "title": "Shoot Your Shot Anthology",
            "description": [
                "Victor got me this amazing CD of cunty pop tracks from the legendary Divine! Perfect for pre-drinks for the party"
            ],
            "image": "music/albums/divine-shoot.jpeg",
            "metadata": "Artist: Divine",
            "type": "CD"
        }
    ],
    "id": "6db10525-053d-4533-9d04-81512b76cb90"
}