{
    "timestamp": "11-10-2025",
    "title": "Fantasy holiday in Mallorca",
    "description": [
        "Hello friends and family, welcome to my second newsletter! If you are receiving a notification about this via RSS, do let me know! I'm curious to see if anyone actually subscribed. So far nobody I've spoken to actually wants to do that.",
        "First I want to tell you guys about a cool new thing on my website. I've now got a section on the homepage with a daily music recommendation! I wanted to make something that changes every day so visiting the site becomes more interesting. I love music so I figured it would be great to give you guys specific tracks for you to listen to. I already have the very extensive 'Albums' and 'Nintendo Soundtracks' sections for your perusal, but this will focus on individual tracks. If you like them, don't be afraid to react to them with the new reactions feature.",
        "My plan is to write them all in advance, and hopefully I'll be able to keep on top of them. If I run out of juice eventually I'll think of something else. As always I love it when you give me feedback about this kind of stuff.",
        "What's been happening in my life lately? Victor and I had a beautiful holiday in Mallorca just this past week and it was incredible. If you know me, you know I talk about Mexico a lot, but the Mexican beaches have nothing on these beaches. Victor took me to all his favourite spots and it was stunning - I'm talking Super Mario Odyssey Seaside Kingdom vibes. One thing I struggled with there was presence of Germans on the island. They are causing many problems there and it was hard to admit that I live in Germany and love it there. I felt quite embarrassed for Germany when hanging out with the Mallorcans.",
        "Otherwise my busy summer is hopefully coming to an end. I regret that I haven't made time for DJing with Weyes this summer, but I've been confronted with being unable to have it all many times this year. But at least I started a new book (Ursula K Le Guin's Earthsea). I look forward to spending more time this Autumn getting into that, completing Hollow Knight: Silksong, and listening to the crap out of the Paper Mario soundtrack. I've also randomly gotten really into doing the daily crossword on the Guardian news app. I've learned so many new words already!"
    ],
    "entries": [
        {
            "title": "Hollow Knight: Silksong",
            "description": [
                "I can't believe that after 7 years we actually got this game, and that it's as good as it is. Shoutouts to the dev team for ignoring the internet's feverish cries and instead taking their sweet time crafting the best metroidvania ever. They let this cook for as long as they needed - I mean they had all that money from the first game so why not! And the result is, they made a huge and beautiful game. And they sold it for just 20€! Incredible stuff. Defy the markets and do the right thing! I guess it's something you can only do as an indie studio if you make a legendary game like the first Hollow Knight.",
                "Playing this has been a total pleasure because at the same time I've watched Victor play the first Hollow Knight. Watching him get immersed into the familiar world of Hollow Knight while I simultaneously jump into the brand new world of Silksong has been amazing because we can compare experiences. This game has so many moments of wonder as you discover a brand new area, desperately looking for a bench or a map.",
                "In the game, you need to climb up what appears to be a mountain, which has a Citadel at the top. You already know there's gonna be a City of Tears-style ruined civilisation in that citadel and this game serves exactly that and SO MUCH MORE! And of course there is an equally rich and dense lore behind all these bugs and insects, just like in the first one. And you get to play as the cute and beautiful Hornet! She feels kinda different and I like it. I also love that she actually speaks! And not only that, but is well spoken. I'm done with silent protagonists. Bring me more protagonists like Hornet, who eloquently talk about smart stuff with NPCs. Yes.",
                "Just like the original game, this game nails the vibe. There is a deep sadness in all of the caves. An almost dead civilisation dragging themselves towards some kind of inevitable doom. Some of the bugs have lost it already, some are nice but struggling. Some are making things work for them in the hellscape. The music reflects all that! The Bone Bottom music, the place where there is the least hope, is so desperately sad. Then you have the incredible Choral Chambers - wow! I haven't sat down to ask myself what kind of chord sequence that is yet but I am entranced. I also adore the music from Greyhome, and weirdly also the strangely beautiful Bilewater - somewhat unfitting music for such a horrible place.",
                "This game will stay with me for a long time. It's an absolute gem! Some of the bosses are really hard but even though that Last Judge one really got me going, none of them have really been UNFAIR unfair. At least not yet. I haven't completed it 100% at the time of writing..."
            ],
            "image": "assets/games/silksong.jpg",
            "metadata": "Vibes: 10, Gameplay: 10, Platform: Switch 2, Release: 2025",
            "type": "GAME"
        },
        {
            "title": "Paper Mario: The Thousand-Year Door",
            "description": [
                "Shoutouts to the Nintendo Music App team - they gave us one of the best video game soundtracks ever!!! I never thought they would actually release it because it's so lengthy. This thing is like 13 hours long! But here we are, it's here, and I've been pumping this music constantly all week.",
                "Where do I start? They have not only faithfully remade all the old music, but they've taken it above and beyond what the original tracks were by using real instruments and adding new sections, extending the loops. The composers clearly did this with a lot of love and respect for the original. Vibes have been preserved!",
                "The battle themes, already 10/10 in the original, now have new 'thinking' variants which are a lot of fun when listening in the game. I love that this has many things like this taken from Origami King (another fantastic soundtrack). Most importantly though, they made 8 different versions of the main battle theme! Huge! Even the few enemies you fight in the snowy area or the Riverside Station get their own music! I love it so much. There are new variations of Rogueport, which are great. And the new piano version of Poshley heights is so good!",
                "Some great examples of extended loops are the 'Mario's House' music which is like twice as long, or 'Twilight Town' which has a beautiful new section. For Poshley Heights they added a jazz breakdown, why the fuck not. Professor Frankly's theme also goes super hard for no reason.",
                "Some tracks just got elevated so much thanks to the new instrumentation. The Macho Grubba battle is suddenly the most intense track in the whole game, wow. The Palace Courtyard at the end of the game is another example. They also saved the otherwise horrible-sounding Gradus battle, and also same for the Pirate's Cave.",
                "They also added new themes entirely for the partner characters and they sound just like Origami King. Even very minor characters get new music! New music for everyone! When did Ms. Mowz's theme go so hard?",
                "There are a few remade tracks which don't live up the original, although it's hard for me to say why in some cases. Rogueport Underground doesn't speak to me so much. The Glitz Pit music has been revamped with an Erhu, this Chinese stringed instrument, giving it an oriental vibe which in opinion doesn't fit at all."
            ],
            "image": "assets/music/nintendo/paper-mario-ttyd-switch.avif",
            "metadata": "Platform: Switch, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Paper Mario: The Thousand-Year Door",
            "description": [
                "What an incredible day. When we were brainstorming soundtracks that would be amazing on this app I hoped more than anything for this! I never truly believed this and its remake would come because of the sheer volume of tracks but here we are, Nintendo have delivered and I am delighted! This is one of my all-time favourite Nintendo soundtracks.",
                "They've done RPGs before but none knock them out of the park quite like this one. For every moment in the game there is new music, resulting in wildly different vibes in different areas. And the games are not your usual Mario levels: desert, beach etc. Chapter 2 launches you into this insane 'Boggly Woods' area which feels more like an acid trip than anything else. The whole section is inspired by pikmin and I'm all for it. Then later you have the very melancholic Chapter 4 with the stunning Twilight Town music. Chapter 6 with its evening on the train vibe is also a 10/10. Then at the very end we are treated to the outstanding 'X-Naut Fortress', which is the biggest of all bops.",
                "There is so much to enjoy here, and this is just the original Gamecube version! They also released the remake's music, which takes this base and goes to the moon with it. I will some of these original tracks are a little better than their remade counterparts. For example I have a soft spot for the Magnus von Grapple battle music in this version, same with Rogueport Sewers."
            ],
            "image": "assets/music/nintendo/paper-mario-ttyd.jpg",
            "metadata": "Platform: Gamecube, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Princess Peach: Showtime!",
            "description": [
                "This soundtrack joins Captain Toad as one of Nintendo's newer, generic soundtracks with little to offer. I guess there are too many games for Koji Kondo to preside over, they can't all be huge hits. I never played this game so I don't have any particular connection to its soundtrack. Listening to it makes me thing that it adheres to its relevant tropes without bringing anything special to the table. The wild west music is like stereotypical wild west, to the point where it's boring. This has nothing on Desert Kingdom from Mario Odyssey. That being said, I did really enjoy the spy music from the 'dashing thief' level."
            ],
            "image": "assets/music/nintendo/princess-peach-showtime.jpg",
            "metadata": "Platform: Switch, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Zelda II - The Adventure of Link",
            "description": [
                "This game would be nothing if it weren't for that palace theme. The remix that made it into Melee's famous Hyrule Temple is timeless and is the sole reason people even know about this game. That song goes so hard it's insane. The Great Palace theme is also great but only half as long."
            ],
            "image": "assets/music/nintendo/zelda-2.jpg",
            "metadata": "Platform: NES, for a list of favourite tracks, please visit the nintendo soundtracks page!",
            "type": "SOUNDTRACK"
        },
        {
            "title": "Beach from a postcard",
            "description": null,
            "image": "assets/gallery/beach.jpg",
            "metadata": "For anecdotes about the pictures, please visit the gallery page!",
            "type": "GALLERY"
        },
        {
            "title": "Werd ich zum Augenblicke sagen: Verweile doch, du bist so schön!",
            "description": null,
            "image": "assets/gallery/verweile.jpg",
            "metadata": "For anecdotes about the pictures, please visit the gallery page!",
            "type": "GALLERY"
        },
        {
            "title": "Painting date",
            "description": null,
            "image": "assets/gallery/marlo2.jpg",
            "metadata": "For anecdotes about the pictures, please visit the gallery page!",
            "type": "GALLERY"
        },
        {
            "title": "Honouring the sunflower with an appropriate stand",
            "description": null,
            "image": "assets/gallery/belch.jpg",
            "metadata": "For anecdotes about the pictures, please visit the gallery page!",
            "type": "GALLERY"
        },
        {
            "title": "Pretty pathetic",
            "description": [
                "Jessie from Pokemon is everything"
            ],
            "image": null,
            "metadata": "Link: https://www.youtube.com/watch?v=bQVgxPYBJzY",
            "type": "VIDEO"
        },
        {
            "title": null,
            "description": [
                "I got this at some convention and forgot about it until recently"
            ],
            "image": "assets/misc/characters/deco/cloud1.jpg",
            "metadata": null,
            "type": "CHARACTER_DECO"
        },
        {
            "title": "X-Naut Fortress",
            "description": [
                "Today I'm celebrating this game's release on the Nintendo Music App with this absolute banger from the Gamecube. It's one of Nintendo's only dance bangers and who knows maybe it will find itself in a DJ World Peace set one day."
            ],
            "image": null,
            "metadata": "Composer: Yoshito Hirano, Yuka Tsujiyoko, Game: Paper Mario: The Thousand Year Door, Day: 11-10-2025, Link: https://www.youtube.com/watch?v=rfvpEOROQo8",
            "type": "DAILY_SOUNDTRACK"
        },
        {
            "title": "Cocos en la Playa",
            "description": [
                "Welcome to the first soundtrack of the day! I'll use this space to recommend you some great music to enjoy every single day! Today I wanna highlight one of my all-time favourite artists Natalia and this song all about fucking off because she's had enough. Say no to screens, likes, annoying real-life shit and just go to the beach, get naked and swim in the sea and chat with the moon. The sigh right before the porrito reveal says it all."
            ],
            "image": null,
            "metadata": "Artist: Natalia Lafourcade, Album: Cancionera, Day: 10-10-2025, Link: https://www.youtube.com/watch?v=7a0pq4KYKwQ",
            "type": "DAILY_SOUNDTRACK"
        }
    ],
    "id": "8a8b4638-7e23-4060-855f-3cba64b1ee59"
}