{
  "pictures": [
    {
      "filename": "melee.jpg",
      "title": "Drop everything and BO3 me",
      "description": "I always keeping an eye open for arcade machines when I'm Mexico not only to drop everything and challenge Jack to a game of King of Fighters (which they always won and yes I am still bitter), but also to find any weird shit, like this machine which had a bunch of emulated gamecube and wii games on it. We paid a couple of pesos and had 5 minutes in Smash Melee, which was just about enough to destroy Jack with melee Peach, even though I was unable to do any float cancels with the joystick",
      "month": "January 2025"
    },
    {
      "filename": "archeology.jpg",
      "title": "A glimpse into the world of archeology",
      "description": "Jack and I were killing time in Córdoba, Veracruz when we were approached by a lovely man who gave us like a 3 hour tour of the archeology museum, which was so good. We asked a ton of questions and showed a ton of interest, so much so that at the end he let us see his office, pictured here. He had all these shelves of pieces that needed to be registered and getting that insider look was just so fucking cool",
      "month": "January 2025"
    },
    {
      "filename": "arturo.jpg",
      "title": "Moments before the coolest physical manoeuvre I've ever pulled off",
      "description": "Playa Colomitas in Puerto Vallarta with Arturo. Not only was the day beautiful, the hike beautiful and the beach beautiful, but we also had an amazing moment at this beach. It started to rain, so everyone got into one of the lancha boats you can see in the picture. Everyone struggled, fell inside unceremoniously, or needed to be helped by the driver. We were the last to enter, and although I was nervous, I just went for it and hoisted myself in. By some miracle, I did a perfect flip and landed on the seat so smoothly that people behind me were audibly impressed. Then Arturo comes up, passes me his shoes and bag then does an equally impressive twist into the boat right next me, then gives me a little kiss. Everyone on the boat cheered!",
      "month": "January 2025"
    },
    {
      "filename": "brenda.jpg",
      "title": "Another Brenda Banger",
      "description": "During some organised fun at Christmas, Brenda, the new partner of my grandad, came out with one of her gems. After tying her to the chair she says confidently 'Gag me'",
      "month": "December 2024"
    },
    {
      "filename": "sam.jpg",
      "title": "The Trousers",
      "description": "I was so happy to be invited to Mathis' birthday where the theme was just to wear your best outfit, so I did! I wore the Trousers in combination with this matching-colour jacket I found at Humana and although I knew it was a pretty out-there outfit, I felt right at home at the party. I even won a prize! Here I am pictured with Sam who I love and adore",
      "month": "December 2024"
    }
  ]
}
