{
  "albums": [
    {
      "filename": "laura-alas.jpg",
      "artist": "Laura Marling",
      "name": "Alas I Cannot Swim",
      "releaseyear": "2008",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "laura-spaek.jpg",
      "artist": "Laura Marling",
      "name": "I Speak Because I Can",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "laura-creature.webp",
      "artist": "Laura Marling",
      "name": "A Creature I Don't Know",
      "releaseyear": "2011",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "laura-once.jpg",
      "artist": "Laura Marling",
      "name": "Once I Was An Eagle",
      "releaseyear": "2013",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "laura-semper.jpg",
      "artist": "Laura Marling",
      "name": "Semper Femina",
      "releaseyear": "2017",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "laura-song.jpg",
      "artist": "Laura Marling",
      "name": "Song For Our Daughter",
      "releaseyear": "2020",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "laura-patterns.jpg",
      "artist": "Laura Marling",
      "name": "Patterns In Repeat",
      "releaseyear": "2024",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tunng-comments.jpg",
      "artist": "Tunng",
      "name": "Comments of the Inner Chorus",
      "releaseyear": "2006",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tunng-good.jpg",
      "artist": "Tunng",
      "name": "Good Arrows",
      "releaseyear": "2007",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tunng-land.jpg",
      "artist": "Tunng",
      "name": "…And Then We Saw Land",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tunng-turbines.jpg",
      "artist": "Tunng",
      "name": "Turbines",
      "releaseyear": "2013",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tunng-love.jpg",
      "artist": "Tunng",
      "name": "Love You All Over Again",
      "releaseyear": "2025",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "janelle-metropolis.jpg",
      "artist": "Janelle Monáe",
      "name": "Metropolis: The Chase Suite",
      "releaseyear": "2007",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "janelle-arch.jpg",
      "artist": "Janelle Monáe",
      "name": "The ArchAndroid",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "janelle-electric.jpg",
      "artist": "Janelle Monáe",
      "name": "The Electric Lady",
      "releaseyear": "2013",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "janelle-dirty.jpg",
      "artist": "Janelle Monáe",
      "name": "Dirty Computer",
      "releaseyear": "2018",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "janelle-age.jpg",
      "artist": "Janelle Monáe",
      "name": "The Age of Pleasure",
      "releaseyear": "2023",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "jens-dog.webp",
      "artist": "Jens Lekman",
      "name": "When I Said I Wanted To Be Your Dog",
      "releaseyear": "2004",
      "description": "One thing I will always love about Jens Lekman is he will explicitly the name the people in his life when telling his anecdotes in his songs. Case in point, singing a new happy birthday song to his mate Lisa. His lyrics are always so literal and concrete and I love that. There is a run of tracks in the middle of this album which are so peaceful and melancholic, and they give the album such a vibe which is really matched by the album art. Some of the songs are silly as well but fuck it, they're still great. This is early, raw Jens and we should all take some time to enjoy it",
      "topTracks": ["Happy Birthday, Dear Friend Lisa", "If You Ever Need A Stranger", "Silvia", "The Cold Swedish Winter", "Psychogirl", "When I Said I Wanted To Be Your Dog"]
    },
    {
      "filename": "jens-night.jpg",
      "artist": "Jens Lekman",
      "name": "Night Falls Over Kortedala",
      "releaseyear": "2007",
      "description": "Jens the cheeky bastard did not clear his samples when making this album and at some point he had to pull it from streaming services, so he released a new version with redone samples and instruments. It's weird to hear such a beloved album be reconstructed like this. The vast majority is the same, but in some parts it's different. The most glaring example is 'Kanske...' which notably worse now... but it's fine, it just makes my CD of the original that much more valuable! This album really is the quintessential Jens though. It's got everything, and so many classics, like 'The Opposite of Hallelujah', which contains one of my favourite lyrics: 'I picked up a seashell to illustrate my homelessness, but a crab crawled out of it making it useless'. This also has an all-time favourite 'Postcard to Nina' about going to Berlin (!) to meet with a penpal who makes him pretend to be her boyfriend so she can be with her girlfriend. In the re-released version he adds a bonus track which revisits the story of Nina and it's just perfect. It pulls at my heartstrings every time and I would pay anything to see it live",
      "topTracks": ["The Opposite of Hallelujah", "A Postcard to Nina", "Shirin", "It Was a Strange Time in My Life", "Kanske Är Jag Kär i Dig", "Radio NRJ", "The Linden Trees Are Still In Blossom"]
    },
    {
      "filename": "jens-argument.webp",
      "artist": "Jens Lekman",
      "name": "An Argument With Myself",
      "releaseyear": "2011",
      "description": "This is the first Jens I heard and I immediately became an instant fan. His lyrics are so dumb and so very literal and I just fucking love it. He writes songs about very concrete things and that's why I love him. All these songs are great anecdotes in and of themselves and they're also great bangers as well. It's a short EP but top quality",
      "topTracks": ["An Argument With Myself", "Waiting for Kirsten", "A Promise", "New Directions"]
    },
    {
      "filename": "jens-love.webp",
      "artist": "Jens Lekman",
      "name": "I Know What Love Isn't",
      "releaseyear": "2012",
      "description": "Can you believe I went to Stockholm and I missed Jens Lekman by a day? He was doing signings of this album and I was devastated. Whatever, I loved this album so much. Unlike his other stuff, this album has a special and consistent vibe. It's full of major 7ths and airy strings and I love it. Highlight for me is 'The World Moves On' which gives snapshots of his time living in Australia",
      "topTracks": ["Erica America", "Become Someone Else's", "I Want A Pair Of Cowboy Boots", "The World Moves On", "I Know What Love Isn't"]
    },
    {
      "filename": "jens-life.jpg",
      "artist": "Jens Lekman",
      "name": "Life Will See You Now",
      "releaseyear": "2017",
      "description": "Another great album from Jens, although I have some issues with some of the songs! I enjoy 'Evening Prayer' because it's a bop, but is it about feeling sorry for yourself because it's hard to be the friend of someone who's having a bad time? Whatever it's still good. Why not have a song about trying to be a good friend. 'How We Met...' is a lot of fun, and the last two tracks genuinely hard in a way that Jens Lekman songs don't tend to do",
      "topTracks": ["Evening Prayer", "Hotwire the Ferris Wheel", "How We Met, the Long Version", "Postcard #17", "Dandelion Seed"]
    },
    {
      "filename": "amy-frank.jpg",
      "artist": "Amy Winehouse",
      "name": "Frank",
      "releaseyear": "2003",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "amy-black.jpg",
      "artist": "Amy Winehouse",
      "name": "Back to Black",
      "releaseyear": "2006",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "erykah-baduizm.jpg",
      "artist": "Erykah Badu",
      "name": "Baduizm",
      "releaseyear": "1996",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "erykah-mama.jpg",
      "artist": "Erykah Badu",
      "name": "Mama's Gun",
      "releaseyear": "2000",
      "description": "I love Erykah Badu, she is everything. I got hooked on this album after watching her amazing Tiny Desk concert where she plays the 10 minute break up song 'Green Eyes', the closer of this album. When she says 'I don't know why I fucked with you' that's the final nail in the coffin, she has finally moved on. I also love love love the track 'Orange Moon' and intend to sing it to any and all future lovers. And also the chill bit at the end of 'Time's a wastin', and the amazing remix of her hit 'On & On' called '...& On'",
      "topTracks": ["My Life", "...& On", "Cleva", "A.D. 2000", "Orange Moon", "In Love With You", "Time's A Wastin", "Green Eyes"]
    },
    {
      "filename": "erykah-worldwide.jpg",
      "artist": "Erykah Badu",
      "name": "Worldwide Underground",
      "releaseyear": "2003",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "erykah-america-1.jpg",
      "artist": "Erykah Badu",
      "name": "New Amerykah Part One (4th World War)",
      "releaseyear": "2008",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "erykah-america-2.jpg",
      "artist": "Erykah Badu",
      "name": "New Amerykah Part Two: Return Of The Ankh",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "erykah-caint.jpg",
      "artist": "Erykah Badu",
      "name": "But You Caint Use My Phone",
      "releaseyear": "2015",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "regina-11.jpg",
      "artist": "Regina Spektor",
      "name": "11:11",
      "releaseyear": "2001",
      "description": "Regina's roots! Her first music was very jazzy but still featured that idiosyncratic piano that we love her for, as well as her astute lyrics. The second track is just her with a double bass, wild. 'Back of a Truck' is like a gospel anthem, and 'Pavlov's Daughter' is so good just in general. I love the little drum machine at the start before it gets going",
      "topTracks": ["Love Affair", "Back of a Truck", "Pavlov's Daughter"]
    },
    {
      "filename": "regina-songs.jpg",
      "artist": "Regina Spektor",
      "name": "Songs",
      "releaseyear": "2002",
      "description": "This particular album contains lots of very special songs. This is where she consolidated that piano + remarkable lyrics combo. It's so arty and thought-provoking! 'Reading Time with Pickle' is so weird the way she sounds drugged, and some of the other lyrics really make you wonder where she gets her material. This is also the origin of popular song 'Samson' which has a nice slower version here. Also I want to shout out 'Lounge' for it's insane, lavish piano chords",
      "topTracks": ["Samson", "Reading Time with Pickle", "Consequence of Sounds", "Daniel Cowman", "Aching to Pupate", "Lounge", "Lacrimosa"]
    },
    {
      "filename": "regina-soviet.jpg",
      "artist": "Regina Spektor",
      "name": "Soviet Kitsch",
      "releaseyear": "2004",
      "description": "The mother of all Regina albums, and one of my favourite albums of all time. This is her breakout and features some of the most prescient and thoughtful songs she's ever written. This had me learning how to play 'Ode to Divorce' on the piano as a 13 year old singing to myself 'I need your money!'. I also learned how to play 'Somedays' and 'Ghost of Corporate Future' which I love so so much. Each one tells its own kind of specific story, and each time they come with important life lessons. 'Chemo Limo' is about a woman who rents a limousine instead of spending money on chemotherapy so that she can go out in style with her four kids. The song is a wild ride",
      "topTracks": ["Ode to Divorce", "Carbon Monoxide", "Us", "Ghost of Corporate Future", "Chemo Limo", "Somedays"]
    },
    {
      "filename": "regina-begin.jpg",
      "artist": "Regina Spektor",
      "name": "Begin to Hope",
      "releaseyear": "2006",
      "description": "Considering that this era of Regina was very pop-heavy, isn't it amazing that she never writes songs about sex and relationships? Sometimes love is involved, but as evidenced here in the album, she's mainly singing about eating boxes of tangerines, castrated people, or traveling around Europe.",
      "topTracks": ["Samson", "Field Below", "Après Moi", "Summer in the City", "Another Town", "Düsseldorf", "Bartender"]
    },
    {
      "filename": "regina-far.jpg",
      "artist": "Regina Spektor",
      "name": "Far",
      "releaseyear": "2009",
      "description": "Her poppiest album by far and she's still not singing about sex and relationships. Instead it's about being hooked into a machine, winning the Human of the year award, or finding someone's wallet on the ground. These songs are so fun and so interesting, she is just magical like that. Her bubbly and lovely personality shines through on 'Wallet', but she also shows her darker side on 'Genius Next Door' and the beautiful 'Man of a Thousand Faces'",
      "topTracks": ["The Calculation", "Laughing With", "Human of the Year", "Genius Next Door", "Wallet", "Man of a Thousand Faces"]
    },
    {
      "filename": "regina-cheap.jpg",
      "artist": "Regina Spektor",
      "name": "What We Saw from the Cheap Seats",
      "releaseyear": "2012",
      "description": "I associate this album with the time I went interrailing when I was 18. I was humming these songs as I traveled around, especially in Italy. That trip wasn't great, looking back. I hadn't grown up enough to truly enjoy it, I think. But I truly did enjoy the album. 'Firewood' is so beautiful and so transparent and always brings a tear to my eye. She doesn't just write a song about someone lying in a hospital bed thinking they might die, she writes a song about keeping hope that they won't die, and in fact the piano isn't firewood yet",
      "topTracks": ["Small Town Moon", "Firewood", "Patron Saint", "Ballad of a Politician", "The Party"]
    },
    {
      "filename": "regina-remember.jpg",
      "artist": "Regina Spektor",
      "name": "Remember Us to Life",
      "releaseyear": "2016",
      "description": "It's between this and Soviet Kitsch when it comes to favourite Regina albums. It has such a great variety of beautiful and thoughtful songs. And STILL none of them are about sex and relationships. They're about gazing at a photograph, forgotten manuscripts, a mystical demon hotel, how nobody wins when it comes to selling flowers because they just die. I think my favourites are the bonus tracks, especially the song about new year. New year is a part of everyone's lives, how often do you get to hear a song about it?",
      "topTracks": ["Black and White", "The Trapper and the Furrier", "Sellers of Flowers", "The Visit", "New Year", "The One Who Stayed and the One Who Left", "End of Thought"]
    },
    {
      "filename": "regina-home.jpg",
      "artist": "Regina Spektor",
      "name": "Home, before and after",
      "releaseyear": "2022",
      "description": "This album I listened to when I visited Lyon in 2022, and I associate it with that trip. It's not up there with the best Regina albums but I'm a die-hard fan so what are you gonna do. It does feature some revamped old songs, something that she loves to do, 'Raindrops' and the amazing 'Loveology'. I also really enjoy the choruses of 'SugarMan' and 'Coin'. Actually there's a bunch of great stuff here",
      "topTracks": ["Raindrops", "SugarMan", "Coin", "Loveology"]
    },
    {
      "filename": "rhye-woman.jpg",
      "artist": "Rhye",
      "name": "Woman",
      "releaseyear": "2013",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "rhye-blood.webp",
      "artist": "Rhye",
      "name": "Blood",
      "releaseyear": "2018",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "rhye-spirit.jpg",
      "artist": "Rhye",
      "name": "Spirit",
      "releaseyear": "2019",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "rhye-home.jpg",
      "artist": "Rhye",
      "name": "Home",
      "releaseyear": "2021",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "kkb-intro.jpg",
      "artist": "Kero Kero Bonito",
      "name": "Intro Bonito",
      "releaseyear": "2013",
      "description": "Where do I even begin with this wild album. I love this band because they shamelessly use video game music samples and that is never more so than on their first album. 'Sick Beat' literally uses the Super Mario 64 sound throughout the whole song and I am here for that. I can't even imagine what possessed them to make a band and do music like this. They're clearly having a lot of fun doing it, which is what makes it so delightful. I also feel like this album is the blueprint for a lot of their future stuff. Big hit 'I'd Rather Sleep' hints at the mental breakdowns present in 'Time 'n' Place' and takes the twee fairy-like music and combines it with a uniquely scary lyrics about not wanting to wake up",
      "topTracks": ["Bonito Intro", "Intro Bonito", "Sick Beat", "My Party", "Kero Kero Bonito", "Pocket Crocodile", "I'd Rather Sleep"]
    },
    {
      "filename": "kkb-generation.jpg",
      "artist": "Kero Kero Bonito",
      "name": "Bonito Generation",
      "releaseyear": "2016",
      "description": "This is it, the real deal! Kero Kero Bonito go crazy and make an album full of happy-go-luck Jpop for children, except it's fucking good. It's a huge party with very simple lyrics and it fucking slaps. On multiple listens you realise that there is more going on underneath the surface, but I implore you, dear reader, to just treat yourself to the painfully positive vibes all across this album. Gosh selecting top tracks was too hard so I just put them all down. I love the first track for its beautiful synth chords at the end, 'Heard a song' for being a catchy song about trying to remember a catchy song (another favourite lyric: 'I don't know you but that sounds fresh!'). 'Graduation' is super funny, 'Fish Bowl' has this shoegaze section, I'm obsessed, 'Big City' is literally city pop and I love city pop. 'Break' is so real. And they partly filmed the video in Berlin! 'Lipslap' is full of hilarious lyrics ('I'm not one to lip read and you don't come with subtitles!'), 'Try Me' is hilarious because of the 'business, dancing, throwing a party with you!' line, 'Paintbrush' is also hilarious because it's in Japanese except for the word 'Paintbrush', and 'Trampoline' is just a straight up BOP. OK I'll stop, but the last two tracks are great too",
      "topTracks": ["Waking Up", "Heard a Song", "Graduation", "Fish Bowl", "Big City", "Break", "Lipslap", "Try Me", "Paintbrush", "Trampoline", "Picture This", "Hey Parents"]
    },
    {
      "filename": "kkb-time.jpg",
      "artist": "Kero Kero Bonito",
      "name": "Time 'n' Place",
      "releaseyear": "2018",
      "description": "When this band released the single 'Only Acting' after the previous album Bonito Generation, KKB fans were SHOOK. They have gone from bubblegum pop to noise rock and holy shit it was so exciting. This album exposes what was lying underneath the happy-go-lucky vibes and lyrics of their old stuff and suggests that they were all mentally ill the whole time and putting on a face! 'Time Today', which I love, as well as 'Visiting Hours' both take place in a mental hospital, and at two points in the album there are moments were everything breaks down into horrible noise, complete with screaming and gunshots. But that doesn't mean the album has gone full sicko mode, the video game influences and pop vibes from their old stuff is still well and truly there, and there are a number of tracks which are even nice! I love the ending of 'Dear Future Self' and of course 'Swimming'. The fact they went this direction just shows how they are totally cool with reinventing themselves and that's what makes them one of the most innovative and exciting bands ever",
      "topTracks": ["Time Today", "Only Acting", "Dump", "Dear Future Self", "Swimming", "Rest Stop"]
    },
    {
      "filename": "kkb-civilisation.jpg",
      "artist": "Kero Kero Bonito",
      "name": "Civilisation",
      "releaseyear": "2021",
      "description": "I love all the KKB albums but THIS ONE! This is the one which has Fraser Bowen written all over it. This is my jam. This is my shit. When I first heard 'Battle Lines' I thought it Streets of Rage! The video game influences are everywhere. I truly truly truly believe that the drum loops in that song as 'The River' are inspired from Pokemon Mystery Dungeon, and I will not rest until I personally meet the band and ask them to confirm this. Those two songs by the way have such good lyrics. Bonito Generation seems so long ago when they start singing about dividing populations and making a disaster state so you can stay in power. This album originally came out as two EPs and they were my most listened to music of their respective years, I love them that much. I loved the poppy 'Princess and the Clock', and especially the last two tracks. The 7 minute extension of 'Rest Stop' from the previous album is insane. They teased that track on a youtube video and I watched that teaser so many times I'm almost embarrassed to admit it. If you want to get to know me better, please give this album a listen",
      "topTracks": []
    },
    {
      "filename": "norah-come.jpg",
      "artist": "Norah Jones",
      "name": "Come Away With Me",
      "releaseyear": "2002",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "norah-feels.jpg",
      "artist": "Norah Jones",
      "name": "Feels Like Home",
      "releaseyear": "2004",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "norah-not.jpg",
      "artist": "Norah Jones",
      "name": "Not Too Late",
      "releaseyear": "2007",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "norah-fall.jpg",
      "artist": "Norah Jones",
      "name": "The Fall",
      "releaseyear": "2009",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "norah-hearts.jpg",
      "artist": "Norah Jones",
      "name": "Little Broken Hearts",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "fleet-foxes.webp",
      "artist": "Fleet Foxes",
      "name": "Fleet Foxes",
      "releaseyear": "2008",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "fleet-helpless.jpg",
      "artist": "Fleet Foxes",
      "name": "Helplessness Blues",
      "releaseyear": "2011",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "fleet-crack.jpg",
      "artist": "Fleet Foxes",
      "name": "Crack-Up",
      "releaseyear": "2017",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "fleet-shore.jpg",
      "artist": "Fleet Foxes",
      "name": "Shore",
      "releaseyear": "2020",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "timber-timbre.jpg",
      "artist": "Timber Timbre",
      "name": "Timber Timbre",
      "releaseyear": "2009",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "timber-creep.jpg",
      "artist": "Timber Timbre",
      "name": "Creep On, Creepin' On",
      "releaseyear": "2011",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "timber-hot.jpg",
      "artist": "Timber Timbre",
      "name": "Hot Dreams",
      "releaseyear": "2014",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "timber-lovage.jpg",
      "artist": "Timber Timbre",
      "name": "Lovage",
      "releaseyear": "2023",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tallest-shallow.jpg",
      "artist": "The Tallest Man on Earth",
      "name": "Shallow Grave",
      "releaseyear": "2008",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tallest-wild.jpg",
      "artist": "The Tallest Man on Earth",
      "name": "The Wild Hunt",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tallest-leaving.webp",
      "artist": "The Tallest Man on Earth",
      "name": "There's No Leaving Now",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tallest-dark.jpg",
      "artist": "The Tallest Man on Earth",
      "name": "Dark Bird Is Home",
      "releaseyear": "2015",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tallest-love.webp",
      "artist": "The Tallest Man on Earth",
      "name": "I Love You. It's a Fever Dream.",
      "releaseyear": "2019",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tallest-henry.webp",
      "artist": "The Tallest Man on Earth",
      "name": "Henry St.",
      "releaseyear": "2023",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "kings-quiet.jpg",
      "artist": "Kings of Convenience",
      "name": "Quiet Is The New Loud",
      "releaseyear": "2001",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "kings-riot.jpg",
      "artist": "Kings of Convenience",
      "name": "Riot On An Empty Street",
      "releaseyear": "2004",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "kings-declaration.jpg",
      "artist": "Kings of Convenience",
      "name": "Declaration Of Dependence",
      "releaseyear": "2009",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "kings-peace.webp",
      "artist": "Kings of Convenience",
      "name": "Peace Or Love",
      "releaseyear": "2021",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "aldous-party.jpg",
      "artist": "Aldous Harding",
      "name": "Party",
      "releaseyear": "2017",
      "description": "An earlier, rawer album, with some of her harshest music. It sounds like she sings the tracks while her whole body is completely tense. The video for 'Blend' is haunting, as is the video for 'Horizon', both very devastating songs. And the final track features Perfume Genius and is of course beautiful",
      "topTracks": ["Blend", "Imagining My Man", "Party", "Horizon", "Swell Does the Skull"]
    },
    {
      "filename": "aldous-designer.jpg",
      "artist": "Aldous Harding",
      "name": "Designer",
      "releaseyear": "2019",
      "description": "Wow, wow, wow, this album is definitely my favourite from Aldous Harding. The songs are all nonsensical but I'm addicted to them, I can't help it. The first song I ever heard from her was 'Fixture Picture' which is so pleasant and lovely, and then I saw the amazing music video for 'The Barrel' which is something I think about a lot. Her dancing is like a centuries old witch who is having a good day. Then there is the 'Weight of the Planets' which I love, and so many other great moments like shaking chains around like a tambourine in 'Damn', or when talking about heaven 'I don't want entry, that place is empty'",
      "topTracks": ["Fixture Picture", "Zoo Eyes", "Treasure", "The Barrel", "Damn", "Weight of the Planets", "Heaven is Empty"]
    },
    {
      "filename": "aldous-warm.webp",
      "artist": "Aldous Harding",
      "name": "Warm Chris",
      "releaseyear": "2022",
      "description": "I can't for the life of me imagine why this is called Warm Chris. I don't claim to come even close to figuring out what's going on in Aldous's mind but what matters is that this album has great moments. It's peaceful and weird. If I were to equate this album with a Nintendo franchise it would be pikmin. I especially enjoy the very final track which features the guy from Sleaford Mods, which I read was an awkward collaboration. But whatever I love it when she reharmonises the song at the end with the guitar, it sounds so melancholic",
      "topTracks": ["Ennui", "Fever", "Leathery Whip"]
    },
    {
      "filename": "michael-home.jpg",
      "artist": "Michael Kiwanuka",
      "name": "Home Again",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "michael-love.jpg",
      "artist": "Michael Kiwanuka",
      "name": "Love & Hate",
      "releaseyear": "2016",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "michael-kiwanuka.jpg",
      "artist": "Michael Kiwanuka",
      "name": "KIWANUKA",
      "releaseyear": "2019",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "michael-small.jpg",
      "artist": "Michael Kiwanuka",
      "name": "Small Changes",
      "releaseyear": "2024",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "magdalena-mini-1.jpg",
      "artist": "Magdalena Bay",
      "name": "mini mix vol. 1",
      "releaseyear": "2019",
      "description": "This little EP is so great. I love putting on the video to impress my friends. No band capture dawn-of-the-internet retro vibes like Mag Bay. These music videos capture that low-budget feel so perfectly and although it kinda feels like they're taking the piss, it still sounds so good. I'm obsessed with her half-hearted dancing. It kinda feels like they made this whole thing in a week. Yet here I am listening to it again. 'U Wanna Dance?' might be the thing which inspired me most aesthetics-wise when making this website",
      "topTracks": ["Afternoon in Heaven", "Turning off the Rain", "U Wanna Dance?", "Nothing Baby"]
    },
    {
      "filename": "magdalena-rhythm.jpg",
      "artist": "Magdalena Bay",
      "name": "A Little Rhythm and a Wicked Feeling",
      "releaseyear": "2020",
      "description": "My first exposure to Mag Bay was 'How to Get Physical' whose video is just so fun. It's pop perfection! This little EP is a great introduction to them, although its less cheeky than the mini mixes",
      "topTracks": ["How to Get Physical", "Story", "Venice"]
    },
    {
      "filename": "magdalena-mini-2.jpg",
      "artist": "Magdalena Bay",
      "name": "mini mix vol. 2",
      "releaseyear": "2020",
      "description": "After having a real release, they went back to make a quick low-budget EP with a bunch of green screen videos. I love that about this band, they don't forget their roots, their roots being tacky music videos. These music videos are so good, and the songs are great too. Personal favourite is 'Sky2Fall' which they made in a day, and features a glamourous transformation into a pop princess in the video",
      "topTracks": ["Live 4ever", "Sky2Fall", "Hideaway"]
    },
    {
      "filename": "magdalena-mercurial.webp",
      "artist": "Magdalena Bay",
      "name": "Mercurial World",
      "releaseyear": "2021",
      "description": "After 3 EPs they finally got the budget for an actual album. This album has some banger tracks on it, even if they are taking themselves way more seriously this time around. I remember being obsessed with 'Secrets' when it came out. This also has some extra tracks in the deluxe version which I really enjoyed. This kind of synthpop is just hitting for me these days",
      "topTracks": ["Mercurial World", "Unconditional", "Dawning of the Season", "Secrets (Your Fire)", "Chaeri", "Hysterical Us", "All You Do"]
    },
    {
      "filename": "magdalena-mini-3.jpg",
      "artist": "Magdalena Bay",
      "name": "mini mix vol. 3",
      "releaseyear": "2023",
      "description": "Having enjoyed some real success, Mag Bay go back to making tacky music videos, except now they're actually good at it now, so they still end up looking professional. Will we ever get back the magic of mini mix 1? Hard to say, but this is still super enjoyable and worth your time",
      "topTracks": ["2 Wheel Drive", "Top Dog"]
    },
    {
      "filename": "magdalena-imaginal.jpg",
      "artist": "Magdalena Bay",
      "name": "Imaginal Disk",
      "releaseyear": "2024",
      "description": "This is the Mag Bay Mag Opus! A whole ass album that is super consistent and has NO SKIPS! It feels wrong to not listen to this front to back, because all the tracks fit in with each other so well. It has an abstract concept running through it as well of a girl who decides to get a special disk inserted into her brain, featuring multiple characters. It's very conceptual and each time you listen to the album you understand a bit more of it. The album has a bunch of amazing moments, especially when it gets LOUD! And the team really exhibit some amazing chord progressions (my weakness) and different vibes. The interlude near the start sounds like Wii Sports, 'Cry For Me' sounds like Dancing Queen and 'Angel on a Satellite' sounds like Debussy. This album was the one I listened to most in 2024!",
      "topTracks": ["Killing Time", "True Blue Interlude", "Image", "Death & Romance", "Fear, Sex", "Watching T.V.", "Cry For Me", "Angel on a Satellite"]
    },
    {
      "filename": "khruangbin-universe.jpg",
      "artist": "Khruangbin",
      "name": "The Universe Smiles Upon You",
      "releaseyear": "2015",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "khruangbin-todo.jpeg",
      "artist": "Khruangbin",
      "name": "Con Todo El Mundo",
      "releaseyear": "2018",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "khruangbin-mordechai.jpg",
      "artist": "Khruangbin",
      "name": "Mordechai",
      "releaseyear": "2020",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "khruangbin-sala.jpg",
      "artist": "Khruangbin",
      "name": "A LA SALA",
      "releaseyear": "2024",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "sade-diamond.jpg",
      "artist": "Sade",
      "name": "Diamond Life",
      "releaseyear": "1984",
      "description": "Sade, an absolute queen backed by a flawless band, arrives on the scene to serve class, style and sensuality. The world didn't know what hit them when she release 'Smooth Operator' back then. This music is SO classy, it's music for smoking, making deals, and most of all, making babies. It's silky, it's smooth, it makes you want to stretch and relax, and lock eyes with the high-flying 5-o'clock shadow businessman at the other end of the bar. Just LOOK at her on the album cover, I mean come on. She is singing about the diamond life, but also the tough life. My favourite on this album is the final track, which is a cover of Timmy Thomas's civil rights song. Interesting factoid about the original, its hypnotic drum loop was used for Drake's 'Hotline Bling' (his only good song). I love how Sade's version also has a long, slow intro just like the original",
      "topTracks": ["Smooth Operator", "Your Love Is King", "Frankie's First Affair", "Sally", "Why Can't We Live Together"]
    },
    {
      "filename": "sade-promise.jpg",
      "artist": "Sade",
      "name": "Promise",
      "releaseyear": "1985",
      "description": "Sade stuns with this follow-up album, arguably even MORE classy and more sophisticated than the first. I always come back to the image of her at the window in the rain for the 'Sweetest Taboo' video. Such a vibe. And in terms of audio, just the first minute of the album with the James Bond big band blow-out, then the single tap of the conga into the smoothest verse you could ever imagine. It's just something else! I also love the final track 'Maureen' about her car",
      "topTracks": ["Is It a Crime", "The Sweetest Taboo", "War of the Hearts", "Mr Wrong", "Never as Good as the First Time", "Maureen"]
    },
    {
      "filename": "sade-stronger.jpg",
      "artist": "Sade",
      "name": "Stronger Than Pride",
      "releaseyear": "1988",
      "description": "Ugh yet another stunning Sade album, how lucky we are to be able to listen to it on demand. The band evolves even further and become even silkier, even classier and even more beautiful than ever before. With the timeless 'Paradise', another favourite track 'Nothing Can Come Between Us', which I'm pretty sure features 3 different kinds of bass guitar. One track in particular has had a major effect on me in 2024, 'I Never Thought I'd See the Day'. It's a very quiet track with just two bass notes keeping the rhythm while Sade sings about the day it all goes wrong, and it's perfect for when you want to wallow in your sadness, or you are contemplating life-changing things. This song has been there for me when I need it. And then it's followed up by this beautiful instrumental track at the end. It's just perfect",
      "topTracks": ["Paradise", "Nothing Can Come Between Us", "Turn My Back On You", "Keep Looking", "Clean Heart", "I Never Thought I'd See the Day", "Siempre Hay Esperanza"]
    },
    {
      "filename": "sade-love.jpg",
      "artist": "Sade",
      "name": "Love Deluxe",
      "releaseyear": "1992",
      "description": "To think that we get the honour of living in a world where Sade graces us with their magnus opus, their ultimate album, the unbeatable Love Deluxe. This album REEKS of sensuality, desire and classy confidence. I went and put every track in the top tracks because it's just one of those albums. It starts off with the best one, 'No Ordinary Love', the sexiest song ever, and one I regularly put on during sex. The main theme of Streets of Rage, a house-influence soundtrack, reminds me of this song which makes me love it more. Then there's just always this amazing beat and vibe, more so than the previous albums, it's almost hypnotic. Hard to put into words. 'Like a Tattoo' has this devastating story, and when she sings 'I still feel the chill as I reveal my shame to you' I always have to stop what I'm doing and take a moment. And it ends with another beautiful instruments. God it's just a perfect album",
      "topTracks": ["No Ordinary Love", "Feel No Pain", "Couldn't Love You More", "Like a Tattoo", "Kiss of Life", "Cherish The Day", "Pearls", "Bullet Proof Soul", "Mermaid"]
    },
    {
      "filename": "esperanza-emily.jpg",
      "artist": "Esperanza Spalding",
      "name": "Emily's D+Evolution",
      "releaseyear": "2016",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "confidence-tilt.png",
      "artist": "Confidence Man",
      "name": "Tilt",
      "releaseyear": "2022",
      "description": "Confidence Man have perfected the art of blending classic house and cheeky pop music. They clearly have impeccable senses of humour which was on display when I heard 'Holiday' for the first time. A super serious opening, atmospheric, epic, then her vocals come in and it ALMOST feels like she's taking the piss. They have amazing music videos, my favourite of which is 'Luvin U Is Easy' which is just them having so much fun, and the song is such amazing classic house. Also, the song 'Break It Bought It' is definitely my drag song, and I will DJ it at my birthday party",
      "topTracks": ["Woman", "Toy Boy", "Luvin U Is Easy", "Holiday", "Break It Bought It"]
    },
    {
      "filename": "confidence-3am.jpg",
      "artist": "Confidence Man",
      "name": "3AM (LA LA LA)",
      "releaseyear": "2024",
      "description": "We went to see them in Berghain when they released this album and it was so good. They have dance moves for every song and are just so cheeky and outrageous. Having loved the previous album, I was so pumped when this came out and it totally delivered! My favourite track is the first one because it channels Kylie Minogue so good, but I also love the dirty synth chords in 'Sicko' even if I do find the dude a little much. She, meanwhile, is the most gorgeous woman I've ever seen, and that is mostly seen in the Sicko video. They also bring back that classic house party experience on 'Real Move Touch' which I adore",
      "topTracks": ["Who Knows What You'll Find?", "Breakbeat", "Sicko", "Real Move Tough"]
    },
    {
      "filename": "melody-absence.jpg",
      "artist": "Melody Gardot",
      "name": "The Absence",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "vincent-daddy.jpg",
      "artist": "St. Vincent",
      "name": "Daddy's Home",
      "releaseyear": "2021",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "miami-illumination.jpg",
      "artist": "Miami Horror",
      "name": "Illumination",
      "releaseyear": "2010",
      "description": "I was so into this album when I was living in Switzerland in 2013, mainly because I was going through my Kimbra phase and she features on their hit song 'I look to you', which is a timeless banger. The rest of the album has such a great summer party vibe, but also with an element of fantasy. I especially love the closing track, and looking it up now, I realise it features Alan Palomo from the band Neon Indian, which adds up. I did have a listen to their new album but it really doesn't hit the same. They peaked with their first album",
      "topTracks": ["I Look to You", "Summersun", "Moon Theory", "Imagination", "Grand Illusion", "Ultraviolet"]
    },
    {
      "filename": "leisure-sleeper.jpg",
      "artist": "The Leisure Society",
      "name": "The Sleeper",
      "releaseyear": "2009",
      "description": "For a long time this was my favourite band! When I was 15 or so I had their albums on repeat. If any band puts in a remotely interesting chord progression, I'm in, which is why I was obsessed with 'Come To Your Senses' and 'We Were Wasted'. But I also loved how the melody hung so lightly in 'Last of the Melting Snow', then eventually swings in. It's just so nice. I fondly enjoy the nostalgia I feel with this album",
      "topTracks": ["A Fighting Chance", "The Last Of The Melting Snow", "A Short Weekend Begins With Longing", "We Were Wasted", "Are We Happy?", "Come To Your Senses", "Love's Enormous Wings"]
    },
    {
      "filename": "leisure-murky.jpg",
      "artist": "The Leisure Society",
      "name": "Into The Murky Water",
      "releaseyear": "2011",
      "description": "I got this album on CD around the time I had my first fish, Vaughan Williams. When the summer came around and I was too lazy to change the water more often and algea murked up the water, I enjoyed playing this album since it's also murky water related. It's a cute album! Lots of fun songs, the kind of music I really associate with English festivals. They also did an EP 'Out of the Murky Water' which I also adore",
      "topTracks": ["Into The Murky Water", "Out Hearts Burn Like Damp Matches", "Better Written Off (Than Written Down)", "Just Like The Knife", "Flying", "Weir Road", "A Richer Dust"]
    },
    {
      "filename": "weyes-titanic.webp",
      "artist": "Weyes Blood",
      "name": "Titanic Rising",
      "releaseyear": "2019",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "weyes-darkness.jpg",
      "artist": "Weyes Blood",
      "name": "And In The Darkness, Hearts Aglow",
      "releaseyear": "2022",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "bonobo-black.jpg",
      "artist": "Bonobo",
      "name": "Black Sands",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "bonobo-days.jpg",
      "artist": "Bonobo",
      "name": "Days to Come",
      "releaseyear": "2006",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "everything-man.jpg",
      "artist": "Everything Everything",
      "name": "Man Alive",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "everything-arc.jpg",
      "artist": "Everything Everything",
      "name": "Arc",
      "releaseyear": "2013",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "beyonce-renaissance.png",
      "artist": "Beyoncé",
      "name": "RENAISSANCE",
      "releaseyear": "2022",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "villagers-awayland.jpg",
      "artist": "Villagers",
      "name": "{Awayland}",
      "releaseyear": "2013",
      "description": "Villagers is good! Some cerebral indie music who I saw live once. I've listened to this a lot, mainly because I specifically liked the song 'Passing A Message'. From the other albums I really like 'Set The Tigers Free' and 'Restless Endeavour'",
      "topTracks": ["The Waves", "Judgement Call", "Passing A Message", "Rhythm Composer"]
    },
    {
      "filename": "bajka-wonderland.jpg",
      "artist": "Bajka",
      "name": "Bajka in Wonderland",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "madeleine-careless.jpg",
      "artist": "Madeleine Peyroux",
      "name": "Careless Love",
      "releaseyear": "2004",
      "description": "Definitely the quintessential bonding with my Mum album, she was the one who put me onto it when I was a teenager. At the time I was listening to a lot of vocal jazz from the likes of Norah Jones so was able to slip into this album easily. I love most the warm synths in the second verse of 'Youre' gonna make me lonesome', it just feels me with warmth. Otherwise the album is great for gazing out of the window, smoking, feeling pensive, or wondering if you should text him. Special shoutouts to her other album 'Bare Bones' which I also really like",
      "topTracks": ["You're Gonna Make Me Lonesome When You Go", "Between The Bars", "No More", "I'll Look Around", "This Is Heaven To Me"]
    },
    {
      "filename": "stornoway-beachcomber.jpg",
      "artist": "Stornoway",
      "name": "Beachcomber's Windowsill",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "bon-emma.jpg",
      "artist": "Bon Iver",
      "name": "For Emma, Forever Ago",
      "releaseyear": "2007",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "bon-iver.jpg",
      "artist": "Bon Iver",
      "name": "Bon Iver",
      "releaseyear": "2011",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "django-django.jpg",
      "artist": "Django Django",
      "name": "Django Django",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "charli-brat.jpg",
      "artist": "Charli XCX",
      "name": "Brat",
      "releaseyear": "2024",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "broken-bells.jpg",
      "artist": "Broken Bells",
      "name": "Broken Bells",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "lingua-sinner.jpg",
      "artist": "Lingua Ignota",
      "name": "SINNER GET READY",
      "releaseyear": "2021",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "black-hell.jpg",
      "artist": "Black Midi",
      "name": "Welcome to Hell",
      "releaseyear": "2022",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "viagra-cave.jpg",
      "artist": "Viagra Boys",
      "name": "Cave World",
      "releaseyear": "2022",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "ane-seasons.jpg",
      "artist": "Ane Brun",
      "name": "Changing of the Seasons",
      "releaseyear": "2008",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "frank-orange.jpg",
      "artist": "Frank Ocean",
      "name": "Channel ORANGE",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "hiatus-weapon.jpg",
      "artist": "Hiatus Kaiyote",
      "name": "Choose Your Weapon",
      "releaseyear": "2015",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "patrick-close.jpg",
      "artist": "Patrick Watson",
      "name": "Close to Paradise",
      "releaseyear": "2006",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "honne-warm.jpg",
      "artist": "HONNE",
      "name": "Warm on a Cold Night",
      "releaseyear": "2016",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tame-lonerism.jpg",
      "artist": "Tame Impala",
      "name": "Lonerism",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "kendrick-pimp.webp",
      "artist": "Kendrick Lamar",
      "name": "To Pimp a Butterfly",
      "releaseyear": "2015",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "loney-dear.jpg",
      "artist": "Loney Dear",
      "name": "Dear John",
      "releaseyear": "2009",
      "description": "I got to know this artist during my Swedish indie music phase and now this album has a special place in my heart. Most interestingly this album kicks off with two super intense tracks which I'm obsessed with. Later on things calm down but those first two tracks go so hard",
      "topTracks": ["Airport Surroundings", "Everything Turns To You", "Under a Silent Sea", "Dear John"]
    },
    {
      "filename": "loney-hall.webp",
      "artist": "Loney Dear",
      "name": "Hall Music",
      "releaseyear": "2011",
      "description": "This might be one of the most obscure albums on this list, but whatever, this album has been with me for a long time. It's sad, beautiful and has an underlying layer of darkness. This is music for when you've had some bad news and need to feel your feelings. I want to give special shoutouts to the final track which features a different singer. It sounds like the song that would roll during the credits of a romantic thriller from the 80s and has lyrics about hopelessness and giving up and I just love it. It's like giving up and saying goodbye with a smile and a tear in your eye",
      "topTracks": ["Name", "Loney Blues", "D Major", "Largo", "Durmoll", "What Have I Become?"]
    },
    {
      "filename": "björk-debut.jpg",
      "artist": "Björk",
      "name": "Debut",
      "releaseyear": "1993",
      "description": "The only Björk album that I've known for a long time and I associate with some kind of nostalgia. These songs are all so... revolutionary. It feels like she's starting a movement. You listen to it and you just know that so many people have been influenced by it. One thing that really struck me when I first heard 'Venus as a boy' was how cold the production is. Cold as in, not warm and fuzzy love songs, but rather pointy, jaggedy, I guess Icelandic. The lyrics are warm but the strings sound like a fresh breeze that makes you want to curl up under the sheets. Then this album also has some great dance music. Love it so much",
      "topTracks": ["Human Behaviour", "Venus As A Boy", "There's More To Life Than This", "Come To Me", "Play Dead"]
    },
    {
      "filename": "björk-homogenic.jpg",
      "artist": "Björk",
      "name": "Homogenic",
      "releaseyear": "1997",
      "description": "I've been learning about Björk in recent years. Up until this point her music hasn't been 'accessible' enough for me but I realise now that's bullshit. She is amazing. About a year ago I took edibles at home, painted a picture of Lickilicky and listened to her entire discography and it was amazing. I listened and loved Debut when I was younger but she has a whole bunch of other great albums too, including this one. Homogenic I've really latched on to more than her other ones, I think mainly because of 'Bachelorette', which has that film-music vibe, like James Bond, similar to Debut's 'Play Dead'.",
      "topTracks": ["Hunter", "Jóga", "Bachelorette"]
    },
    {
      "filename": "caroline-desire.webp",
      "artist": "Caroline Polachek",
      "name": "Desire, I Want To Turn Into You",
      "releaseyear": "2023",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "natalia-flores.jpg",
      "artist": "Natalia Lafourcade",
      "name": "De Todas Las Flores",
      "releaseyear": "2022",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "school-disconnect.jpg",
      "artist": "School of Seven Bells",
      "name": "Disconnect From Desire",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "mvula-sing.jpg",
      "artist": "Laura Mvula",
      "name": "Sing to the Moon",
      "releaseyear": "2013",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "madonna-erotica.png",
      "artist": "Madonna",
      "name": "Erotica",
      "releaseyear": "1992",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "kylie-rhythm.png",
      "artist": "Kylie Minogue",
      "name": "Rhythm of Love",
      "releaseyear": "1990",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "kylie-fever.jpg",
      "artist": "Kylie Minogue",
      "name": "Fever",
      "releaseyear": "2001",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "dorian-flamboyant.jpg",
      "artist": "Dorian Electra",
      "name": "Flamboyant",
      "releaseyear": "2019",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "dorian-agenda.jpg",
      "artist": "Dorian Electra",
      "name": "My Agenda",
      "releaseyear": "2020",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "beirut-flying.jpg",
      "artist": "Beirut",
      "name": "The Flying Club Cup",
      "releaseyear": "2007",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "nelly-folklore.jpg",
      "artist": "Nelly Furtado",
      "name": "Folklore",
      "releaseyear": "2003",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "hot-heads.jpg",
      "artist": "Hot Chip",
      "name": "In Our Heads",
      "releaseyear": "2012",
      "description": "The quintessential Hot Chip album and probably the CD I have put on the most out of my whole CD collection. It's accessible, so great for parties, and also super interesting and fun to listen to. 'Ends of the Earth' was the first track I ever heard from Hot Chip and it has such a wild intro that I was hooked. 'Don't Deny Your Heart' has the amazing bridge, 'These Chains' makes me want to stop what I'm doing and dance, and 'Flutes' will always remind me of when I saw them live and they spent the whole song turning 90 degrees every 2 bars, Macarena-style. I think they're just a bunch of nerds. I will say that I wish that 'Let Me Be Him' was the final song",
      "topTracks": ["Motion Sickness", "Don't Deny Your Heart", "These Chains", "Flutes", "Ends of the Earth", "Let Me Be Him"]
    },
    {
      "filename": "kimbra-echo.webp",
      "artist": "Kimbra",
      "name": "The Golden Echo",
      "releaseyear": "2014",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "miike-snow.jpg",
      "artist": "Miike Snow",
      "name": "Miike Snow",
      "releaseyear": "2007",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "hard-feelings.jpg",
      "artist": "HARD FEELINGS",
      "name": "HARD FEELINGS",
      "releaseyear": "2021",
      "description": "This is a collaberation between Joe Goddard of Hot Chip and Amy Douglas, who is a larger-than-life personality singing and looking fabulous. This album never really took off but I always loved it. 'Holding on too long' is what hooked me originally, but now I realise that the final two minutes of 'Dangerous' is what it's really all about, as well as the intimacy of 'About Us'. I guess there won't be more of this music but I loved it",
      "topTracks": ["Dangerous", "About Us", "Holding On Too Long", "Sister Infinity"]
    },
    {
      "filename": "pink-heaven.jpg",
      "artist": "PinkPantheress",
      "name": "Heaven Knows",
      "releaseyear": "2023",
      "description": "I have huge respect for PinkPantheress for making something entirely new. A breakbeat album mixed with Gen Z pop with vocals from the popular girl at school. She really embodies the aesthetic of 'pretty girl' with her handbag and won't-do attitude and I'm obsessed. And then she just has this great production, like the very first track which sounds like a sonic game, or 'Capable of Love' which I guess is her longest song and also her best imo",
      "topTracks": ["Another Life", "Mosquito", "Capable of Love"]
    },
    {
      "filename": "anohni-bird.png",
      "artist": "ANOHNI and the Johnsons",
      "name": "I Am A Bird Now",
      "releaseyear": "2005",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "anohni-back.png",
      "artist": "ANOHNI and the Johnsons",
      "name": "My Back was a Bridge for you to Cross",
      "releaseyear": "2023",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "sufjan-illinois.jpg",
      "artist": "Sufjan Stevens",
      "name": "Illinois",
      "releaseyear": "2005",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "bear-heaven.webp",
      "artist": "Bear in Heaven",
      "name": "I Love You, It's Cool",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "jockstrap-jennifer.jpg",
      "artist": "Jockstrap",
      "name": "I Love You Jennifer B",
      "releaseyear": "2022",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "department-ear.jpg",
      "artist": "Department of Eagles",
      "name": "In Ear Park",
      "releaseyear": "2008",
      "description": "In my indie days as a teenager I got into this album because I was a fan of Daniel Rossen from Grizzly Bear. For a folky album it has a very mysterious and dark vibe. You'll get what I mean when you hear the chorus in 'In Ear Park'. I also want to shout out the final track 'Balmy Night', which is about panic, and is definitely up there in terms of favourite ever songs. It feels like something is washing over you when you listen to it crescendo. This album does have a bad track, 'Classical Records'. Really not sure what's going on with that one",
      "topTracks": ["In Ear Park", "Phantom Other", "Floating On The Lehigh", "Balmy Night"]
    },
    {
      "filename": "ultraflex-wellness.jpg",
      "artist": "Ultraflex",
      "name": "Infinite Wellness",
      "releaseyear": "2022",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "ladyhawke-ladyhawke.jpg",
      "artist": "Ladyhawke",
      "name": "Ladyhawke",
      "releaseyear": "2008",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tkay-year.jpg",
      "artist": "Tkay Maidza",
      "name": "Last Year Was Weird Vol 2",
      "releaseyear": "2020",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "feist-metals.jpg",
      "artist": "Feist",
      "name": "Metals",
      "releaseyear": "2011",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "feist-die.jpg",
      "artist": "Feist",
      "name": "Let It Die",
      "releaseyear": "2004",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "feist-reminder.jpg",
      "artist": "Feist",
      "name": "The Reminder",
      "releaseyear": "2007",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "air-moon.jpg",
      "artist": "Air",
      "name": "Moon Safari",
      "releaseyear": "1998",
      "description": "This is a classic album of electronic lounge music which I used to love so much. The first track is such a warm embrace and introduces you to the music and the vibe perfectly. Then there are some great pop tracks like 'Kelly Watch the Stars' and 'You Make It Easy' and 'Sexy Boy', so much to enjoy. I remember the first time I heard this band was the song 'Ce matin-là' on recommendation of an internet friend and I loved it. Nowadays I love 'Le voyage de Pénélope' the most because it's kinda dark. I went to see their 25th anniversary concert but it wasn't very good because they didn't have any stage banter, they just played the songs like on the CD. I was a bit disappointed, but it had a lot to do with the venue (Zitadelle Spandau)",
      "topTracks": ["La femme d'argent", "Sexy Boy", "Kelly Watch the Stars", "You Make It Easy", "Ce matin-là", "Le voyage de Pénélope"]
    },
    {
      "filename": "metronomy-love.jpg",
      "artist": "Metronomy",
      "name": "Love Letters",
      "releaseyear": "2014",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "madvillain-madvillainy.jpg",
      "artist": "Madvillain",
      "name": "Madvillainy",
      "releaseyear": "2004",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "woon-time.webp",
      "artist": "Jamie Woon",
      "name": "Making Time",
      "releaseyear": "2015",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "silvana-marchita.jpg",
      "artist": "Silvana Estrada",
      "name": "Marchita",
      "releaseyear": "2022",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "ana-chama.jpg",
      "artist": "Ana Frango Elétrico",
      "name": "Me Chama De Gato Que Eu Sou Sua",
      "releaseyear": "2023",
      "description": "After watching a disappointing Air concert at Zitadelle Spandau, I went to Ana's concert in a tiny room in Kreuzberg and fucking loved it. She is so badass and cool and I love her take on rock, pop and even disco, always with that delicious Brazilian flair. The album is also pretty queer if you listen to it a lot. The video for 'Insista en Mim' is beautiful, I love it so much",
      "topTracks": ["Electric Fish", "Dela", "Boy of Stranger Things", "Insista em Mim", "Dr. Sabe Tudo"]
    },
    {
      "filename": "röyksopp-melody.jpg",
      "artist": "Röyksopp",
      "name": "Melody AM",
      "releaseyear": "2001",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "animal-merriweather.webp",
      "artist": "Animal Collective",
      "name": "Merriweather Post Pavilion",
      "releaseyear": "2009",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "camera-maudlin.jpg",
      "artist": "Camera Obscura",
      "name": "My Maudlin Career",
      "releaseyear": "2009",
      "description": "I learned about this album during my indie phase as a teenager and loved its very unique vibe. Lots of echo and colour and strings, it sounds like delicate music. My favourite track is 'Careless Love', which has such a lovely string part at the end of the song",
      "topTracks": ["French Navy", "James", "Careless Love", "Honey in the Sun"]
    },
    {
      "filename": "geordie-new.jpg",
      "artist": "Geordie Greep",
      "name": "The New Sound",
      "releaseyear": "2024",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "perfume-ugly.webp",
      "artist": "Perfume Genius",
      "name": "Ugly Season",
      "releaseyear": "2022",
      "description": "I had followed Perfume Genius on twitter because he posted hilarious stuff, and that's how I got kinda excited when he dropped this surprise album. Definitely way more experimental and wild then his more famous albums before it but I dunno I really connected with it. There is a really good run of tracks in the second half which cover a range of vibes. They played two songs from this album at their concert, Eye in the Wall and Photograph, two songs that I utterly adore. Eye in the Wall for its major chords over the almost eerie backing track, and Photograph for its hard hitting lyrics and emotional moments.",
      "topTracks": ["Ugly Season", "Eye in the Wall", "Photograph", "Hellbent"]
    },
    {
      "filename": "simz-thank.jpg",
      "artist": "Little Simz",
      "name": "NO THANK YOU",
      "releaseyear": "2022",
      "description": "Little Simz is so good. I think she's my favourite rapper. And this is my favourite of her albums. So many beautiful tracks as well from Inflo, a producer I love. The video for Gorilla is great, and I love the song 'Silhouette' a lot. Introvert was good and all but for me there were some skips, meanwhile this one is super consistent and great. The last song sounds so nice as well, like she's talking directly to me, her best friend, explaining something she feels she loves",
      "topTracks": ["Gorilla", "Silhouette", "Broken", "Control"]
    },
    {
      "filename": "air-france.jpg",
      "artist": "Air France",
      "name": "No Way Down / On Trade Winds",
      "releaseyear": "2008",
      "description": "These are actually two EPs that I spent my life assuming was one album because that's how I had it saved on my mp3 player. They're a swedish electronic duo and their vibe is particularly special. The music conjures the image of taking a plan to travel to farther shores. The album feels like the soundtrack to a fast paced life-before-your-eyes montage. The combination of marimbas, distant trumpets, whistling, makes this whimsical, tropical feeling, almost like the feeling you get when you take molly. Then when 'Introduction' specifically gives those travelling business class vibes (seriously how did I not know it was two EPs when track 7 was called 'Introduction'), then it crashes into the insane 'Karibien' which is ultra intense, it's like the part at the start when you're REALLY high. When the vocals say 'emergency, sur le dessin bleu' I get shivers. Great album. Albums",
      "topTracks": []
    },
    {
      "filename": "beach-once.jpg",
      "artist": "Beach House",
      "name": "Once Twice Melody",
      "releaseyear": "2022",
      "description": "This band truly have a unique sound! It's so awashed with sound that it feels like you're floating in space. The music feels like a dream, like your vision is hazy and you can't concentrate. And for some reason this album is a mega long 4-disk album! They released it in chunks, so I ended up listening to the first one a bunch, and for me it remains the best part. Although I like the creepy 'Masquerade' and beautiful conclusion 'Modern Love Stories' too. And the whole album, I just like it all",
      "topTracks": ["Once Twice Melody", "Superstar", "Pink Funeral", "Through Me", "Over and Over", "Masquerade", "Modern Love Stories"]
    },
    {
      "filename": "grizzly-yellow.webp",
      "artist": "Grizzly Bear",
      "name": "Yellow House",
      "releaseyear": "2006",
      "description": "I'm a fan of Daniel Rossen and that's how I got into this band. I like a lot of their albums but this is the one I've listened to the most, and the one that I like the most. Mysterious, nebulous music, fairy tale music, hard to say what kind of emotions are coming across. I really like the vibraphone in 'Central and Remote', and I especially love the track 'Reprise' which just has amazing harmony",
      "topTracks": ["Easier", "Central and Remote", "Plans", "On a Neck, On a Spit", "Reprise"]
    },
    {
      "filename": "coldplay-parachutes.jpg",
      "artist": "Coldplay",
      "name": "Parachutes",
      "releaseyear": "2000",
      "description": "Alright I know that people shit on Coldplay but the truth is when I was younger I was a fan. Their newer stuff I'm definitely not into, but these two first albums really slap. They're also genre-defining! Would we even have milky, normie, adult contemporary singer songwriter nonsense without 'Yellow' by Coldplay? Whatever, I really associate this album with those young adult fantasy novels I was reading as a teenager. I still love 'Don't Panic', 'Shiver', 'Sparks' and especially 'High Speed', which is a whole-ass, genuine, actual vibe. Who'd have thought that this berk Chris Martin could make an actual vibe like this.",
      "topTracks": ["Don't Panic", "Shiver", "Spies", "Sparks", "High Speed", "We Never Change"]
    },
    {
      "filename": "coldplay-rush.jpg",
      "artist": "Coldplay",
      "name": "A Rush of Blood to the Head",
      "releaseyear": "2002",
      "description": "God knows I can't stand this band these days but I'm about to come on to my own website and LIE. The truth is I loved Coldplay as a child and these first two albums are great. This particular album has so much going for it and I really associate it with like year 8-ish time at school. I remember watching the music for 'God put a smile upon your face' and being genuinely touched by it. Watching it now as I write this, apart from being put off by them trying to make Chris Martin look hot, it's still good! And the song itself is so good, actually the best Coldplay song. And the album just has a bunch of other great tracks which take me back to that time. I also particularly love the closing track because it's genuinely beautiful, and if you spend any time on this website, you'll quickly learn that I love sad songs. When I found out that my ex-boyfriend Ichsan loved Coldplay I was initially nervous (if you're reading this Ichsan I'm sorry for giving you shit for liking this band), but actually it was really nice bonding about old songs like this.",
      "topTracks": ["Politik", "God Put a Smile upon Your Face", "Green Eyes", "A Whisper", "A Rush of Blood to the Head", "Amsterdam"]
    },
    {
      "filename": "gorillaz-plastic.jpg",
      "artist": "Gorillaz",
      "name": "Plastic Beach",
      "releaseyear": "2010",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "father-comedy.jpg",
      "artist": "Father John Misty",
      "name": "Pure Comedy",
      "releaseyear": "2017",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "roisin-machine.jpg",
      "artist": "Róisín Murphy",
      "name": "Róisín Machine",
      "releaseyear": "2020",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "noname-room.webp",
      "artist": "Noname",
      "name": "Room 25",
      "releaseyear": "2018",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "noname-telefone.jpg",
      "artist": "Noname",
      "name": "Telefone",
      "releaseyear": "2016",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "fanfarlo-rooms.webp",
      "artist": "Fanfarlo",
      "name": "Rooms Filled With Light",
      "releaseyear": "2012",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "thievery-saudade.jpg",
      "artist": "Thievery Corporation",
      "name": "Saudade",
      "releaseyear": "2014",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "seal-seal.jpg",
      "artist": "Seal",
      "name": "Seal",
      "releaseyear": "1994",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "ginger-shinbangumi.jpg",
      "artist": "Ginger Root",
      "name": "SHINBANGUMI",
      "releaseyear": "2024",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "avalanches-since.jpg",
      "artist": "Avalanches",
      "name": "Since I Left You",
      "releaseyear": "2000",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "avalanches-wildflower.jpg",
      "artist": "Avalanches",
      "name": "Wildflower",
      "releaseyear": "2016",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "mum-sing.jpg",
      "artist": "múm",
      "name": "Sing Along To Songs You Don't Know",
      "releaseyear": "2009",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "badbad-slow.jpg",
      "artist": "BADBADNOTGOOD ft. Baby Rose",
      "name": "Slow Burn",
      "releaseyear": "2024",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "nicole-slow.jpg",
      "artist": "Nicole Atkins",
      "name": "Slow Phaser",
      "releaseyear": "2013",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "beach-surfs.jpg",
      "artist": "Beach Boys",
      "name": "Surf's Up",
      "releaseyear": "1971",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "jessie-that.webp",
      "artist": "Jessie Ware",
      "name": "That! Feels Good!",
      "releaseyear": "2023",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "jessie-pleasure.jpg",
      "artist": "Jessie Ware",
      "name": "What's Your Pleasure?",
      "releaseyear": "2020",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "janet-velvet.jpg",
      "artist": "Janet Jackson",
      "name": "The Velvet Rope",
      "releaseyear": "1997",
      "description": "This album has so much going on. I love the ultra chill tracks 'The Velvet Rope' and 'Anything'. She is such a badass and this album takes you so many places. It's got some cheesy tracks but you gotta embrace them. Great to put on at a party at home with cool people. Free Xone is an actual bop, like a real actual Bop.",
      "topTracks": ["Velvet Rope", "Got 'Til it's Gone", "Free Xone", "Anything"]
    },
    {
      "filename": "spellling-turning.jpg",
      "artist": "SPELLLING",
      "name": "The Turning Wheel",
      "releaseyear": "2021",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "sault-rise.jpg",
      "artist": "SAULT",
      "name": "Untitled (Rise)",
      "releaseyear": "2020",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "fujiya-ventrilo.jpg",
      "artist": "Fujiya & Miyagi",
      "name": "Ventriloquizzing",
      "releaseyear": "2011",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "tribe-thank.jpg",
      "artist": "A Tribe Called Quest",
      "name": "We got it from Here… Thank You 4 Your Service",
      "releaseyear": "2016",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "marvin-what.jpg",
      "artist": "Marvin Gaye",
      "name": "What's Going On",
      "releaseyear": "1971",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "lykke-wounded.jpg",
      "artist": "Lykke Li",
      "name": "Wounded Rhymes",
      "releaseyear": "2011",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "slow-yeah.jpg",
      "artist": "Slow Club",
      "name": "Yeah, So",
      "releaseyear": "2009",
      "description": "",
      "topTracks": []
    },
    {
      "filename": "marcos-valle.jpg",
      "artist": "Marcos Valle",
      "name": "Marcos Valle",
      "releaseyear": "1983",
      "description": "I learned about Marcos Valle when I shazamed 'Estrelar' at a party and then I was transported in to the world of Brazilian pop music in the 70s/80s. Just look at the album art, it's so tacky, just like Brazil loves to serve, and I'm obsessed with it. I actually went to his concert in Berlin which was great because the crowd consisted of young gays like me or middle aged Brazilians",
      "topTracks": ["Estrelar", "Fogo do Sol", "Samba de Verão", "Naturalmente", "Dia D"]
    },
    {
      "filename": "erasmo-carlos.jpg",
      "artist": "Erasmo Carlos",
      "name": "Carlos, Eramso",
      "releaseyear": "1971",
      "description": "This is just a great Brazilian rock album that is totally worth your time. The track 'É Preciso...' is so beautiful and energising at the same time. This is the album you can put on in the background of an afternoon gathering, especially if it's in the sun",
      "topTracks": ["É Preciso Dar Um Jeito, Meu Amigo", "Sodoma E Gomorra", "Mundo Deserto", "26 Anos De Vida Normal"]
    }
  ]
}
