{
  "albums": [
    {
      "filename": "laura-alas.jpg",
      "artist": "Laura Marling",
      "name": "Alas I Cannot Swim",
      "releaseyear": "2008",
      "description": "Laura Marling has been with me for a long time and I have always loved her. I used to think her first album is her best and now I feel her new music is that much more mature. But I still love this first album a lot. Here she is singing about men and all the songs are great. She was insanely young when she released this but she had already perfected the staring into the distance while singing look. I originally liked the songs for their chord progressions but now I like them for their pretty concrete lyrics and storytelling",
      "topTracks": ["Ghosts", "Tap At My Window", "Failure", "You're No God", "My Manic And I", "The Captain And The Hourglass", "Shine", "Your Only Doll (Dora)"]
    },
    {
      "filename": "laura-spaek.jpg",
      "artist": "Laura Marling",
      "name": "I Speak Because I Can",
      "releaseyear": "2010",
      "description": "This album was my first contact with her! She is so young and yet she sounds like a wise older woman who has been through some shit. She also sounds super posh on this album, but I'm not against it. When I was young I was really obsessed with 'Goodbye England', but these days I enjoy the final track the most",
      "topTracks": ["Made By Maid", "Alpha Shallows", "Goodbye England (Covered In Snow)", "Darkness Descends", "I Speak Because I Can"]
    },
    {
      "filename": "laura-creature.webp",
      "artist": "Laura Marling",
      "name": "A Creature I Don't Know",
      "releaseyear": "2011",
      "description": "This is when she moved to America and wanted to make more country-sounding music so she could make it big in LA. I don't know her story but I can only imagine it was horrible there. But I'm a US hater and I happen to know she moved back to London. Anyway I don't entirely love the new direction but I love love love the first half of the album. And I have to say the new sound is super innovative and you love to see your favourite artists grow",
      "topTracks": ["I Was Just A Card", "Don't Ask Me Why", "Salinas", "My Friends", "Rest In The Bed", "All My Rage"]
    },
    {
      "filename": "laura-once.jpg",
      "artist": "Laura Marling",
      "name": "Once I Was An Eagle",
      "releaseyear": "2013",
      "description": "Such an ambitious album! Almost twice the length of all the others. It completely full of amazing tracks and I love it. The first half is very distinct from the second half as well. There's this really awesome set of four tracks at the start which all blend into each other perfectly, then it's broken up by the dramatic 'Master Hunter', then it goes into the creepy songs. Then bam, the second half is like the day breaking again and you get a whole bunch of very nice and thoughtful songs",
      "topTracks": ["Take The Night Off", "I Was An Eagle", "You Know", "Breathe", "Devil's Resting Place", "Where Can I Go?", "Once", "When Were You Happy? (And How Long Has That Been)", "Little Bird"]
    },
    {
      "filename": "laura-semper.jpg",
      "artist": "Laura Marling",
      "name": "Semper Femina",
      "releaseyear": "2017",
      "description": "This is such a great album and one that I return to maybe the most out of all of them. It starts with the honestly bewilderingly different 'Soothing', which judging from the video, is about lesbian sex, then the other 8 tracks are all something very different, normal Laura-style sing song guitar tracks. I really love 'Nouel' in particular. The whole thing of the album is femininity and the whole thing reads very queer. I can only assume that this is from when she had a lesbian affair before settling with her current baby daddy",
      "topTracks": ["Soothing", "The Valley", "Wild Fire", "Wild Once", "Nouel", "Nothing, Not Nearly"]
    },
    {
      "filename": "laura-song.jpg",
      "artist": "Laura Marling",
      "name": "Song For Our Daughter",
      "releaseyear": "2020",
      "description": "OK fine this is my favourite Laura album! Despite the name of the album, she doesn't actually have a daughter at this point, but she imagines what it's like. It turns out to be pretty prescient because the next album after this is all about her actual baby! This album also covers many topics like in 'Blow By Blow' which is about dealing with tragedy, or 'The End Of The Affair' which is about saying goodbye and going back to their spouses. It's just all really good",
      "topTracks": ["Alexandra", "Held Down", "Blow By Blow", "Song For Our Daughter", "Fortune", "The End Of The Affair", "Hope We Meet Again", "For You"]
    },
    {
      "filename": "tunng-comments.jpg",
      "artist": "Tunng",
      "name": "Comments of the Inner Chorus",
      "releaseyear": "2006",
      "description": "Careful guys this is another very personal favourite. Tunng are a super great English 'folktronica' band and I've been a mega fan for years. This is their second and I think my favourite album. It's got such beautiful instrumentation, lots of windchimes, wooden sticks and samples of an old man reading. I just heard them close with 'Woodcat' which is kind of a wild choice but it totally worked. I always loved the song 'Stories' because it's so intense and feels like you're running away. Then straight after is 'Jenny Again' which is such a wild and sad story. Actually this song is why I love the name 'Jenny'. The whole second half of the album is just beautiful song after beautiful song. And I especially love the eerie tone of the last two tracks",
      "topTracks": ["Woodcat", "Stories", "Jenny Again", "Man in the Box", "Jay Down", "It's Because... We've Got Hair", "Sweet William", "Engine Room"]
    },
    {
      "filename": "tunng-good.jpg",
      "artist": "Tunng",
      "name": "Good Arrows",
      "releaseyear": "2007",
      "description": "I think one of the more oddball Tunng albums, I still connected with it. Really great hanging-out-with-friends song with 'Cans' at the end of the album. There's so much fun percussion all over this project. A lot of very warm songs. And I love how Tunng vocals are just four people singing the same note all together all the time",
      "topTracks": ["Bricks", "Hands", "Spoons", "King", "Arms", "String", "Cans"]
    },
    {
      "filename": "tunng-land.jpg",
      "artist": "Tunng",
      "name": "...And Then We Saw Land",
      "releaseyear": "2010",
      "description": "The first Tunng album I got into! Lots of nostalgia attached to this one, and so many great tracks. Only hearing it in concert recently do I appreciate 'The Roadside' for what it is, a song about having sex on the roadside. Otherwise we have the amazing 'Weekend Away' which is a very special vibe. In general I appreciate how Tunng don't songs about love and relationships, mainly about other random shit",
      "topTracks": ["It Breaks", "The Roadside", "October", "Sashimi", "With Whiskey", "Santiago", "Weekend Away"]
    },
    {
      "filename": "tunng-turbines.jpg",
      "artist": "Tunng",
      "name": "Turbines",
      "releaseyear": "2013",
      "description": "Potentially my favourite Tunng album. Just listen to the first track and you'll see what I mean. The theme of cycles definitely comes round in many tracks. The mental image of turbines spinning does suit the looping music very well. I especially love 'By This' and 'Bloodlines' for this reason. My favourite track though is 'Embers'. You know how sometimes you really latch on to particular songs, and this happened here. When they played it live in Switzerland, they extended it with a really intense drum solo and it was fucking awesome",
      "topTracks": ["Once", "Trip Trap", "By This", "Bloodlines", "Embers"]
    },
    {
      "filename": "tunng-love.jpg",
      "artist": "Tunng",
      "name": "Love You All Over Again",
      "releaseyear": "2025",
      "description": "When I saw them play in Berlin they really did play all the best tracks from this album. They are so dainty and cute, with that element of darkness that they tend to have. 'Didn't Know Why' continues in the universe of Jenny, this time she is swallowing flies and stuff. I also really like the synths in 'Deep Underneath' when the chorus finally crash lands. Finally, what did the snails do??",
      "topTracks": ["Everything Else", "Didn't Know Why", "Sixes", "Snails", "Deep Underneath", "Levitate a Little"]
    },
    {
      "filename": "janelle-metropolis.jpg",
      "artist": "Janelle Monáe",
      "name": "Metropolis: The Chase Suite",
      "releaseyear": "2007",
      "description": "Janelle Monáe is everything. For a long time she was my favourite artist because of her visionary concept albums and amazing afro-futurist vibes. It all started here with this EP! Imagine you get your big break and your first signed release is a small concept album about an android who falls in love with a human, then gets persecuted by the totalitarian regime for it. The android in question, Cindi Mayweather, an alpha platinum 3000, gets captures during 'Many Moons' (make sure to watch the music video for that, it's wild), and becomes a revolutionary during 'Sincerely, Jane' which is by the way the most ambitious and fascinating song she ever made. I actually love it so much. When you read the lyrics it becomes clear that it's more than just a sci-fi story though. She's talking about current topics, and that is hugely relevant. Anyway once you've appreciated these amazing tracks go blow your minds by listening to the follow-up, The ArchAndroid",
      "topTracks": ["Violet Starts Happy Hunting!!!", "Many Moons", "Sincerely, Jane"]
    },
    {
      "filename": "janelle-arch.jpg",
      "artist": "Janelle Monáe",
      "name": "The ArchAndroid",
      "releaseyear": "2010",
      "description": "This is her magnus opus. It's an insanely ambitious sci-fi concept album about a character that she plays, Cindi Mayweather, an android who is persecuted for falling in love with a human. The story follows on from her previous EP 'Metropolis' and is about Cindi discovering herself, rallying the troops and fulfilling her destiny as the ArchAndroid. As you listen to the album though it becomes clear that being an android is actually just a metaphor for being the 'other'. For example being a woman, or being black, or being queer. How would we treat androids if they were going around society stealing our husbands? It's a pretty interesting thought. In the story, she hopes to lead the people to 'BaBobByeYa', some kind of utopia where there is no police brutality, and this album is about her journey to do that. God this album is just drenched in such a magical vibe, definitely because of the sci-fi setting, although it is definitely rooted in black music, hip hop and soul. I love the first couple of tracks, how they blend into each other. 'Locked Inside' is actually woke as fuck, and I love the looping chords. 'Mushrooms & Roses' I love because it's where she finds community, and also queer love. I also think it's a bit like, take psychedelics once and then realise you want to change the world. The second half of the album has a dud in it, 'Make The Bus'. Why did Of Montreal muscle their way into this perfect album like this. It's a disappointment and I often skip it. But then it heads into the most magical final tracks of the album where Cindi realises her duty as a revolutionary leader. 'Say You'll Go' straight up has Clair de Lune in it which is just so nice. And I can't say exactly why but the vibe of this track really reminds me of the film 'Melancholia', a film which I regularly think about. And finally there is this insane orchestral overture at the end to finish off the album. It's so dramatic and beautiful, and it elevates the album into some kind of epic tale. I love it. This is one of my favourite albums of all time, for sure",
      "topTracks": ["Dance or Die", "Faster", "Locked Inside", "Cold War", "Mushrooms & Roses", "Neon Valley Street", "Wondaland", "Say You'll Go", "BaBobByeYa"]
    },
    {
      "filename": "janelle-electric.jpg",
      "artist": "Janelle Monáe",
      "name": "The Electric Lady",
      "releaseyear": "2013",
      "description": "This follow-up album takes the sci-fi concept from her previous works and tells the story of Cindi Mayweather from a different angle, her growing up and learning about her place in the world. It's like an origin story, and it serves to further link the 'otherness' that she feels with her 'androidness'. In this album she is inspired by great artists, by ghetto women and also comes to terms with her queerness. I love it so much. It isn't quite as ambitious as the ArchAndroid but I really love the new tone she strikes, and some of these tracks are just so, so good. The opener with Prince is great, especially the ending, then there is the incredible 'Q.U.E.E.N.'. This is where I first got into Erykah Badu! It's all thanks to Janelle Monáe. Playing with the ambiguity between the words 'queen' and 'queer' is genius, and the songs features this amazing breakdown before the rap at the end which I love. I mean, great production. These albums are split into suites and the second suite of the album is one of my favourites of this whole series. It's less bombastic than the first half but it's just beautiful song following by beautiful song.I just love the chord progressions in 'Ghetto Woman', 'Can't Live Without Your Love', and especially 'Dorothy Dandridge Eyes', which is also how I got into Esperanza Spalding! Thank you Janelle again!! This album really is different from the previous ones but I love it just as much",
      "topTracks": ["Givin' Em What They Love", "Q.U.E.E.N.", "Electric Lady", "Primetime", "It's Code", "Ghetto Woman", "Can't Live Without Your Love", "Sally Ride", "Dorothy Dandridge Eyes"]
    },
    {
      "filename": "janelle-dirty.jpg",
      "artist": "Janelle Monáe",
      "name": "Dirty Computer",
      "releaseyear": "2018",
      "description": "To tell you I was hyped for this release would be a huge understatement, not least because she dropped a whole ass film to go with it. Talk about ambition! I have to say though, I was disappointed that this release doesn't explicitly continue the story of Cindi Mayweather from her previous concept albums, but rather offers a more generic view of otherness through the lens of the present. At first I thought she was dumbing things down a bit, but I ended up coming round to this album. I can only imagine how it must feel for her, having released this complicated series of stories - she must have felt a lot of pressure to continue, when actually she wanted to write songs about how she was feeling in the moment. This album still does have that concept album vibe, with the same sci-fi beats so I am satisfied, although it's not as explicit as before. One thing that's special about this though is that it's the album where she officially came out as queer - up until this point it was just hinted at, but now she goes hard in on that. If I were to describe the vibe of this album is would be having a party with your friends from marginalised groups, smiling, laughing, dancing and also crying because we're all screwed. I specifically really got into the song 'Screwed' for one summer in 2019...",
      "topTracks": ["Dirty Computer", "Crazy, Classic, Life", "Take a Byte", "Screwed", "Don't Judge Me"]
    },
    {
      "filename": "janelle-age.jpg",
      "artist": "Janelle Monáe",
      "name": "The Age of Pleasure",
      "releaseyear": "2023",
      "description": "As a Janelle Monáe mega-fan I was less hyped for this release because it was clear she is drifting away from her ambitious sci-fi concept albums, and when this dropped I didn't even like it. I thought, this is just an album about having fun, having sex and enjoying being rich, which she is now. She's clearly spent a lot of time with a bunch of awesome queer black people and just wanted to make an album about how great her life is at the moment. It's like the song 'Wondaland' from the ArchAndroid, but I don't think it's like 'BaBopByeYa', like we haven't made it yet. Still, as usual with Janelle I came round to it. Even though the instrumentation is less lush and it's more trap/hip hop than soul, it has some really great moments. She totally slays on 'Haute' and there's this great performance she did of it on youtube where she just looks so good dancing to that song. And I love the song 'Only Have Eyes 42'. She's clearly in her polyamory phase! I'm sure that will fall apart, like all polyamorous relationships do. Looking forward to the next album at least!",
      "topTracks": ["Champagne Shit", "Haute", "Only Have Eyes 42"]
    },
    {
      "filename": "jens-dog.webp",
      "artist": "Jens Lekman",
      "name": "When I Said I Wanted To Be Your Dog",
      "releaseyear": "2004",
      "description": "One thing I will always love about Jens Lekman is he will explicitly the name the people in his life when telling his anecdotes in his songs. Case in point, singing a new happy birthday song to his mate Lisa. His lyrics are always so literal and concrete and I love that. There is a run of tracks in the middle of this album which are so peaceful and melancholic, and they give the album such a vibe which is really matched by the album art. Some of the songs are silly as well but fuck it, they're still great. This is early, raw Jens and we should all take some time to enjoy it",
      "topTracks": ["Happy Birthday, Dear Friend Lisa", "If You Ever Need A Stranger", "Silvia", "The Cold Swedish Winter", "Psychogirl", "When I Said I Wanted To Be Your Dog"]
    },
    {
      "filename": "jens-night.jpg",
      "artist": "Jens Lekman",
      "name": "Night Falls Over Kortedala",
      "releaseyear": "2007",
      "description": "Jens the cheeky bastard did not clear his samples when making this album and at some point he had to pull it from streaming services, so he released a new version with redone samples and instruments. It's weird to hear such a beloved album be reconstructed like this. The vast majority is the same, but in some parts it's different. The most glaring example is 'Kanske...' which notably worse now... but it's fine, it just makes my CD of the original that much more valuable! This album really is the quintessential Jens though. It's got everything, and so many classics, like 'The Opposite of Hallelujah', which contains one of my favourite lyrics: 'I picked up a seashell to illustrate my homelessness, but a crab crawled out of it making it useless'. This also has an all-time favourite 'Postcard to Nina' about going to Berlin (!) to meet with a penpal who makes him pretend to be her boyfriend so she can be with her girlfriend. In the re-released version he adds a bonus track which revisits the story of Nina and it's just perfect. It pulls at my heartstrings every time and I would pay anything to see it live",
      "topTracks": ["The Opposite of Hallelujah", "A Postcard to Nina", "Shirin", "It Was a Strange Time in My Life", "Kanske Är Jag Kär i Dig", "Radio NRJ", "The Linden Trees Are Still In Blossom"]
    },
    {
      "filename": "jens-argument.webp",
      "artist": "Jens Lekman",
      "name": "An Argument With Myself",
      "releaseyear": "2011",
      "description": "This is the first Jens I heard and I immediately became an instant fan. His lyrics are so dumb and so very literal and I just fucking love it. He writes songs about very concrete things and that's why I love him. All these songs are great anecdotes in and of themselves and they're also great bangers as well. It's a short EP but top quality",
      "topTracks": ["An Argument With Myself", "Waiting for Kirsten", "A Promise", "New Directions"]
    },
    {
      "filename": "jens-love.webp",
      "artist": "Jens Lekman",
      "name": "I Know What Love Isn't",
      "releaseyear": "2012",
      "description": "Can you believe I went to Stockholm and I missed Jens Lekman by a day? He was doing signings of this album and I was devastated. Whatever, I loved this album so much. Unlike his other stuff, this album has a special and consistent vibe. It's full of major 7ths and airy strings and I love it. Highlight for me is 'The World Moves On' which gives snapshots of his time living in Australia",
      "topTracks": ["Erica America", "Become Someone Else's", "I Want A Pair Of Cowboy Boots", "The World Moves On", "I Know What Love Isn't"]
    },
    {
      "filename": "jens-life.jpg",
      "artist": "Jens Lekman",
      "name": "Life Will See You Now",
      "releaseyear": "2017",
      "description": "Another great album from Jens, although I have some issues with some of the songs! I enjoy 'Evening Prayer' because it's a bop, but is it about feeling sorry for yourself because it's hard to be the friend of someone who's having a bad time? Whatever it's still good. Why not have a song about trying to be a good friend. 'How We Met...' is a lot of fun, and the last two tracks genuinely hard in a way that Jens Lekman songs don't tend to do",
      "topTracks": ["Evening Prayer", "Hotwire the Ferris Wheel", "How We Met, the Long Version", "Postcard #17", "Dandelion Seed"]
    },
    {
      "filename": "amy-frank.jpg",
      "artist": "Amy Winehouse",
      "name": "Frank",
      "releaseyear": "2003",
      "description": "The first Amy album is the realest. She is everything. She is so real. She's writing songs about being unfaithful, being upset in her boyfriend not living up to his gender, 30-something trashy party girls because that's what was on her mind. She really gave no fucks! Then on top of that, the music is produced beautifully. 'In My Bed' sounds like an actual Portishead song. And then her voice! This album is great for listening to when lounging around the house after sex",
      "topTracks": ["Stronger Than Me", "You Sent Me Flying", "I Heard Love Is Blind", "In My Bed", "Take The Box", "What Is It About Men"]
    },
    {
      "filename": "amy-black.jpg",
      "artist": "Amy Winehouse",
      "name": "Back to Black",
      "releaseyear": "2006",
      "description": "Her big album, absolutely filled to the brim with classics. The lyrics alone... about refusing to go to rehab, getting absolutely fucked up by men and relationships, her tears drying on their own, they hit hard knowing how she died so soon after this. And then there's just 'Addicted' at the end about getting pissed at people stealing her weed, because she continues to not give any fucks. I just love her so much",
      "topTracks": ["Rehab", "You Know I'm No Good", "Just Friends", "Back To Black", "Love Is A Losing Game", "Tears Dry On Their Own", "Addicted"]
    },
    {
      "filename": "erykah-baduizm.jpg",
      "artist": "Erykah Badu",
      "name": "Baduizm",
      "releaseyear": "1996",
      "description": "Her original album, her breakout and hell yeah. This is where you can pinpoint the origin of neo-soul. This album inspired so many artists to make chill, hip-hop infused music and you hear it everywhere today. It's all thanks to Erykah! This is perfect background music for smoking weed with friends. And I have to highlight the stunning 'Other Side Of The Game', an odyssey into life expecting a child. Stunning, beautiful",
      "topTracks": ["On & On", "Other Side Of The Game", "Next Lifetime", "Certainly", "No Love", "Sometimes"]
    },
    {
      "filename": "erykah-mama.jpg",
      "artist": "Erykah Badu",
      "name": "Mama's Gun",
      "releaseyear": "2000",
      "description": "I love Erykah Badu, she is everything. I got hooked on this album after watching her amazing Tiny Desk concert where she plays the 10 minute break up song 'Green Eyes', the closer of this album. When she says 'I don't know why I fucked with you' that's the final nail in the coffin, she has finally moved on. I also love love love the track 'Orange Moon' and intend to sing it to any and all future lovers. And also the chill bit at the end of 'Time's a wastin', and the amazing remix of her hit 'On & On' called '...& On'",
      "topTracks": ["My Life", "...& On", "Cleva", "A.D. 2000", "Orange Moon", "In Love With You", "Time's A Wastin", "Green Eyes"]
    },
    {
      "filename": "erykah-worldwide.jpg",
      "artist": "Erykah Badu",
      "name": "Worldwide Underground",
      "releaseyear": "2003",
      "description": "This album is where Erykah is at her most hip-hop. She's such a bad-ass. She's also having a lot of fun on here. This is a groovy vibe painting a picture of life in Black America. It's just a great album and when I heard her play 'I Want You' live, it was a great moment",
      "topTracks": ["Back In The Day", "I Want You", "Woo", "Danger", "Think Twice", "Love Of My Life Worldwide"]
    },
    {
      "filename": "erykah-america-1.jpg",
      "artist": "Erykah Badu",
      "name": "New Amerykah Part One (4th World War)",
      "releaseyear": "2008",
      "description": "She really went wild with some of these album titles but don't be put off, this is one of her finest. 'Master Teacher Medley' is literally where she popularised the word 'woke'. It's a historical song! Then you've got a personal favourite 'Soldier' which is so sad and will make you fire up in anger. It's also not tuned to an actual key, the music sits between the notes, which isn't something you hear often at all. Then there's the stunning 'Telephone' which becomes a precursor to a later album, and the banger pop track 'Honey' at the end. So much to love!",
      "topTracks": ["The Healer", "Me", "Soldier", "Master Teacher Medley", "Telephone", "Honey"]
    },
    {
      "filename": "erykah-america-2.jpg",
      "artist": "Erykah Badu",
      "name": "New Amerykah Part Two: Return Of The Ankh",
      "releaseyear": "2010",
      "description": "This was my first introduction to Erykah, specifically the song 'Window Seat'. It didn't take long for me to get absorbed into the album with beautiful tracks like '20 Feet Tall' or the intro to the final track. This album made it on to a lot of playlists when I was living in Saarland",
      "topTracks": ["20 Feet Tall", "Window Seat", "Get MuNNY", "Gone Baby, Don't Be Long", "Umm Hmm", "You Loving Me (Session)", "Out My Mind, Just In Time"]
    },
    {
      "filename": "erykah-caint.jpg",
      "artist": "Erykah Badu",
      "name": "But You Caint Use My Phone",
      "releaseyear": "2015",
      "description": "This is such a cheeky mixtape! It features interpolations and covers of a bunch of other songs relating in somewhere to telephones. It starts with a play on her popular ad-libbed track 'Tyrone', then pretty quickly goes into this insane cover of Drake's (only good song) Hotline Bling. This album also introduced me to 'Hello It's Me' by Todd Rundgren, a beautiful song that she really does justice. She even gets previous lover Andre 3000 to feature on it",
      "topTracks": ["Cel U Lar Device", "U Use To Call Me", "U Don't Have to Call", "What's Yo Phone Number / Telephone", "I'll Call U Back", "Hello"]
    },
    {
      "filename": "regina-11.jpg",
      "artist": "Regina Spektor",
      "name": "11:11",
      "releaseyear": "2001",
      "description": "Regina's roots! Her first music was very jazzy but still featured that idiosyncratic piano that we love her for, as well as her astute lyrics. The second track is just her with a double bass, wild. 'Back of a Truck' is like a gospel anthem, and 'Pavlov's Daughter' is so good just in general. I love the little drum machine at the start before it gets going",
      "topTracks": ["Love Affair", "Back of a Truck", "Pavlov's Daughter"]
    },
    {
      "filename": "regina-songs.jpg",
      "artist": "Regina Spektor",
      "name": "Songs",
      "releaseyear": "2002",
      "description": "This particular album contains lots of very special songs. This is where she consolidated that piano + remarkable lyrics combo. It's so arty and thought-provoking! 'Reading Time with Pickle' is so weird the way she sounds drugged, and some of the other lyrics really make you wonder where she gets her material. This is also the origin of popular song 'Samson' which has a nice slower version here. Also I want to shout out 'Lounge' for it's insane, lavish piano chords",
      "topTracks": ["Samson", "Reading Time with Pickle", "Consequence of Sounds", "Daniel Cowman", "Aching to Pupate", "Lounge", "Lacrimosa"]
    },
    {
      "filename": "regina-soviet.jpg",
      "artist": "Regina Spektor",
      "name": "Soviet Kitsch",
      "releaseyear": "2004",
      "description": "The mother of all Regina albums, and one of my favourite albums of all time. This is her breakout and features some of the most prescient and thoughtful songs she's ever written. This had me learning how to play 'Ode to Divorce' on the piano as a 13 year old singing to myself 'I need your money!'. I also learned how to play 'Somedays' and 'Ghost of Corporate Future' which I love so so much. Each one tells its own kind of specific story, and each time they come with important life lessons. 'Chemo Limo' is about a woman who rents a limousine instead of spending money on chemotherapy so that she can go out in style with her four kids. The song is a wild ride",
      "topTracks": ["Ode to Divorce", "Carbon Monoxide", "Us", "Ghost of Corporate Future", "Chemo Limo", "Somedays"]
    },
    {
      "filename": "regina-begin.jpg",
      "artist": "Regina Spektor",
      "name": "Begin to Hope",
      "releaseyear": "2006",
      "description": "Considering that this era of Regina was very pop-heavy, isn't it amazing that she never writes songs about sex and relationships? Sometimes love is involved, but as evidenced here in the album, she's mainly singing about eating boxes of tangerines, castrated people, or traveling around Europe.",
      "topTracks": ["Samson", "Field Below", "Après Moi", "Summer in the City", "Another Town", "Düsseldorf", "Bartender"]
    },
    {
      "filename": "regina-far.jpg",
      "artist": "Regina Spektor",
      "name": "Far",
      "releaseyear": "2009",
      "description": "Her poppiest album by far and she's still not singing about sex and relationships. Instead it's about being hooked into a machine, winning the Human of the year award, or finding someone's wallet on the ground. These songs are so fun and so interesting, she is just magical like that. Her bubbly and lovely personality shines through on 'Wallet', but she also shows her darker side on 'Genius Next Door' and the beautiful 'Man of a Thousand Faces'",
      "topTracks": ["The Calculation", "Laughing With", "Human of the Year", "Genius Next Door", "Wallet", "Man of a Thousand Faces"]
    },
    {
      "filename": "regina-cheap.jpg",
      "artist": "Regina Spektor",
      "name": "What We Saw from the Cheap Seats",
      "releaseyear": "2012",
      "description": "I associate this album with the time I went interrailing when I was 18. I was humming these songs as I traveled around, especially in Italy. That trip wasn't great, looking back. I hadn't grown up enough to truly enjoy it, I think. But I truly did enjoy the album. 'Firewood' is so beautiful and so transparent and always brings a tear to my eye. She doesn't just write a song about someone lying in a hospital bed thinking they might die, she writes a song about keeping hope that they won't die, and in fact the piano isn't firewood yet",
      "topTracks": ["Small Town Moon", "Firewood", "Patron Saint", "Ballad of a Politician", "The Party"]
    },
    {
      "filename": "regina-remember.jpg",
      "artist": "Regina Spektor",
      "name": "Remember Us to Life",
      "releaseyear": "2016",
      "description": "It's between this and Soviet Kitsch when it comes to favourite Regina albums. It has such a great variety of beautiful and thoughtful songs. And STILL none of them are about sex and relationships. They're about gazing at a photograph, forgotten manuscripts, a mystical demon hotel, how nobody wins when it comes to selling flowers because they just die. I think my favourites are the bonus tracks, especially the song about new year. New year is a part of everyone's lives, how often do you get to hear a song about it?",
      "topTracks": ["Black and White", "The Trapper and the Furrier", "Sellers of Flowers", "The Visit", "New Year", "The One Who Stayed and the One Who Left", "End of Thought"]
    },
    {
      "filename": "regina-home.jpg",
      "artist": "Regina Spektor",
      "name": "Home, before and after",
      "releaseyear": "2022",
      "description": "This album I listened to when I visited Lyon in 2022, and I associate it with that trip. It's not up there with the best Regina albums but I'm a die-hard fan so what are you gonna do. It does feature some revamped old songs, something that she loves to do, 'Raindrops' and the amazing 'Loveology'. I also really enjoy the choruses of 'SugarMan' and 'Coin'. Actually there's a bunch of great stuff here",
      "topTracks": ["Raindrops", "SugarMan", "Coin", "Loveology"]
    },
    {
      "filename": "rhye-woman.jpg",
      "artist": "Rhye",
      "name": "Woman",
      "releaseyear": "2013",
      "description": "You don't understand the true meaning of love until you listen to this album. This is by far the most sensual album on this list and this list contains four Sade albums, so get prepared. This is the kind of album that you need to have lube for. This is the kind of album you put on when that fuckbuddy who you're developing feelings for comes over. It's an album for cuddling. 'The Fall' is the most perfect falling in love song ever. It's immaculately produced and to this day it blows me away with its beauty. Other favourites are 'Shed Some Blood' and 'Major Minor Love', all of which firmly on the babymaking playlist",
      "topTracks": ["Open", "The Fall", "Last Dance", "Shed Some Blood", "3 Days", "Major Minor Love", "Woman"]
    },
    {
      "filename": "rhye-blood.webp",
      "artist": "Rhye",
      "name": "Blood",
      "releaseyear": "2018",
      "description": "This follow-up to the sexiest album ever is almost equally as sexy. Although again it's not SEXY sexy, it's more about making love. It's about cuddling, talking about your connection, agreeing a safe word and then having sex. These songs are LOVE songs. My friend Mariana and I went to see them live once and we bonded over how the lyric 'see me fall from your eyes to your waist' is about giving a blowjob. I especially love the final track which switches things up vibes-wise",
      "topTracks": ["Waste", "Taste", "Count To Five", "Song For You", "Blood Knows", "Stay Safe", "Sinful"]
    },
    {
      "filename": "rhye-home.jpg",
      "artist": "Rhye",
      "name": "Home",
      "releaseyear": "2021",
      "description": "This album clears my skin and brings me peace of mind. The choral music that sporadically comes in is so pure and clean, it makes me wish the whole thing was just a choral album. I super connected with this album and you should do. It's less outside sexy like the previous albums but dafür it's more sophisticated and luscious. Definitely take a moment to appreciate the very end of the album",
      "topTracks": ["Intro", "Come In Closer", "Beautiful", "Safeword", "Hold You Down", "Need A Lover", "Holy"]
    },
    {
      "filename": "kkb-intro.jpg",
      "artist": "Kero Kero Bonito",
      "name": "Intro Bonito",
      "releaseyear": "2013",
      "description": "Where do I even begin with this wild album. I love this band because they shamelessly use video game music samples and that is never more so than on their first album. 'Sick Beat' literally uses the Super Mario 64 sound throughout the whole song and I am here for that. I can't even imagine what possessed them to make a band and do music like this. They're clearly having a lot of fun doing it, which is what makes it so delightful. I also feel like this album is the blueprint for a lot of their future stuff. Big hit 'I'd Rather Sleep' hints at the mental breakdowns present in 'Time 'n' Place' and takes the twee fairy-like music and combines it with a uniquely scary lyrics about not wanting to wake up",
      "topTracks": ["Bonito Intro", "Intro Bonito", "Sick Beat", "My Party", "Kero Kero Bonito", "Pocket Crocodile", "I'd Rather Sleep"]
    },
    {
      "filename": "kkb-generation.jpg",
      "artist": "Kero Kero Bonito",
      "name": "Bonito Generation",
      "releaseyear": "2016",
      "description": "This is it, the real deal! Kero Kero Bonito go crazy and make an album full of happy-go-luck Jpop for children, except it's fucking good. It's a huge party with very simple lyrics and it fucking slaps. On multiple listens you realise that there is more going on underneath the surface, but I implore you, dear reader, to just treat yourself to the painfully positive vibes all across this album. Gosh selecting top tracks was too hard so I just put them all down. I love the first track for its beautiful synth chords at the end, 'Heard a song' for being a catchy song about trying to remember a catchy song (another favourite lyric: 'I don't know you but that sounds fresh!'). 'Graduation' is super funny, 'Fish Bowl' has this shoegaze section, I'm obsessed, 'Big City' is literally city pop and I love city pop. 'Break' is so real. And they partly filmed the video in Berlin! 'Lipslap' is full of hilarious lyrics ('I'm not one to lip read and you don't come with subtitles!'), 'Try Me' is hilarious because of the 'business, dancing, throwing a party with you!' line, 'Paintbrush' is also hilarious because it's in Japanese except for the word 'Paintbrush', and 'Trampoline' is just a straight up BOP. OK I'll stop, but the last two tracks are great too",
      "topTracks": ["Waking Up", "Heard a Song", "Graduation", "Fish Bowl", "Big City", "Break", "Lipslap", "Try Me", "Paintbrush", "Trampoline", "Picture This", "Hey Parents"]
    },
    {
      "filename": "kkb-time.jpg",
      "artist": "Kero Kero Bonito",
      "name": "Time 'n' Place",
      "releaseyear": "2018",
      "description": "When this band released the single 'Only Acting' after the previous album Bonito Generation, KKB fans were SHOOK. They have gone from bubblegum pop to noise rock and holy shit it was so exciting. This album exposes what was lying underneath the happy-go-lucky vibes and lyrics of their old stuff and suggests that they were all mentally ill the whole time and putting on a face! 'Time Today', which I love, as well as 'Visiting Hours' both take place in a mental hospital, and at two points in the album there are moments were everything breaks down into horrible noise, complete with screaming and gunshots. But that doesn't mean the album has gone full sicko mode, the video game influences and pop vibes from their old stuff is still well and truly there, and there are a number of tracks which are even nice! I love the ending of 'Dear Future Self' and of course 'Swimming'. The fact they went this direction just shows how they are totally cool with reinventing themselves and that's what makes them one of the most innovative and exciting bands ever",
      "topTracks": ["Time Today", "Only Acting", "Dump", "Dear Future Self", "Swimming", "Rest Stop"]
    },
    {
      "filename": "kkb-civilisation.jpg",
      "artist": "Kero Kero Bonito",
      "name": "Civilisation",
      "releaseyear": "2021",
      "description": "I love all the KKB albums but THIS ONE! This is the one which has Fraser Bowen written all over it. This is my jam. This is my shit. When I first heard 'Battle Lines' I thought it Streets of Rage! The video game influences are everywhere. I truly truly truly believe that the drum loops in that song as 'The River' are inspired from Pokemon Mystery Dungeon, and I will not rest until I personally meet the band and ask them to confirm this. Those two songs by the way have such good lyrics. Bonito Generation seems so long ago when they start singing about dividing populations and making a disaster state so you can stay in power. This album originally came out as two EPs and they were my most listened to music of their respective years, I love them that much. I loved the poppy 'Princess and the Clock', and especially the last two tracks. The 7 minute extension of 'Rest Stop' from the previous album is insane. They teased that track on a youtube video and I watched that teaser so many times I'm almost embarrassed to admit it. If you want to get to know me better, please give this album a listen",
      "topTracks": ["Battle Lines", "When The Fires Come", "The River", "The Princess and the Clock", "21/4/20", "Well Rested"]
    },
    {
      "filename": "norah-come.jpg",
      "artist": "Norah Jones",
      "name": "Come Away With Me",
      "releaseyear": "2002",
      "description": "I am a Norah Jones mega fan and this is of course her big hit album. Of course I love it. Many of these tracks are classics. Her voice is amazing. My favourite Norah Jones stuff will come later in her career but this is still timeless and I often come back to it. I've always particularly loved 'The Nearness of You' and have sang that to myself on the piano many times",
      "topTracks": ["Don't Know Why", "Seven Years", "Come Away With Me", "Shoot The Moon", "Turn Me On", "Lonestar", "I've Got To See You Again", "Painter Song", "Nightingale", "The Long Day Is Over", "The Nearness of You"]
    },
    {
      "filename": "norah-feels.jpg",
      "artist": "Norah Jones",
      "name": "Feels Like Home",
      "releaseyear": "2004",
      "description": "I really related to early Norah Jones, when she appeared to be an shy and quiet person making nice things. Later she became strong and confident but I saw myself in this Norah back then. Lots of these songs mean a lot to me today. 'Humble Me' is just so real. And 'Don't Miss You At All' is yet another singing to myself at the piano situation",
      "topTracks": ["Sunrise", "What Am I To You?", "Carnival Town", "Be Here To Love Me", "Creepin' In", "Humble Me", "Above Ground", "Don't Miss You At All"]
    },
    {
      "filename": "norah-not.jpg",
      "artist": "Norah Jones",
      "name": "Not Too Late",
      "releaseyear": "2007",
      "description": "This is actually the first Norah album where she wrote the songs herself! The two classics before she has other writers do the heavy lifting for her and she just carried with her voice and vibes. But dear reader this is where the real Norah actually comes out. Listening to the lyrics of 'Not My Friend' you get the idea that she's singing about real shit now. 'Not Too Late' joining the list of beautiful closers that I sing to myself on the piano because I love them so much",
      "topTracks": ["Wish I Could", "Sinkin' Soon", "The Sun Doesn't Like You", "Until The End", "Not My Friend", "Thinking about You", "Little Room", "Rosie's Lullaby", "Not Too Late"]
    },
    {
      "filename": "norah-fall.jpg",
      "artist": "Norah Jones",
      "name": "The Fall",
      "releaseyear": "2009",
      "description": "Norah reinvents herself on this album. She is still peaceful and calm but she is also confident and trying new things. I mean it's album 4 you gotta do it. I largely think she kinda misses on the big tracks if I'm honest. But I included the album in the list anyway because I love her and because some of the (quieter...) songs remain some of my favourites. 'Back To Manhatten' alone, man...",
      "topTracks": ["Even Though", "Waiting", "You've Ruined Me", "Back To Manhattan", "Stuck", "December", "Man Of The Hour"]
    },
    {
      "filename": "norah-hearts.jpg",
      "artist": "Norah Jones",
      "name": "Little Broken Hearts",
      "releaseyear": "2012",
      "description": "This is the album where Norah proves herself as a visionary genius, next to all the other things she's already proven herself as. Something about my favourite track being 'After The Fall', referring to the previous album 'The Fall' which I didn't vibe all as much with, is kind poetic. It's got this beautiful and hypnotic guitar loop and I love it. A second totally exceptional track is the final one 'All A Dream' which is longer than your average Norah track and I love it. Such a special and unique vibe. Also this is the time when she released a single about murder",
      "topTracks": ["Good Morning", "After The Fall", "Travelin' On", "Out On The Road", "Miriam", "All A Dream"]
    },
    {
      "filename": "fleet-foxes.webp",
      "artist": "Fleet Foxes",
      "name": "Fleet Foxes",
      "releaseyear": "2008",
      "description": "Just like many of the OG Spotify users around this time, I was forced to listen to 'White Winter Hymnal' because it was one of the early adverts on there. Anyway, I loved it and that's how I got into Fleet Foxes. This album is what really reminds of spring time more than any other album. The start of 'Ragged Wood' is great for cycling in the sun. 'Meadowlarks' is the kind of song you sing to the sea when standing on a windy cliff. I also have to recommend the new version they brought out of this which includes a bunch of tracks from this period, including the fantastic Sun Giant EP. I love in particular 'Drops in the River', 'In the Hot Hot Rays', 'Icicle Tusk' and this cover of an old song 'Silver Dagger'. I genuinely listen to this stuff a lot still to this day",
      "topTracks": ["White Winter Hymnal", "Ragged Wood", "Tiger Mountain Peasant Song", "He Doesn't Know Why", "Meadowlarks", "Blue Ridge Mountains", "Oliver James", "Drops in the River", "Mykonos", "In the Hot Hot Rays", "Icicle Tusk", "Silver Dagger", "Isles"]
    },
    {
      "filename": "fleet-helpless.jpg",
      "artist": "Fleet Foxes",
      "name": "Helplessness Blues",
      "releaseyear": "2011",
      "description": "Stunning album which is probably one of the main reasons I was so into indie music during my university years. I could sing along to all these songs, and they're all such fun songs to sing along to. I just love how they sing on 'Montezuma', it's a great opener, and 'Helplessness Blues' is so stunning and raw. The wild saxophone part of 'An Argument' I didn't like at first but it was just my first exposure to noisy shit. Coming around to this track later on is what prepared me for KKB's 'Only Acting'. The closing track is also great although it always bothered me that it wasn't just little tiny bit faster in tempo",
      "topTracks": ["Montezuma", "Sim Sala Bim", "Helplessness Blues", "Lorelai", "Someone You'd Admire", "The Shrine / An Argument", "Grown Ocean"]
    },
    {
      "filename": "fleet-crack.jpg",
      "artist": "Fleet Foxes",
      "name": "Crack-Up",
      "releaseyear": "2017",
      "description": "This follow up album never reached the heights of the last two, but it has its own special thing going on, and I often come back to it. Especially some of the tracks are particular highlights, like 'Fool's Errand' and the resigned and beautiful 'I Should See Memphis'",
      "topTracks": ["Kept Woman", "If You Need To, Keep Time on Me", "Mearcstapa", "Fool's Errand", "I Should See Memphis"]
    },
    {
      "filename": "timber-timbre.jpg",
      "artist": "Timber Timbre",
      "name": "Timber Timbre",
      "releaseyear": "2009",
      "description": "Timber Timbre is such an insanely specific vibe it's hard to describe. It's like music for creeping down the hallway, or for when you're tied up in a basement. Ultimately, it's creepy. It's creepy music and the singer is creepy. But that doesn't make it bad music, it's actually kind of addicting. This album in particular has loads of great stuff and is super consistent. 'Demon Host' is the perfect first song to listen to. Just like 'We'll Find Out' it's got major chords and folky pleasant vibes, but creepy lyrics",
      "topTracks": ["Demon Host", "Lay Down In The Tall Grass", "Magic Arrow", "We'll Find Out", "I Get Low", "No Bold Villain"]
    },
    {
      "filename": "timber-creep.jpg",
      "artist": "Timber Timbre",
      "name": "Creep On, Creepin' On",
      "releaseyear": "2011",
      "description": "The intensity ramps up on this next album from Timber Timbre. This sounds even more like spy/horror film music and even creepier and more ominous than the last one. This one has actual scary noise interludes in it, firmly cementing the album as a creepy album. I mean, it's in the name. Things haven't even reached maximum creepy yet but the vibes are arguably strongest on this album. Something about the effects he puts on his voice, I dunno. Nothing like it",
      "topTracks": ["Bad Ritual", "Creep On Creepin' On", "Woman", "Lonesome Hunter"]
    },
    {
      "filename": "timber-hot.jpg",
      "artist": "Timber Timbre",
      "name": "Hot Dreams",
      "releaseyear": "2014",
      "description": "This is it, this is the album where it transforms into a more explicitly creepy thing. Like, you can't put on this music in the background when there are songs like 'Run from Me'. Even 'Hot Dreams', a song I genuinely love for its sickly sugary horror vibe, I can't really put on, because the first line is 'I wanna dance with a black woman'. This guy really plays the role of a seedy criminal shithead who visits prostitutes and hates his wife and that actively comes through in the lyrics. When I went to see him live I was worried he would actually be like that in real life, and although he certainly looks the part, he is just a good musician, and creepy shit and ghost stories are just his jam. I do feel like you have to be a fucked up kinda person to write 'Run from Me' though. I don't know what's going on really.",
      "topTracks": ["Hot Dreams", "Curtains!?", "Bring Me Simple Men", "Grand Canyon", "The Low Commotion"]
    },
    {
      "filename": "timber-lovage.jpg",
      "artist": "Timber Timbre",
      "name": "Lovage",
      "releaseyear": "2023",
      "description": "A newer, shorter album from this band that specialised in creepy music, and the very first line is 'Do you wanna see a dead body? Ask the community!'. The swampy, horror story vibe continues here, especially in the middle when the whole thing falls apart during the track 'Confessions of Dr. Woo'. A beautiful first half of the song collapses into noise and chaos as Dr. Woo presumably descends into madness. That is followed up by '800 Pristine Corpses' which is just a simple piano piece that is turned terrifying by its title and presumed actions of Dr. Woo",
      "topTracks": ["Ask The Community", "Confessions of Dr. Woo", "800 Pristine Corpses", "Sugar Land"]
    },
    {
      "filename": "tallest-shallow.jpg",
      "artist": "The Tallest Man on Earth",
      "name": "Shallow Grave",
      "releaseyear": "2008",
      "description": "The Tallest Man on Earth has been with me since I was a child. Each album of his that releases marks a different point in my life. According to Spotify he is my all-time most listened to artist! This first album reeks of springtime. You can almost hear the birds singing when he plays the guitar. He always celebrates nature, and this album does that the most of his albums. It's quite simple and pure. One song, 'Where Do My Bluebird Fly' he doesn't perform anymore because it's about suspicion towards an ex-girlfriend who he is now over. Nonetheless when he DID perform one of the many times I've seen him, it was so so so shocking and intense",
      "topTracks": ["I Won't Be Found", "Pistol Dreams", "Shallow Grave", "Where Do My Bluebird Fly", "Into the Stream", "This Wind"]
    },
    {
      "filename": "tallest-wild.jpg",
      "artist": "The Tallest Man on Earth",
      "name": "The Wild Hunt",
      "releaseyear": "2010",
      "description": "The first song of his that I ever heard was 'Thousand Ways' and it's funny to think how that was the one that drew me in. Over time it's the other tracks that I love the most though. I have distinct memories of enjoying 'Burden of Tomorrow' while playing Minecraft of all things as a teenager. All of these songs are stunning though. You can feel the wind in your hair and grass beneath your feet when you listen to this album",
      "topTracks": ["The Wild Hunt", "Burden of Tomorrow", "Troubles Will Be Gone", "King of Spain", "Love is All", "Thousand Ways", "Kids on the Run"]
    },
    {
      "filename": "tallest-leaving.webp",
      "artist": "The Tallest Man on Earth",
      "name": "There's No Leaving Now",
      "releaseyear": "2012",
      "description": "I love this particular album so much. I've seen him in concert so many times by now, but a more recent time he started off with 'Wind and Walls' from this album and I almost died, because that song in particular is so gorgeous. He really loves to play his own deep cuts in concert, so good. This album marked the first time that he included other instruments in the mix, and I love it. It's mostly still guitar and he is an amazing guitarist (shout-outs to the insane guitar playing on 'Criminals') but I love it when he expands the vibe like on 'Revelation Blues'",
      "topTracks": ["To Just Grow Away", "Revelation Blues", "Bright Lanterns", "Wind and Walls", "Little Brother", "Criminals", "On Every Page"]
    },
    {
      "filename": "tallest-dark.jpg",
      "artist": "The Tallest Man on Earth",
      "name": "Dark Bird Is Home",
      "releaseyear": "2015",
      "description": "This album accompanied me on my move to Germany and although it took me a while to love it, I truly love it. This album has many moments which sound especially emotional, and he sings it in such a real way. Like when he sings 'Slow dance in the kitchen' or 'in the fields of our home' he sounds relieved and overcome and melancholy. The final song in particular ends in an incredible climax right before the end of which he whispers 'oh fuck' into the microphone and lets the instrumental take over",
      "topTracks": ["Fields of Our Home", "Singers", "Slow Dance", "Sagres", "Beginners", "Dark Bird Is Home"]
    },
    {
      "filename": "kings-quiet.jpg",
      "artist": "Kings of Convenience",
      "name": "Quiet Is The New Loud",
      "releaseyear": "2001",
      "description": "Having fallen in love with this band with their other two albums, I then listened to this, their first album, and I also loved it. Much simpler, less conceptual, fewer instruments, but still so good. I was especially shout out the single version of 'Failure' which has extra strings added and is stunning. The last two songs also are very meditative and gorgeous",
      "topTracks": ["Singing Softly To Me", "I Don't Know What I Can Save You From", "Failure", "The Weight Of My Words", "Leaning Against The Wall", "Little Kids", "The Passenger", "Parallel Lines"]
    },
    {
      "filename": "kings-riot.jpg",
      "artist": "Kings of Convenience",
      "name": "Riot On An Empty Street",
      "releaseyear": "2004",
      "description": "I got to know this album during the days where I was into vlogging on the internet and met a bunch of people online who recommended me indie music. This band are so good at channeling that Simon and Garfunkel vibe and making the most beautiful sounding music out of it. Just look at 'Cayman Islands', or the gorgeous ending to 'Stay Out Of Trouble'. The beautiful songs with Feist as well, I love that she appears on so many of their tracks. 'The Build Up' especially, damn",
      "topTracks": ["Homesick", "Misread", "Cayman Islands", "Stay Out Of Trouble", "Know How", "Live Long", "The Build Up"]
    },
    {
      "filename": "kings-declaration.jpg",
      "artist": "Kings of Convenience",
      "name": "Declaration Of Dependence",
      "releaseyear": "2009",
      "description": "I think this is my favourite of their albums. They've changed their sound to be more peaceful and pensive than before, and this collection of songs is just so good. I love that they have a song with the same name as the title of their previous album, like they wanted to honour their past works. How often do you see stuff like that, most artists just look to the future instead. This music is for sinking into the bath, being in the garden, and also for wallowing in sadness, I admit. I love love love the final track as well",
      "topTracks": ["24-25", "Mrs. Cold", "Me In You", "Rule My World", "My Ship Isn't Pretty", "Renegade", "Freedom And Its Owner", "Riot On An Empty Street", "Second To Numb", "Scars On Land"]
    },
    {
      "filename": "aldous-party.jpg",
      "artist": "Aldous Harding",
      "name": "Party",
      "releaseyear": "2017",
      "description": "An earlier, rawer album, with some of her harshest music. It sounds like she sings the tracks while her whole body is completely tense. The video for 'Blend' is haunting, as is the video for 'Horizon', both very devastating songs. And the final track features Perfume Genius and is of course beautiful",
      "topTracks": ["Blend", "Imagining My Man", "Party", "Horizon", "Swell Does the Skull"]
    },
    {
      "filename": "aldous-designer.jpg",
      "artist": "Aldous Harding",
      "name": "Designer",
      "releaseyear": "2019",
      "description": "Wow, wow, wow, this album is definitely my favourite from Aldous Harding. The songs are all nonsensical but I'm addicted to them, I can't help it. The first song I ever heard from her was 'Fixture Picture' which is so pleasant and lovely, and then I saw the amazing music video for 'The Barrel' which is something I think about a lot. Her dancing is like a centuries old witch who is having a good day. Then there is the 'Weight of the Planets' which I love, and so many other great moments like shaking chains around like a tambourine in 'Damn', or when talking about heaven 'I don't want entry, that place is empty'",
      "topTracks": ["Fixture Picture", "Zoo Eyes", "Treasure", "The Barrel", "Damn", "Weight of the Planets", "Heaven is Empty"]
    },
    {
      "filename": "aldous-warm.webp",
      "artist": "Aldous Harding",
      "name": "Warm Chris",
      "releaseyear": "2022",
      "description": "I can't for the life of me imagine why this is called Warm Chris. I don't claim to come even close to figuring out what's going on in Aldous's mind but what matters is that this album has great moments. It's peaceful and weird. If I were to equate this album with a Nintendo franchise it would be pikmin. I especially enjoy the very final track which features the guy from Sleaford Mods, which I read was an awkward collaboration. But whatever I love it when she reharmonises the song at the end with the guitar, it sounds so melancholic",
      "topTracks": ["Ennui", "Fever", "Leathery Whip"]
    },
    {
      "filename": "michael-home.jpg",
      "artist": "Michael Kiwanuka",
      "name": "Home Again",
      "releaseyear": "2012",
      "description": "My first exposure to Michael Kiwanuka was 'Home Again' which I decided was beautiful and stunning. Little did I know that the rest of his discography is even more beautiful and stunning that this. I don't often listen to this first album because I find it doesn't tackle the real issues like the newer stuff, but I have a special love for it because it was my entryway into his world. This particular album wasn't produced by the legend Inflo (all his others were) but it still has this classic vintage, 70s singer songwriter feel that I love. And it's sad songs, I love sad songs. This album is gorgeous, don't be afraid to put it on when having sunday brunch. It's sad but in a melancholic way, also uplifting. I also want to point out an amazing one-off single he did after this album called 'You've Got Nothing To Lose', please go watch the music video for it.",
      "topTracks": ["Tell Me A Tale", "I'm Getting Ready", "Rest", "Home Again", "I Won't Lie", "Worry Walks Beside Me"]
    },
    {
      "filename": "michael-love.jpg",
      "artist": "Michael Kiwanuka",
      "name": "Love & Hate",
      "releaseyear": "2016",
      "description": "This album... this is where Michael evolves into his final form already and it's just album 2. He starts working with legendary producer Inflo (the person behind Little Simz's latest albums and also the elusive band SAULT) and you can TELL. Inflo makes this insanely delicious vintage vibe that works so well with Michael's songs. And wow his songs are so good! I love that he kicks of the album with a 10 minute masterpiece... 'Cold Little Heart' takes use through an odyssey of different thoughts and feelings and it never gets boring. It's music to stop and think about your life to. Then there is the absolutely stunning 'Falling' with its wailing, hanging piano notes, and the hypnotic 'Love & Hate' which I was obsessed with for a long time. Things really escalate on 'Rule The World' and 'Father's Child'. These are songs to cry to for sure. And then I just adore the final song. It's so simple and straightforward compared to the comparatively complex music before it and it feels like relief, like resting after lengthy emotional turmoil. I also really relate to the lyrics about not being able to love. I feel like Michael understands me when I say I feel like a heartless bastard. God I love this album so much",
      "topTracks": ["Cold Little Heart", "Falling", "Love & Hate", "I'll Never Love", "Rule The World", "Father's Child", "The Final Frame"]
    },
    {
      "filename": "michael-kiwanuka.jpg",
      "artist": "Michael Kiwanuka",
      "name": "KIWANUKA",
      "releaseyear": "2019",
      "description": "This is that lengthy and meaty Michael Kiwanuka album I always wanted. Love & Hate is stunning and arguably the best one but it's only got 10 songs, here though we hear Michael just go nuts doing his own special brand of sad songs. That being said we start off with a happy song! 'You Ain't The Problem' is so good. It's a party. It's an instant-fall-in-love-with-the-album situation when you hear it. But no worries we're getting our classic melancholic, colourful, gorgeous tracks as well. 'Piano Joint' is the blueprint for the next album I think, and I love it. It's also got an intro before it and an interlude after it, which is something common in this album and honestly I'm all for it. It makes the album feel like one long continuous experience. Then I have to give special props to the last five tracks of the album. They are devastating. With 'Final Days' you understand what kind of place he's in. The absolute stunner though is the final track 'Light' which masquerades as a happy, hopeful and uplifting song, then transforms towards the end into the heartbreak that we know so well from Michael",
      "topTracks": ["You Ain't The Problem", "I've Been Dazed", "Piano Joint (This Time Of Love)", "Living In Denial", "Hard To Say Goodbye", "Final Days", "Solid Ground", "Light"]
    },
    {
      "filename": "michael-small.jpg",
      "artist": "Michael Kiwanuka",
      "name": "Small Changes",
      "releaseyear": "2024",
      "description": "Finally we are treated to another album and I love it so much. I put every track in the top tracks list, it's one of those albums. This time it consists entirely of slow, sad songs and I am not complaining. Even if the songs are in the major key, you know that deep down, he is suffering. I've been hypnotised by the song 'Small Changes' the most. It sounds like he is singing that song with tears in his eyes. Then there is the dark and harmonic 'Rebel Soul' which has such a lush outro. He is really coming out with amazing chord sequences (my weakness) for these tracks and I am addicted. This is never more so the case than on 'Lowdown (part ii)' where the relatively first part collapses into a sublime string-based sequence of soulful chords. It sounds like the music that plays in a film when the character realises something life-changing or learns something devastating. In the context of the lyrics of the first part I imagine it as the music that plays when you hit rock bottom. Then, towards the end the tempo slows down and it's like the moment you drag yourself off the floor in those moments because you have to continue with your life. Then he just goes and calls the next song 'Follow Your Dreams'! I mean, come on. There's also the most incredible guitar sound in 'Stay By My Side' which at first was off-putting but now I'm spellbound by it. It gives the song this gravity, as if he's talking about the real serious shit this time. The final track is super similar to 'The Final Frame' and I love it for that. God I love this album so much. I'm such a fan",
      "topTracks": ["Floating Parade", "Small Changes", "One And Only", "Rebel Soul", "Lowdown (part i)", "Lowdown (part ii)", "Follow Your Dreams", "Live For Your Love", "Stay By My Side", "The Rest Of Me", "Four Long Years"]
    },
    {
      "filename": "magdalena-mini-1.jpg",
      "artist": "Magdalena Bay",
      "name": "mini mix vol. 1",
      "releaseyear": "2019",
      "description": "This little EP is so great. I love putting on the video to impress my friends. No band capture dawn-of-the-internet retro vibes like Mag Bay. These music videos capture that low-budget feel so perfectly and although it kinda feels like they're taking the piss, it still sounds so good. I'm obsessed with her half-hearted dancing. It kinda feels like they made this whole thing in a week. Yet here I am listening to it again. 'U Wanna Dance?' might be the thing which inspired me most aesthetics-wise when making this website",
      "topTracks": ["Afternoon in Heaven", "Turning off the Rain", "U Wanna Dance?", "Nothing Baby"]
    },
    {
      "filename": "magdalena-rhythm.jpg",
      "artist": "Magdalena Bay",
      "name": "A Little Rhythm and a Wicked Feeling",
      "releaseyear": "2020",
      "description": "My first exposure to Mag Bay was 'How to Get Physical' whose video is just so fun. It's pop perfection! This little EP is a great introduction to them, although its less cheeky than the mini mixes",
      "topTracks": ["How to Get Physical", "Story", "Venice"]
    },
    {
      "filename": "magdalena-mini-2.jpg",
      "artist": "Magdalena Bay",
      "name": "mini mix vol. 2",
      "releaseyear": "2020",
      "description": "After having a real release, they went back to make a quick low-budget EP with a bunch of green screen videos. I love that about this band, they don't forget their roots, their roots being tacky music videos. These music videos are so good, and the songs are great too. Personal favourite is 'Sky2Fall' which they made in a day, and features a glamourous transformation into a pop princess in the video",
      "topTracks": ["Live 4ever", "Sky2Fall", "Hideaway"]
    },
    {
      "filename": "magdalena-mercurial.webp",
      "artist": "Magdalena Bay",
      "name": "Mercurial World",
      "releaseyear": "2021",
      "description": "After 3 EPs they finally got the budget for an actual album. This album has some banger tracks on it, even if they are taking themselves way more seriously this time around. I remember being obsessed with 'Secrets' when it came out. This also has some extra tracks in the deluxe version which I really enjoyed. This kind of synthpop is just hitting for me these days",
      "topTracks": ["Mercurial World", "Unconditional", "Dawning of the Season", "Secrets (Your Fire)", "Chaeri", "Hysterical Us", "All You Do"]
    },
    {
      "filename": "magdalena-mini-3.jpg",
      "artist": "Magdalena Bay",
      "name": "mini mix vol. 3",
      "releaseyear": "2023",
      "description": "Having enjoyed some real success, Mag Bay go back to making tacky music videos, except now they're actually good at it now, so they still end up looking professional. Will we ever get back the magic of mini mix 1? Hard to say, but this is still super enjoyable and worth your time",
      "topTracks": ["2 Wheel Drive", "Top Dog"]
    },
    {
      "filename": "magdalena-imaginal.jpg",
      "artist": "Magdalena Bay",
      "name": "Imaginal Disk",
      "releaseyear": "2024",
      "description": "This is the Mag Bay Mag Opus! A whole ass album that is super consistent and has NO SKIPS! It feels wrong to not listen to this front to back, because all the tracks fit in with each other so well. It has an abstract concept running through it as well of a girl who decides to get a special disk inserted into her brain, featuring multiple characters. It's very conceptual and each time you listen to the album you understand a bit more of it. The album has a bunch of amazing moments, especially when it gets LOUD! And the team really exhibit some amazing chord progressions (my weakness) and different vibes. The interlude near the start sounds like Wii Sports, 'Cry For Me' sounds like Dancing Queen and 'Angel on a Satellite' sounds like Debussy. This album was the one I listened to most in 2024!",
      "topTracks": ["Killing Time", "True Blue Interlude", "Image", "Death & Romance", "Fear, Sex", "Watching T.V.", "Cry For Me", "Angel on a Satellite"]
    },
    {
      "filename": "khruangbin-todo.jpeg",
      "artist": "Khruangbin",
      "name": "Con Todo El Mundo",
      "releaseyear": "2018",
      "description": "Wow, is there any band that makes such a perfect smoking weed vibe like Khruangbin? Incredible stuff. It's literally just guitar, bass and drums and that is enough to make the cosiest music ever. Some might say it's boring and slow but I say you don't have to sing along to everything! It may be background music but it's fucking great background music. And part of their magic is also their vibe on stage, I mean just look at their Tiny Desk concert. They are simply the coolest people, especially the bassist. I want to point out the song 'Even Finds the Third Room' because it is so fun when she just says 'Yes!' all the time. It's the kind of affirmation I need sometimes. Should I wear this today? Yes! I also want to mention the track 'Friday Morning' which is so beautiful and has this amazing music video where they filmed each other reading letters written to them by loved ones telling them how much they are loved. It's enough to make me cry",
      "topTracks": ["Lady and Man", "Maria También", "August 10", "Even Finds the Third Room", "Friday Morning"]
    },
    {
      "filename": "khruangbin-mordechai.jpg",
      "artist": "Khruangbin",
      "name": "Mordechai",
      "releaseyear": "2020",
      "description": "Another fantastic album from this incredibly chill and vibes-based band. This one, like 'Con Todo El Mundo' is perfect background music for smoking weed and relaxing at home. It also has a couple of fun songs like 'Time' and 'Pelota', both with great videos, although their single 'So We Won't Forget' is by far their most beautiful track. The video for that is also devastating. Make sure you enjoy this album with the drug of your choice and consider running a bath for it",
      "topTracks": ["First Class", "Time (You and I)", "Pelota", "Dearest Alfred", "So We Won't Forget"]
    },
    {
      "filename": "khruangbin-sala.jpg",
      "artist": "Khruangbin",
      "name": "A LA SALA",
      "releaseyear": "2024",
      "description": "This follow-up album continues the classic Khruangbin mega-vibe because these people cannot be stopped. I really fell in love with some of these tracks, especially 'May Ninth', a song about expecting a child. It's so warm. I also really enjoy 'Pon Pón', even if I no idea what it's about. It's just a lot of fun! I admit that this album isn't quite up there with the previous two but it's still a fantastic vibe and worth your time. Just make sure you're smoking weed while you're listening",
      "topTracks": ["May Ninth", "Pon Pón", "Todavía Viva", "Hold Me Up (Thank You)", "A Love International"]
    },
    {
      "filename": "sade-diamond.jpg",
      "artist": "Sade",
      "name": "Diamond Life",
      "releaseyear": "1984",
      "description": "Sade, an absolute queen backed by a flawless band, arrives on the scene to serve class, style and sensuality. The world didn't know what hit them when she release 'Smooth Operator' back then. This music is SO classy, it's music for smoking, making deals, and most of all, making babies. It's silky, it's smooth, it makes you want to stretch and relax, and lock eyes with the high-flying 5-o'clock shadow businessman at the other end of the bar. Just LOOK at her on the album cover, I mean come on. She is singing about the diamond life, but also the tough life. My favourite on this album is the final track, which is a cover of Timmy Thomas's civil rights song. Interesting factoid about the original, its hypnotic drum loop was used for Drake's 'Hotline Bling' (his only good song). I love how Sade's version also has a long, slow intro just like the original",
      "topTracks": ["Smooth Operator", "Your Love Is King", "Frankie's First Affair", "Sally", "Why Can't We Live Together"]
    },
    {
      "filename": "sade-promise.jpg",
      "artist": "Sade",
      "name": "Promise",
      "releaseyear": "1985",
      "description": "Sade stuns with this follow-up album, arguably even MORE classy and more sophisticated than the first. I always come back to the image of her at the window in the rain for the 'Sweetest Taboo' video. Such a vibe. And in terms of audio, just the first minute of the album with the James Bond big band blow-out, then the single tap of the conga into the smoothest verse you could ever imagine. It's just something else! I also love the final track 'Maureen' about her car",
      "topTracks": ["Is It a Crime", "The Sweetest Taboo", "War of the Hearts", "Mr Wrong", "Never as Good as the First Time", "Maureen"]
    },
    {
      "filename": "sade-stronger.jpg",
      "artist": "Sade",
      "name": "Stronger Than Pride",
      "releaseyear": "1988",
      "description": "Ugh yet another stunning Sade album, how lucky we are to be able to listen to it on demand. The band evolves even further and become even silkier, even classier and even more beautiful than ever before. With the timeless 'Paradise', another favourite track 'Nothing Can Come Between Us', which I'm pretty sure features 3 different kinds of bass guitar. One track in particular has had a major effect on me in 2024, 'I Never Thought I'd See the Day'. It's a very quiet track with just two bass notes keeping the rhythm while Sade sings about the day it all goes wrong, and it's perfect for when you want to wallow in your sadness, or you are contemplating life-changing things. This song has been there for me when I need it. And then it's followed up by this beautiful instrumental track at the end. It's just perfect",
      "topTracks": ["Paradise", "Nothing Can Come Between Us", "Turn My Back On You", "Keep Looking", "Clean Heart", "I Never Thought I'd See the Day", "Siempre Hay Esperanza"]
    },
    {
      "filename": "sade-love.jpg",
      "artist": "Sade",
      "name": "Love Deluxe",
      "releaseyear": "1992",
      "description": "To think that we get the honour of living in a world where Sade graces us with their magnus opus, their ultimate album, the unbeatable Love Deluxe. This album REEKS of sensuality, desire and classy confidence. I went and put every track in the top tracks because it's just one of those albums. It starts off with the best one, 'No Ordinary Love', the sexiest song ever, and one I regularly put on during sex. The main theme of Streets of Rage, a house-influence soundtrack, reminds me of this song which makes me love it more. Then there's just always this amazing beat and vibe, more so than the previous albums, it's almost hypnotic. Hard to put into words. 'Like a Tattoo' has this devastating story, and when she sings 'I still feel the chill as I reveal my shame to you' I always have to stop what I'm doing and take a moment. And it ends with another beautiful instruments. God it's just a perfect album",
      "topTracks": ["No Ordinary Love", "Feel No Pain", "Couldn't Love You More", "Like a Tattoo", "Kiss of Life", "Cherish The Day", "Pearls", "Bullet Proof Soul", "Mermaid"]
    },
    {
      "filename": "esperanza-emily.jpg",
      "artist": "Esperanza Spalding",
      "name": "Emily's D+Evolution",
      "releaseyear": "2016",
      "description": "I can't pretend to understand what this album is about or what its bewildering title is about. But I really like a lot of the songs! And I love her as a musician so much. It's not just this album that I regularly listen to but I would say this is the one that I connected with most. It started when I fell in love with the track 'Noble Nobles', then expanding into the wild 'Good Lava' which is literally about vagina juices and 'Rest In Pleasure' which has this amazing moment when she sings: 'I may not be in love with you, it's the idea of love I'm really into'",
      "topTracks": ["Good Lava", "Unconditional Love", "Rest In Pleasure", "Noble Nobles"]
    },
    {
      "filename": "confidence-tilt.png",
      "artist": "Confidence Man",
      "name": "Tilt",
      "releaseyear": "2022",
      "description": "Confidence Man have perfected the art of blending classic house and cheeky pop music. They clearly have impeccable senses of humour which was on display when I heard 'Holiday' for the first time. A super serious opening, atmospheric, epic, then her vocals come in and it ALMOST feels like she's taking the piss. They have amazing music videos, my favourite of which is 'Luvin U Is Easy' which is just them having so much fun, and the song is such amazing classic house. Also, the song 'Break It Bought It' is definitely my drag song, and I will DJ it at my birthday party",
      "topTracks": ["Woman", "Toy Boy", "Luvin U Is Easy", "Holiday", "Break It Bought It"]
    },
    {
      "filename": "confidence-3am.jpg",
      "artist": "Confidence Man",
      "name": "3AM (LA LA LA)",
      "releaseyear": "2024",
      "description": "We went to see them in Berghain when they released this album and it was so good. They have dance moves for every song and are just so cheeky and outrageous. Having loved the previous album, I was so pumped when this came out and it totally delivered! My favourite track is the first one because it channels Kylie Minogue so good, but I also love the dirty synth chords in 'Sicko' even if I do find the dude a little much. She, meanwhile, is the most gorgeous woman I've ever seen, and that is mostly seen in the Sicko video. They also bring back that classic house party experience on 'Real Move Touch' which I adore",
      "topTracks": ["Who Knows What You'll Find?", "Breakbeat", "Sicko", "Real Move Tough"]
    },
    {
      "filename": "melody-absence.jpg",
      "artist": "Melody Gardot",
      "name": "The Absence",
      "releaseyear": "2012",
      "description": "Another Fraser and his mum bonding artist. Melody Gardot is like a caricature of hotel lounge singers but fuck it I genuinely enjoy her music. This isn't her famous album but it's the one I like the most because she put in a ton of Portuguese and Brazilian influences into it. Some of the slower tracks are so fucking melodramatic, I love it. There are some nice upbeat tracks too but nobody does romantic crooning heartbreak songs like her. 'So We Meet Again My Heartache' is so extra. And I love the most the song 'Se Voce Me Ama', it makes me want to dim the lights, smoke a cigarette, display my body and confront my troubled lover about my heartbreak",
      "topTracks": ["Mira", "So Long", "So We Meet Again My Heartache", "Lisboa", "Impossible Love", "Se Voce Me Ama"]
    },
    {
      "filename": "vincent-daddy.jpg",
      "artist": "St. Vincent",
      "name": "Daddy's Home",
      "releaseyear": "2021",
      "description": "I have loved St Vincent for a long time but this is the album which truly cemented it for me. She changes things up by going full 70s! The vibe is super special and I find myself in the mood for this all the time. No matter where I am emotionally I can put this on and feel better. I like the peaceful songs the most but special shoutout to 'My Baby Wants A Baby' because it actually talks about not wanting to have kids, something you never hear songs about",
      "topTracks": ["Down And Out Downtown", "The Melting Of The Sun", "Somebody Like Me", "My Baby Wants A Baby", "Candy Darling"]
    },
    {
      "filename": "miami-illumination.jpg",
      "artist": "Miami Horror",
      "name": "Illumination",
      "releaseyear": "2010",
      "description": "I was so into this album when I was living in Switzerland in 2013, mainly because I was going through my Kimbra phase and she features on their hit song 'I look to you', which is a timeless banger. The rest of the album has such a great summer party vibe, but also with an element of fantasy. I especially love the closing track, and looking it up now, I realise it features Alan Palomo from the band Neon Indian, which adds up. I did have a listen to their new album but it really doesn't hit the same. They peaked with their first album",
      "topTracks": ["I Look to You", "Summersun", "Moon Theory", "Imagination", "Grand Illusion", "Ultraviolet"]
    },
    {
      "filename": "leisure-sleeper.jpg",
      "artist": "The Leisure Society",
      "name": "The Sleeper",
      "releaseyear": "2009",
      "description": "For a long time this was my favourite band! When I was 15 or so I had their albums on repeat. If any band puts in a remotely interesting chord progression, I'm in, which is why I was obsessed with 'Come To Your Senses' and 'We Were Wasted'. But I also loved how the melody hung so lightly in 'Last of the Melting Snow', then eventually swings in. It's just so nice. I fondly enjoy the nostalgia I feel with this album",
      "topTracks": ["A Fighting Chance", "The Last Of The Melting Snow", "A Short Weekend Begins With Longing", "We Were Wasted", "Are We Happy?", "Come To Your Senses", "Love's Enormous Wings"]
    },
    {
      "filename": "leisure-murky.jpg",
      "artist": "The Leisure Society",
      "name": "Into The Murky Water",
      "releaseyear": "2011",
      "description": "I got this album on CD around the time I had my first fish, Vaughan Williams. When the summer came around and I was too lazy to change the water more often and algea murked up the water, I enjoyed playing this album since it's also murky water related. It's a cute album! Lots of fun songs, the kind of music I really associate with English festivals. They also did an EP 'Out of the Murky Water' which I also adore",
      "topTracks": ["Into The Murky Water", "Out Hearts Burn Like Damp Matches", "Better Written Off (Than Written Down)", "Just Like The Knife", "Flying", "Weir Road", "A Richer Dust"]
    },
    {
      "filename": "weyes-titanic.webp",
      "artist": "Weyes Blood",
      "name": "Titanic Rising",
      "releaseyear": "2019",
      "description": "Weyes Blood is amazing. Her songs are so peaceful and delightful and this album slaps. On first listen you might think this album is background music, but there is so much creative and fun stuff going on here. I love the switch up in the middle of 'Movies', a super visionary song, as well as the bit where she sings 'I just lay down and cry!' in 'Something to Believe'. But I think my favourites are just the last couple of tracks. Please do yourself a favour and watch her Tiny Desk concert where she plays those tracks. They are stunning, mesmerising. And I love her",
      "topTracks": ["A Lot's Gonna Change", "Andromeda", "Something to Believe", "Movies", "Wild Time", "Picture Me Better"]
    },
    {
      "filename": "weyes-darkness.jpg",
      "artist": "Weyes Blood",
      "name": "And In The Darkness, Hearts Aglow",
      "releaseyear": "2022",
      "description": "The song 'God Turn Me Into a Flower' is so perfect and beautiful. You should stop reading this and immediately go and watch the video on youtube. The video is very overwhelming and makes me tear up every time, so much so that I have to limit my viewing of the video so as for it not to become any less emotional impactful. That's the stunning highlight of the album but the other songs are also great. This album is undoubtedly a bit doomer, which I heavily vibe with. With the first track, as well as 'The Worst Is Done' which is explicitly about the covid pandemic show me that she and I share a lot of feelings about the direction the world is heading",
      "topTracks": ["It's Not Just Me, It's Everybody", "Grapevine", "God Turn Me Into a Flower", "Twin Flame", "The Worst Is Done"]
    },
    {
      "filename": "bonobo-black.jpg",
      "artist": "Bonobo",
      "name": "Black Sands",
      "releaseyear": "2010",
      "description": "The seminal Bonobo album that everyone should become familiar with. It's imposing and remarkable violin-based intro will grab your attention and then you will be plunged into a deep dance groove on 'Kiara'. Holy shit it's such an amazing start. Then it's just banger after banger. 'Kong' is insanely good I mean what a track. Then Andreya Triana comes on and Bonobo just has amazing taste in vocalists because I love her. 'Eyesdown' is such a strong vibe. Then it gets wild with the next couple of tracks. In the fact the whole album is wild. Completely full of fascinating and interesting songs. Just stop what you're doing and listen to it, it's his best album by far and there is so much to enjoy. Special shout-outs to the final track. Stunning",
      "topTracks": ["Kiara", "Kong", "Eyesdown", "El Toro", "We Could Forever", "Animals", "Black Sands"]
    },
    {
      "filename": "bonobo-days.jpg",
      "artist": "Bonobo",
      "name": "Days to Come",
      "releaseyear": "2006",
      "description": "Bonobo is great and I remember first discovering them when I was young. I would describe it as the moment I stopped exclusively listening to indie/singer-songerwriter music. I remember thinking wow this electronic-style music (it's not even that electronic...) is so amazing I want more. Bonobo is really good at picking all the right instruments, especially when it comes to percussion and you can really hear that here. I also love the amount of strong saxophone we are treated to. The highlights for me though are the songs featuring the vocalist Bajka, she is just amazing. The song 'Nightlite' in particular is my jam, especially that juicy bit at the end when the strings come in. Hell yes",
      "topTracks": ["Days To Come", "Between The Lines", "Ketto", "Nightlite", "On Your Marks", "Walk In The Sky", "Recurring"]
    },
    {
      "filename": "everything-man.jpg",
      "artist": "Everything Everything",
      "name": "Man Alive",
      "releaseyear": "2010",
      "description": "I associate this band with a certain kind of annoying british lad so I hesitate to recommend their albums on my website, but fuck it, I like the music and that's all that matters. This band is NERDY! They're straight up writing songs with references to video games in them, and yes it's a bit cringe sometimes but it sounds good! It's like math rock. It's got lots of fun harmonies and lots to discover on multiple listens",
      "topTracks": ["MY KZ, UR BF", "Leave The Engine Room", "Final Form", "Photoshop Handsome", "Two For Nero", "NASA Is On Your Side"]
    },
    {
      "filename": "beyonce-renaissance.png",
      "artist": "Beyoncé",
      "name": "RENAISSANCE",
      "releaseyear": "2022",
      "description": "I'm contractually obliged to put this album on here so I can get my Gay Man Certificate but I would have done it anyway because these songs slap. And you know, it's Beyoncé. For this album she embraces a new genre for her, house! House music is integral to the queer community, especially when its roots stem from the ballroom scene. She really leans into the Vogue/walking the catwalk angle of the genre and what can I say, she smashes it. The first half of the album in particular is great, although my favourite is definitely the final track where she interpolates 'I Feel Love' by Donna Summer. This track actually kick-started my deep dive into Donna Summer's discography so I want to officially thank Beyoncé for that",
      "topTracks": ["COZY", "ALIEN SUPERSTAR", "CUFF IT", "ENERGY", "BREAK MY SOUL", "VIRGO'S GROOVE", "HEATED", "PURE/HONEY", "SUMMER RENAISSANCE"]
    },
    {
      "filename": "villagers-awayland.jpg",
      "artist": "Villagers",
      "name": "{Awayland}",
      "releaseyear": "2013",
      "description": "Villagers is good! Some cerebral indie music who I saw live once. I've listened to this a lot, mainly because I specifically liked the song 'Passing A Message'. From the other albums I really like 'Set The Tigers Free' and 'Restless Endeavour'",
      "topTracks": ["The Waves", "Judgement Call", "Passing A Message", "Rhythm Composer"]
    },
    {
      "filename": "bajka-wonderland.jpg",
      "artist": "Bajka",
      "name": "Bajka in Wonderland",
      "releaseyear": "2010",
      "description": "I learned about this album because she featured on some great Bonobo tracks. Turns out her only solo output is this insane jazz album which reinterprets the nonsense poem 'The Hunting of the Snark'. She takes parts of the poem and puts it to some strings-heavy jazz pop, often with a nice brazilian feel. And what can I say she smashes it! This also has an excellent remix album",
      "topTracks": ["The Bellman's Speech", "The Barrister's Dream", "Interlude", "The Beaver's Lesson", "The Baker's Tale", "The Vanishing"]
    },
    {
      "filename": "madeleine-careless.jpg",
      "artist": "Madeleine Peyroux",
      "name": "Careless Love",
      "releaseyear": "2004",
      "description": "Definitely the quintessential bonding with my Mum album, she was the one who put me onto it when I was a teenager. At the time I was listening to a lot of vocal jazz from the likes of Norah Jones so was able to slip into this album easily. I love most the warm synths in the second verse of 'Youre' gonna make me lonesome', it just feels me with warmth. Otherwise the album is great for gazing out of the window, smoking, feeling pensive, or wondering if you should text him. Special shoutouts to her other album 'Bare Bones' which I also really like",
      "topTracks": ["You're Gonna Make Me Lonesome When You Go", "Between The Bars", "No More", "I'll Look Around", "This Is Heaven To Me"]
    },
    {
      "filename": "stornoway-beachcomber.jpg",
      "artist": "Stornoway",
      "name": "Beachcomber's Windowsill",
      "releaseyear": "2010",
      "description": "Deeply personal album! This is a local band from where I'm from and whenever I listen to this I'm transported back to sixth form. One of the songs 'Fuel Up' is about being in a car at various stages in your life. It felt very salient because at that time I had just learned to drive myself. Little did I know I would grow up to become a car hater! The song still makes me emotional though. Then there's 'We Are the Battery Human' which is so good! It's about staring at screens too much, a topic very dear to my heart. I will always fondly remember seeing them live in Oxford with my childhood friend Oscar. It felt like a big moment before we both left for university",
      "topTracks": ["Zorbing", "Fuel Up", "Boats and Trains", "We Are the Battery Human", "Here Comes the Blackout...!", "Watching Birds", "The End of the Movie", "Long Distance Lullaby"]
    },
    {
      "filename": "bon-emma.jpg",
      "artist": "Bon Iver",
      "name": "For Emma, Forever Ago",
      "releaseyear": "2007",
      "description": "This is THE winter album. Very peaceful and cerebral indie music for bearded dudes who wear beanies. I feel like some of these tracks like 'Flume' and 'Skinny Love' are classics at this point. The absolute stand-out though is the final song, which feels more like an encore or a bonus track 'Re: Stacks' with its beautiful guitar playing. So peaceful and delightful",
      "topTracks": ["Flume", "Lump Sum", "Skinny Love", "For Emma", "Re: Stacks"]
    },
    {
      "filename": "django-django.jpg",
      "artist": "Django Django",
      "name": "Django Django",
      "releaseyear": "2012",
      "description": "This is a fun pop rock album that might have been my first exposure to psychedelic-style music. After this I got into bands like Tame Impala for example. This might be a weird thing to say, but the lads in the band seem super unconfident, like just some local white boys from scotland. They are very cute though and I thought they smashed it when I went to their concert. This is their first breakout album and it has a bunch of bops. My favourite is the final track 'Silver Rays'",
      "topTracks": ["Hail Bop", "Waveforms", "Hand of Man", "Silver Rays"]
    },
    {
      "filename": "broken-bells.jpg",
      "artist": "Broken Bells",
      "name": "Broken Bells",
      "releaseyear": "2010",
      "description": "This is a super good indie rock band who released this super good album all this time ago. At first I just liked 'The High Road' because it's got this super fun synth, but with time I came to learn the vibe of 'Vaporize' is so good, like a Röyksopp song or something, and the last two tracks in particular are super cool, with a really nice transition between them. These songs have been with me for a long time and I just think album is class",
      "topTracks": ["The High Road", "Vaporize", "Citizen", "Mongrel Heart", "The Mall & Misery"]
    },
    {
      "filename": "lingua-sinner.jpg",
      "artist": "Lingua Ignota",
      "name": "SINNER GET READY",
      "releaseyear": "2021",
      "description": "This album is reserved for very special moments. I listen to it exclusively when I am feeling deeply upset, or devastated by something. Sometimes when I doom about the world too hard I put this on. When I feel like shit and I want to feel worse, then I put this on. Why? It's definitely the wildest album on this webpage. Give the first track a listen and you'll see why. If you make it to the second track, you'll already have stopped what you're doing to give it your full attention. It just escalates from there. The album itself is all about Christian faith, and exposes many ridiculous issues through that lens. Kristen Hayter plays multiple characters who use religion to shield their vices and excuse their bare-faced threats and prejudices. There are also moments of peace on the track, but even they expose the deep sadness and loneliness behind these characters and asks the question of whether this is what makes bad people do bad things. I highly recommend this album but only if you're ready to FEEL something. It's definitely not for everyone. If you realise it is for you, I also highly recommend her album 'CALIGULA'",
      "topTracks": ["I WHO BEND THE TALL GRASSES", "MANY HANDS", "PENNSYLVANIA FURNACE", "REPENT NOW CONFESS NOW", "THE SACRED LINAMENT OF JUDGMENT", "PERPETUAL FLAME OF CENTRALIA", "THE SOLITARY BRETHREN OF EPHRATA"]
    },
    {
      "filename": "black-hell.jpg",
      "artist": "Black Midi",
      "name": "Welcome to Hell",
      "releaseyear": "2022",
      "description": "I'm not normally into rock music but this particular flavour of jazz rock really gripped me. The song 'Sugar/Tzu' alone was enough to get me interested in the band. I love the bombastic, explosive vibe all over the album, and I especially love the quiet break in the middle",
      "topTracks": ["Hellfire", "Sugar/Tzu", "Welcome to Hell", "Still", "The Race Is About To Begin", "The Defence"]
    },
    {
      "filename": "viagra-cave.jpg",
      "artist": "Viagra Boys",
      "name": "Cave World",
      "releaseyear": "2022",
      "description": "First of all, great name for a band. Love it. Normally I don't vibe with rock music but this album is so fun, I couldn't not include it on the website. Lyrically it makes fun of keyboard warriors on the internet which is always something I can get on board with. If you're with a crowd of rock fans you can put this on and it might get their attention. The songs are equal parts funny and catchy and every now and then they just do something new, like the random house music break at the end of 'Big Boy'",
      "topTracks": ["Troglodyte", "Punk Rock Loser", "Ain't No Thief", "Big Boy", "ADD", "Return To Monke"]
    },
    {
      "filename": "ane-seasons.jpg",
      "artist": "Ane Brun",
      "name": "Changing of the Seasons",
      "releaseyear": "2008",
      "description": "During my Swedish indie music phase I found this album by Norwegian singer Ane Brun. At first glance it's plain singer songwriter acoustic stuff, but if you get into it you find some of the most gorgeous songs. I use this album to relax and reflect. This album is for pensively staring out the window. I especially love 'Armour' because it's about the feeling of powerlessness in a relationship when the other person doesn't want to help themselves. Also 'Gillian' because it's so heartwarming. It's about feeling better after hearing Gillian Welch sing. The songs are kind of melancholic but actually there is a ton of positivity here too and I love that. It's like sad songs about happy things",
      "topTracks": ["The Fall", "Changing of the Seasons", "Armour", "Round Table Conference", "Gillian", "Linger with Pleasure"]
    },
    {
      "filename": "frank-orange.jpg",
      "artist": "Frank Ocean",
      "name": "Channel ORANGE",
      "releaseyear": "2012",
      "description": "Frank Ocean is so chill. When this first came out he was also super mysterious and it was kinda captivating. Especially when I heard 'Bad Religion', a beautiful song about loving someone who can never love you back. A friend told me he's talking about the first person he ever loved, a man. At this time this totally blew my mind and I entered into an obsession. I love this album. I love how it flickers between all these different places like TV stations then eventually kinda falls apart. Those individual moments are all great, like even the little short interlude at the start 'Fertilizer'. That's actually a full song by this guy called James Fauntleroy who is one of those behind the scenes guys who works with tons of famous people. Then the two songs 'Sweet Life' and 'Super Rich Kids' which describe rich bitches taking too much cocaine and doing dumb shit and wanting to kill themselves, I've never heard anyone else do songs about this, and they're so good! And wow, Pyramids is so good, especially the first half. It's a jarring comparison, Cleopatra in the pyramids and a prostitute in a brothel called the pyramids but it's about much more than that. And John Mayer does this sick guitar solo on the slow bit at the end. Hell yeah. And one last shout-out to insanely silky smooth interlude 'White' also with John Mayer. That one's on my babymaking playlist",
      "topTracks": ["Thinkin Bout You", "Fertilizer", "Sweet Life", "Super Rich Kids", "Pyramids", "White", "Bad Religion", "Forrest Gump"]
    },
    {
      "filename": "hiatus-weapon.jpg",
      "artist": "Hiatus Kaiyote",
      "name": "Choose Your Weapon",
      "releaseyear": "2015",
      "description": "I listened to this album during the Saarland years when I was into stuff like Snarky Puppy. I'm kinda out of that phase now but I still love this album! It's actually insane. It's very maximalist, lots of shit going on constantly. It's very jazzy which is fun, lots of cluster chords and off-beat syncopated rhythms and time signatures and stuff. The singer is ad-libbing a lot and knows all the harmonies super good. My first song of theirs 'Breathing Underwater' which is a good showcase for their wild music. I think my favourite is 'The Lung' which I have a strong memory of listening too while painting, although I also really love the fun ending to 'Jekyll' where she just sings along to this series of crazy chords for like a whole minute",
      "topTracks": ["Borderline With My Atoms", "Breathing Underwater", "Fingerprints", "Jekyll", "Atari", "The Lung"]
    },
    {
      "filename": "patrick-close.jpg",
      "artist": "Patrick Watson",
      "name": "Close to Paradise",
      "releaseyear": "2006",
      "description": "This album brings me back to teenage years! The first song I heard was 'The Storm' which I loved, but then I realised the whole album is super warm and fuzzy and special. Warm is definitely the word to describe songs like 'Slip Into Your Skin' or the amazing 'The Great Escape', a song with the most beautiful piano chords you'll ever hear",
      "topTracks": ["Close to Paradise", "Daydreamer", "Slip Into Your Skin", "The Storm", "Luscious Life", "Man Under the Sea", "The Great Escape", "Bright Shiny Lights"]
    },
    {
      "filename": "honne-warm.jpg",
      "artist": "HONNE",
      "name": "Warm on a Cold Night",
      "releaseyear": "2016",
      "description": "I got into this band big time in my final year of university and I truly thought they were the bees knees. Looking back, I think their music is very cheesy and kinda bad but this first album remains in my heart. Afterwards they got really big in Asia and now make pretty surface level pop which I don't vibe with at all. But those first tracks they released really opened my eyes to chill vibe pop music. 'All in the Value' and 'Coastal Love' are both still great to this day",
      "topTracks": ["Warm on a Cold Night", "Someone That Loves You", "All in the Value", "Out of My Control", "Coastal Love", "Good Together", "One at a Time Please"]
    },
    {
      "filename": "kendrick-pimp.webp",
      "artist": "Kendrick Lamar",
      "name": "To Pimp a Butterfly",
      "releaseyear": "2015",
      "description": "This album actually kick-started my hip-hop phase. As a lover of soul and jazz this is the kind of hip-hop that really appealed. It also helped that this is a legendary album with so much smart shit going on. Many layers and an over-arching story. It's even got this insane poem which is slowly recites as the album progresses, each line of the poem causing a flashback-like switch into another song, ultimately building up this picture of Kendrick as a successful rapper finding himself abusing his position, coming back to Compton and despairing at the state of affairs. I love so many great moments in this album. Everything about 'For Free?', the beat in 'King Kunta', the chord progression in 'How Much A Dollar Cost', Rapsody's verse in 'Complexion', the fight that breaks out in 'i', and most of all I love the song 'These Walls'. I just love how it sounds and the lyrics are super smart too",
      "topTracks": ["For Free? - Interlude", "King Kunta", "These Walls", "Alright", "How Much A Dollar Cost", "Complexion (A Zulu Love)", "The Blacker The Berry", "i"]
    },
    {
      "filename": "loney-dear.jpg",
      "artist": "Loney Dear",
      "name": "Dear John",
      "releaseyear": "2009",
      "description": "I got to know this artist during my Swedish indie music phase and now this album has a special place in my heart. Most interestingly this album kicks off with two super intense tracks which I'm obsessed with. Later on things calm down but those first two tracks go so hard",
      "topTracks": ["Airport Surroundings", "Everything Turns To You", "Under a Silent Sea", "Dear John"]
    },
    {
      "filename": "loney-hall.webp",
      "artist": "Loney Dear",
      "name": "Hall Music",
      "releaseyear": "2011",
      "description": "This might be one of the most obscure albums on this list, but whatever, this album has been with me for a long time. It's sad, beautiful and has an underlying layer of darkness. This is music for when you've had some bad news and need to feel your feelings. I want to give special shoutouts to the final track which features a different singer. It sounds like the song that would roll during the credits of a romantic thriller from the 80s and has lyrics about hopelessness and giving up and I just love it. It's like giving up and saying goodbye with a smile and a tear in your eye",
      "topTracks": ["Name", "Loney Blues", "D Major", "Largo", "Durmoll", "What Have I Become?"]
    },
    {
      "filename": "björk-debut.jpg",
      "artist": "Björk",
      "name": "Debut",
      "releaseyear": "1993",
      "description": "The only Björk album that I've known for a long time and I associate with some kind of nostalgia. These songs are all so... revolutionary. It feels like she's starting a movement. You listen to it and you just know that so many people have been influenced by it. One thing that really struck me when I first heard 'Venus as a boy' was how cold the production is. Cold as in, not warm and fuzzy love songs, but rather pointy, jaggedy, I guess Icelandic. The lyrics are warm but the strings sound like a fresh breeze that makes you want to curl up under the sheets. Then this album also has some great dance music. Love it so much",
      "topTracks": ["Human Behaviour", "Venus As A Boy", "There's More To Life Than This", "Come To Me", "Play Dead"]
    },
    {
      "filename": "björk-homogenic.jpg",
      "artist": "Björk",
      "name": "Homogenic",
      "releaseyear": "1997",
      "description": "I've been learning about Björk in recent years. Up until this point her music hasn't been 'accessible' enough for me but I realise now that's bullshit. She is amazing. About a year ago I took edibles at home, painted a picture of Lickilicky and listened to her entire discography and it was amazing. I listened and loved Debut when I was younger but she has a whole bunch of other great albums too, including this one. Homogenic I've really latched on to more than her other ones, I think mainly because of 'Bachelorette', which has that film-music vibe, like James Bond, similar to Debut's 'Play Dead'.",
      "topTracks": ["Hunter", "Jóga", "Bachelorette"]
    },
    {
      "filename": "caroline-desire.webp",
      "artist": "Caroline Polachek",
      "name": "Desire, I Want To Turn Into You",
      "releaseyear": "2023",
      "description": "I was truly in my pop era when I got into this album. My favourite song of hers is definitely 'Billions', which is such an amazing magical fantasy vibe. It's giving Björk. I love it when she says 'pearl of the oyster'. On a similar vein is the song 'Butterfly Net' which I also love, especially the version with Weyes Blood. I also have a big poster of the single art from 'Blood and Butter' in my kitchen and for good reason: this song has bagpipes in it and they sound fucking great. I also love that she put in a flamenco song 'Sunset' as well. What can't she do?",
      "topTracks": ["Sunset", "Fly To You", "Blood And Butter", "Butterfly Net", "Billions"]
    },
    {
      "filename": "natalia-flores.jpg",
      "artist": "Natalia Lafourcade",
      "name": "De Todas Las Flores",
      "releaseyear": "2022",
      "description": "This album means so much to me because I listened to it so much when visiting Mexico! It really helped me sink into Mexican culture and was my gateway drug to the huge world of Mexican music. She was already legend in Mexico but this album takes things to the next level. It's stunning. It merges lots of styles of music from all over latin america, is a little jazzy, and takes its time with long intros and lovely instrumentals. It still respects your time though. From beginning to end it takes your hand and guides you through all these emotional topics and I just love it so much. I also learned more about this album as I learned spanish, which was awesome. My favourites are the upbeat ones like 'El lugar correcto' and 'Canta la arena', and the very last track I have to save for special occasions because it makes me so sad",
      "topTracks": ["Pasan los días", "El lugar correcto", "Pajarito Colibrí", "María la Curandera", "Caminar Bonito", "Canta la arena", "Que te vaya bonito Nicolás"]
    },
    {
      "filename": "school-disconnect.jpg",
      "artist": "School of Seven Bells",
      "name": "Disconnect From Desire",
      "releaseyear": "2010",
      "description": "A super special band that I got into during uni times. They make very atmospheric pop/rock with lots of guitar pedals and noise. It's almost shoegaze-y. You can put on this album in your headphones when the wind is blowing really hard. Actually that makes a lot of sense because a bunch of the songs are about wind and storms and stuff. My favourite song is 'Bye Bye Bye' which feels like a tsunami. Tragically one of the band members died and they haven't made music since",
      "topTracks": ["Windstorm", "Dust Devil", "Babelonia", "Bye Bye Bye"]
    },
    {
      "filename": "mvula-sing.jpg",
      "artist": "Laura Mvula",
      "name": "Sing to the Moon",
      "releaseyear": "2013",
      "description": "I love this album because it's written by a super normal British person! She's a bit of a music theory nerd and you can tell, the music has a faint Jacob Collier quality. I love the chords she uses in 'Can't Live with the World', especially when it modulates, and also 'Jump Right Out'. And she also just has these amazing ballads which are so great for singing along to when you're feeling miserable",
      "topTracks": ["Like the Morning Dew", "Can't Live with the World", "Is There Anybody Out there?", "Father, Father", "She", "Diamonds", "Jump Right Out", "Something Out of the Blue"]
    },
    {
      "filename": "psychedelic-visceral.jpg",
      "artist": "Psychedelic Porn Crumpets",
      "name": "High Visceral, Pt. 1",
      "releaseyear": "2016",
      "description": "This band have a ridiculous name. It's so ridiculous to the point that I actively don't bring them up in conversation because I have to explain that it's a real band. Like why would you name yourself this. I mean I guess I called myself BREXIT so I can't talk but still. Anyway I don't claim to be a rock music lover but this is a fantastic rock album. It's great for working out. The intensity remains on maximum for the whole time, and then you have the blissful closing track. It's great",
      "topTracks": ["Cornflake", "Cubensis Lenses", "..and the Addled Abstraction of Being", "Found God in a Tomato", "Denmark / Van Gogh & Gone"]
    },
    {
      "filename": "madonna-erotica.png",
      "artist": "Madonna",
      "name": "Erotica",
      "releaseyear": "1992",
      "description": "This is the album that dropped after 'Vogue'. Madonna was in the middle of the New York ballroom scene at its height and this album is all about that scene! It's this beautiful blend of pop and house music that is so reminiscent of the era. It's full of queer anthems and a hallmark of queer history. I love the cover of 'Fever' done in this ballroom house style and I often DJ it! This album is also super sexualised which at the time was very scandalous but she just don't give a damn. Because it's Madonna and she's a legend",
      "topTracks": ["Fever", "Deeper and Deeper", "Where Life Begins", "In This Life"]
    },
    {
      "filename": "kylie-rhythm.png",
      "artist": "Kylie Minogue",
      "name": "Rhythm of Love",
      "releaseyear": "1990",
      "description": "Is 'Better the Devil You Know' the best pop song of all time? Maybe it is. One thing's for sure, I spent ages practicing this to myself at home before going to Monster Ronson's karaoke for the fun time. That key change is hard if you're new to singing like me. I am convinced that that song is actually very dark, it's about staying in an abusive relationship because it's too scary to leave it. There's this shot of her running in the music video with a look on her face which convinces me that I'm right. For the rest of the album, she is just dancing and partying though, which is also fine. This early 90s production by Stock Aitken Waterman is so good and Kylie fucking smashes it on all these songs. I am obsessed with the minute and a half intro to 'Shocked' I mean what a build up! And then there is the hilarious 'One Boy Girl' which features an uncredited rap from The Poetess, about her being faithful to her man, even when all the other girls are sleeping round. It's really great, definitely a bit problematic but I just love it",
      "topTracks": ["Better the Devil You Know", "Step Back in Time", "Always Find the Time", "Shocked", "One Boy Girl", "Things Can Only Get Better"]
    },
    {
      "filename": "kylie-fever.jpg",
      "artist": "Kylie Minogue",
      "name": "Fever",
      "releaseyear": "2001",
      "description": "Kylie's most famous era, when we enter into genre-defining 2000's dancepop. Young gay Fraser loved this album as a 10 year old. This might be when my mum might have started suspecting I was fruitier than my brothers. Looking back I realise that I was right - Kylie is a goddess and this album is an absolute classic. These hits are so singable at Karaoke. My absolute faves are definitely 'In Your Eyes' and 'Come into My World', both of which have great music videos",
      "topTracks": ["More More More", "Love at First Sight", "Can't Get You out of My Head", "Come into My World", "In Your Eyes", "Burning Up"]
    },
    {
      "filename": "dorian-flamboyant.jpg",
      "artist": "Dorian Electra",
      "name": "Flamboyant",
      "releaseyear": "2019",
      "description": "'You know I ain't straight, but I'll say it straight to you' - you know that Dorian Electra is great because they have MULTIPLE songs about romancing your bro. This album is so gay it hurts. It takes all the typical queer tropes and slams them in your face and it is so much fun. When they sing 'One on one!' in Man to Man they sound so horny, I love it. Then there's 'Flamboyant' which is just so fucking good, and even a song called 'Adam & Steve'. It's gay pop perfection",
      "topTracks": ["Career Boy", "Man To Man", "Musical Genius", "Flamboyant", "Guyliner", "Adam & Steve"]
    },
    {
      "filename": "dorian-agenda.jpg",
      "artist": "Dorian Electra",
      "name": "My Agenda",
      "releaseyear": "2020",
      "description": "This album is WILD! Dorian Electra goes full hyperpop for this one. Normally I'm not into the crazy hyperpop stuff but they do it super well they attach it to this insane concept of the neckbeard video game internet warrior. I mean just watch the video for 'Gentleman' and you'll understand. They are shitting on those keyboard warriors and turning their aesthetic into high art and it's so good. 'Edgelord's lyrics are just............ and then there's the video for 'Give Great Thanks'.......! And my all time favourite is the absurd video for 'F the World' featuring Dorian dressed up as a christian woman enjoying the autumn in the suburbs. It's a weird pastiche of vapid instagram models with this insane music going on in the background. Kudos to Dorian for this album it is insane",
      "topTracks": ["F The World", "My Agenda", "Gentleman", "M'Lady", "Sorry Bro (I Love You)", "Edgelord", "Ram It Down", "Give Great Thanks"]
    },
    {
      "filename": "beirut-flying.jpg",
      "artist": "Beirut",
      "name": "The Flying Club Cup",
      "releaseyear": "2007",
      "description": "This album is super special because the band was inspired by chanson francaise for it, which is why there are so many delicious accordions. I love the vibe of this album in general, but it also has a bunch of really great moments. The first track is kinda iconic, and I love the 'encore... une fois...' at the start of 'A Sunday Smile'. I think my favourite is the beautiful outro of 'In the Mausoleum', when all the strings come in. It's so good",
      "topTracks": ["Nantes", "A Sunday Smile", "In the Mausoleum", "Un Dernier Verre (Pour La Route)", "St. Apollonia"]
    },
    {
      "filename": "nelly-folklore.jpg",
      "artist": "Nelly Furtado",
      "name": "Folklore",
      "releaseyear": "2003",
      "description": "This is a key Fraser album which was with me during my original pop phase as a young teenager. I remember listening to this on my mp3 player on family holidays. All these songs are still so good today as well! 'Powerless' despite its lyrics is the most positive sounding song ever. And just listening to the album for this website entry got me listening to the lyrics of 'The Grass is Green' and only NOW do I finally understand what she's actually going on about. Then I always felt like this album was neatly split in two by the amazing 'Picture Perfect', where she plays the role of the girlfriend of a rising star. Whenever I hear this song I just get transported back. Same goes for 'Childhood Dreams' it's like unlocking core memories each time. I associate these songs with reading the 'Wind Singer' books as a child",
      "topTracks": ["One-Trick Pony", "Powerless (Say What You Want)", "Explode", "Força", "The Grass Is Green", "Picture Perfect", "Build You Up", "Island Of Wonder", "Childhood Dream"]
    },
    {
      "filename": "hot-heads.jpg",
      "artist": "Hot Chip",
      "name": "In Our Heads",
      "releaseyear": "2012",
      "description": "The quintessential Hot Chip album and probably the CD I have put on the most out of my whole CD collection. It's accessible, so great for parties, and also super interesting and fun to listen to. 'Ends of the Earth' was the first track I ever heard from Hot Chip and it has such a wild intro that I was hooked. 'Don't Deny Your Heart' has the amazing bridge, 'These Chains' makes me want to stop what I'm doing and dance, and 'Flutes' will always remind me of when I saw them live and they spent the whole song turning 90 degrees every 2 bars, Macarena-style. I think they're just a bunch of nerds. I will say that I wish that 'Let Me Be Him' was the final song",
      "topTracks": ["Motion Sickness", "Don't Deny Your Heart", "These Chains", "Flutes", "Ends of the Earth", "Let Me Be Him"]
    },
    {
      "filename": "kimbra-echo.webp",
      "artist": "Kimbra",
      "name": "The Golden Echo",
      "releaseyear": "2014",
      "description": "When I went to see Kimbra in concert recently she played a song from this album and said it was a deep cut that we probably don't know. I really wish I called out and said 'I love that album'! It might literally be her least popular one but it's my one. The songs are kinda wild and maybe it's not very accessible but fuck it I totally connected with this, much more than her other albums. Special shoutouts go to the song 'Rescue Him' about trying to fix up a difficult man, and 'As You Are' because she sounds so scary and horny all at once. The final song is really good too. I do tend to skip '90s music' I will say. That songs feels like she was just fucking around in the studio maybe a bit too much",
      "topTracks": ["Teen Heat", "90s Music", "Goldmine", "Miracle", "Rescue Him", "Everlovin' Ya", "As You Are", "Love in High Places", "Waltz Me to the Grave"]
    },
    {
      "filename": "miike-snow.jpg",
      "artist": "Miike Snow",
      "name": "Miike Snow",
      "releaseyear": "2007",
      "description": "This album is totally synonymous with playing World of Warcraft at the age of 15. I remember being interested when my friend Tim described the live show as a 'wall of sound'. I remember thinking to myself, what does that mean? so I approached the album with an open heart and ended up getting into a bunch of Swedish music. All these tracks, 'Burial', 'Silvia', 'Plastic Jungle'... I can even place them in certain locations in World of Warcraft. Anyway this album is great",
      "topTracks": ["Animal", "Burial", "Silvia", "Plastic Jungle", "In Search Of"]
    },
    {
      "filename": "miike-happy.jpg",
      "artist": "Miike Snow",
      "name": "Happy To You",
      "releaseyear": "2012",
      "description": "Less famous but in my opinion the better of the Miike Snow albums! This one has just so many banger tracks, and it's they're all so interesting. There's so many cool ideas in all these. Like listen to the first track and you'll see what I mean. I love the intenseness of 'Devil's Work', and the intimacy of 'Black Tin Box', which by the way features Lykke Li (who I looooove). I also spent a lot of time being obsessed with the song 'God Help This Divorce'",
      "topTracks": ["Enter the Jokers Lair", "The Wave", "Devil's Work", "God Help This Divorce", "Bavarian #1 (Say You Will)", "Archipelago", "Black Tin Box", "Paddling Out"]
    },
    {
      "filename": "hard-feelings.jpg",
      "artist": "HARD FEELINGS",
      "name": "HARD FEELINGS",
      "releaseyear": "2021",
      "description": "This is a collaberation between Joe Goddard of Hot Chip and Amy Douglas, who is a larger-than-life personality singing and looking fabulous. This album never really took off but I always loved it. 'Holding on too long' is what hooked me originally, but now I realise that the final two minutes of 'Dangerous' is what it's really all about, as well as the intimacy of 'About Us'. I guess there won't be more of this music but I loved it",
      "topTracks": ["Dangerous", "About Us", "Holding On Too Long", "Sister Infinity"]
    },
    {
      "filename": "pink-heaven.jpg",
      "artist": "PinkPantheress",
      "name": "Heaven Knows",
      "releaseyear": "2023",
      "description": "I have huge respect for PinkPantheress for making something entirely new. A breakbeat album mixed with Gen Z pop with vocals from the popular girl at school. She really embodies the aesthetic of 'pretty girl' with her handbag and won't-do attitude and I'm obsessed. And then she just has this great production, like the very first track which sounds like a sonic game, or 'Capable of Love' which I guess is her longest song and also her best imo",
      "topTracks": ["Another Life", "Mosquito", "Capable of Love"]
    },
    {
      "filename": "anohni-bird.png",
      "artist": "ANOHNI and the Johnsons",
      "name": "I Am A Bird Now",
      "releaseyear": "2005",
      "description": "This is such a stunning and sad album. I save it for special occasions. I listen to ANOHNI whenever I need to hear someone sing about the world's horrors, and also know how I'm feeling. She's been through so much shit and it's comforting to know that she understands. I love how simple and real 'You Are My Sister' is, singing along with Boy George. And it makes me cry to think about how despite everything, she retains faith and knows that she will become a bird guhl.",
      "topTracks": ["Hope There's Someone", "For Today I Am A Boy", "Man Is The Baby", "You Are My Sister", "Bird Guhl"]
    },
    {
      "filename": "anohni-back.png",
      "artist": "ANOHNI and the Johnsons",
      "name": "My Back was a Bridge for you to Cross",
      "releaseyear": "2023",
      "description": "I love this album so much. I also only ever play it on special occasions, when I'm feeling particularly emotional. The first thing you should know about the album though is that it's a doomer album. She is explicitly talking about the climate crisis, and how the world is on the verge of collapse. She sings about how trans people are scapegoated for all the world's problems. In the video of 'It Must Change', Mother Earth is played by a black trans woman as she issues a warning. 'Why Am I Alive Now?' is just openly specific about the fading of the natural world, and also the most beautiful song she's ever made. Those electric guitar chords... the moment when the chords cycle through and she sings 'birds and insects looking for a place to hide'... and the music video about trans women finding each other... it's just so stunning. Whenever I listen to this I am reminded of see her live in Berlin. The soundscape she created was breathtaking. I wish all the best for her",
      "topTracks": ["It Must Change", "Sliver of Ice", "It's My Fault", "Rest", "Why Am I Alive Now?", "You Be Free"]
    },
    {
      "filename": "sufjan-illinois.jpg",
      "artist": "Sufjan Stevens",
      "name": "Illinois",
      "releaseyear": "2005",
      "description": "This album is so huge. There's actually so much going on it's wild. But the most remarkable thing about it is the choice of instruments. Like this is indie music for sure, but done with what I guess is an Appalachian folk band. I'm not really sure but definitely a lot of wind instruments like the oboe, which just makes for a whole new sound. And it's like that the whole album through, with tons of fun musical ideas and wild songs about all sorts of topics. There are some of the best indie songs ever in 'Chicago' and 'Casimir Pulaski Day' which are so hummable and delightful, then there's the stunning opener 'Concerning the UFO sighting...'. That song I use to test headphones with. The long song titles are a laugh but it does mean I can't take note of which song is song, meaning it feels like a beginning to end album experience more than songs in a playlist",
      "topTracks": ["Concerning the UFO sighting near Highland, Illinois", "John Wayne Gacy, Jr.", "Jacksonville", "Decatur, or, Round of Applause for Your Step-Mother!", "Chicago", "Casimir Pulaski Day", "The Man of Metropolis Steals Our Hearts", "They Are Night Zombies!! They Are Neighbors!! They Have Come Back From the Dead!! Ahhhh!", "The Tallest Man, the Broadest Shoulders Part I: The Great Frontier Part II: Come to Me Only With Playthings Now"]
    },
    {
      "filename": "bear-heaven.webp",
      "artist": "Bear in Heaven",
      "name": "I Love You, It's Cool",
      "releaseyear": "2012",
      "description": "This is a pretty obscure psychedelic electronic band who make very busy and crowded music. Definitely a 'wall of sound' situation and it sounds fucking great. A lot of the songs are very intense, making this a great album for the gym, or actually really great for if you're feeling angry. It is danceable but I don't think it's about dancing, it's more of a solo headphones experience. It will at least drown out all your other thoughts so there's that",
      "topTracks": ["The Reflection Of You", "Sinful Nature", "Cool Light", "Kiss Me Crazy", "World of Freakout", "Space Remains"]
    },
    {
      "filename": "department-ear.jpg",
      "artist": "Department of Eagles",
      "name": "In Ear Park",
      "releaseyear": "2008",
      "description": "In my indie days as a teenager I got into this album because I was a fan of Daniel Rossen from Grizzly Bear. For a folky album it has a very mysterious and dark vibe. You'll get what I mean when you hear the chorus in 'In Ear Park'. I also want to shout out the final track 'Balmy Night', which is about panic, and is definitely up there in terms of favourite ever songs. It feels like something is washing over you when you listen to it crescendo. This album does have a bad track, 'Classical Records'. Really not sure what's going on with that one",
      "topTracks": ["In Ear Park", "Phantom Other", "Floating On The Lehigh", "Balmy Night"]
    },
    {
      "filename": "ultraflex-wellness.jpg",
      "artist": "Ultraflex",
      "name": "Infinite Wellness",
      "releaseyear": "2022",
      "description": "This local Berlin band have made an aesthetic surrounding the concept of wellness of all things. We're talking massages, spa, and the white people who engage in that stuff. I fucking love it. They are two queer women who just know how to vibe and when we went to their show they had a poledancer and made loads of jokes about lesbian stuff and pregnancy. The music itself is giving 80s exercise dance videos, and the lyrics are just great. 'Rhodos' is literally about northern europeans visiting mediterranean islands get lathering themselves with aftersun. They famously accuse the listener of being 'tacky to the bone' which is something I deeply relate with",
      "topTracks": ["Relax", "Mi Vuoi", "Rhodos"]
    },
    {
      "filename": "ladyhawke-ladyhawke.jpg",
      "artist": "Ladyhawke",
      "name": "Ladyhawke",
      "releaseyear": "2008",
      "description": "Although I mainly associate this album with playing World of Warcraft during the time when I was like 15 playing that game every day, that doesn't mean it isn't super great. What caught me was the magical chorus of 'Paris is Burning', which remains my favourite song of hers. But the whole vibe of the album is great. It's going for 80s nostalgia but still sounds firmly 2000s. 'My Delirium' is super intense, 'Professional Suicide' is a lot of fun and I especially enjoy 'Morning Dreams' because I love the chill out tracks what can I say",
      "topTracks": ["Magic", "My Delirium", "Paris Is Burning", "Professional Suicide", "Morning Dreams"]
    },
    {
      "filename": "tkay-year.jpg",
      "artist": "Tkay Maidza",
      "name": "Last Year Was Weird Vol 2",
      "releaseyear": "2020",
      "description": "This is a fun EP which is full of a great variety of stuff. We've got dance music, hip hop, some chill tracks. It's a fun, cute little collection of songs that I often find myself coming back to. I admit to learning about this from theneedledrop who sometimes has good recommendations. I really enjoy the track '24k'",
      "topTracks": ["My Flowers", "24k", "You Sad", "PB Jam", "Don't Call Again"]
    },
    {
      "filename": "feist-metals.jpg",
      "artist": "Feist",
      "name": "Metals",
      "releaseyear": "2011",
      "description": "This Feist album is totally different from the others and it succeeds in making a vibe and aesthetic out of these keywords: 'grey', 'cold', 'winter', 'bare'. I get that those keywords don't sound appealing but I promise this album is super lovely. In parts it's very dramatic like with the first track, or the very slow 'Anti-Pioneer' which has this insane wave of sound towards the end, or also 'Undiscovered First' which is so good. 'Caught A Long Wind' is also a very special song which despite its strings and woodwind feels actually cold. It's very stark and stunning. Really hard to put into words why I like this album so much",
      "topTracks": ["The Bad In Each Other", "Graveyard", "Caught A Long Wind", "A Commotion", "Anti-Pioneer", "Undiscovered First", "Cicadas And Gulls"]
    },
    {
      "filename": "feist-die.jpg",
      "artist": "Feist",
      "name": "Let It Die",
      "releaseyear": "2004",
      "description": "What a beautiful album from lovely Feist, who makes beautiful and awesome music because she's great. I was deep in my singer songwriter phase and found a lot of meaning in a lot of these songs. My first Feist track ever was actually 'Inside and Out' for some reason. I still love it! 'Gatekeeper' is so nice. It's about some person or thing who is stopping summer from arriving, and realising that certain relationships don't work in the other seasons of the year. Then you've got 'Leisure Suite' which is a classy Sade-like track about being comfortable at home. 'Secret Heart' I always thought was about coming out as gay but then I read the lyrics and also realised it's a cover of Ron Sexsmith and I realised it's actually just about a man saying I love you to a woman. Whatever art isn't meant to be interpreted by the artist anyway, I, the listener, decide what it's about for me",
      "topTracks": ["Gatekeeper", "Mushaboom", "Let It Die", "One Evening", "Leisure Suite", "Secret Heart", "Inside and Out"]
    },
    {
      "filename": "feist-reminder.jpg",
      "artist": "Feist",
      "name": "The Reminder",
      "releaseyear": "2007",
      "description": "I've always felt that 'My Moon My Man' is actually about anal sex. Why else would she say 'My moon'? When I look at the youtube comments on the video it's clear that it's just me that thinks that. But I mean the lyrics... 'It's the dirtiest clean I know', 'Take it slow, take it easy on me', 'My moon's white face'... whatever. This album is great. It's a collection of some of the all time best Feist songs. I love 'The Park' so much because we've all fucking been there. You're in a park or something and you just imagine someone you know being there too by chance. This album also features 'The Limit To Your Love' the original track that James Black famously interpolated. I love this track sooooo much, especially those piano chords in the chorus. So dramatic. Also I love the lilting and drifting 'Brandy Alexander', mainly for its melancholic chord progression",
      "topTracks": ["So Sorry", "My Moon My Man", "The Park", "The Water", "The Limit To Your Love", "Brandy Alexander"]
    },
    {
      "filename": "air-moon.jpg",
      "artist": "Air",
      "name": "Moon Safari",
      "releaseyear": "1998",
      "description": "This is a classic album of electronic lounge music which I used to love so much. The first track is such a warm embrace and introduces you to the music and the vibe perfectly. Then there are some great pop tracks like 'Kelly Watch the Stars' and 'You Make It Easy' and 'Sexy Boy', so much to enjoy. I remember the first time I heard this band was the song 'Ce matin-là' on recommendation of an internet friend and I loved it. Nowadays I love 'Le voyage de Pénélope' the most because it's kinda dark. I went to see their 25th anniversary concert but it wasn't very good because they didn't have any stage banter, they just played the songs like on the CD. I was a bit disappointed, but it had a lot to do with the venue (Zitadelle Spandau)",
      "topTracks": ["La femme d'argent", "Sexy Boy", "Kelly Watch the Stars", "You Make It Easy", "Ce matin-là", "Le voyage de Pénélope"]
    },
    {
      "filename": "metronomy-love.jpg",
      "artist": "Metronomy",
      "name": "Love Letters",
      "releaseyear": "2014",
      "description": "Even though I had a phase of listening to lots of this band, something about them bothered me. The main guy seemed whiny or something. But for some reason I mega loved this one album of theirs! It feels kinda nerdy and fun with its use of organs and silly little riffs but who cares it's a lot of fun. Just look at the song 'Love Letters' which definitely only claims to be a fun campfire singalong. But it's fun! I also really like these organ sounds they're using, like on 'Reservoir' especially. I also really like the bit where is fades away on 'The Most Immaculate Haircut', it's like when Björk stepped out of the club on 'Debut' but with a campfire song",
      "topTracks": ["The Upsetter", "I'm Aquarius", "Love Letters", "The Most Immaculate Haircut", "Reservoir"]
    },
    {
      "filename": "madvillain-madvillainy.jpg",
      "artist": "Madvillain",
      "name": "Madvillainy",
      "releaseyear": "2004",
      "description": "I love MF Doom he sounds so chill when he raps. This collab with Madlib is so fun and so cool. Great to put on when you're hanging with cool people or hip-hop fans. What I love about it is the old cartoon vibes, like it could be from Inspector Gadget or something. He plays this character of a supervillain and the music totally reflects it. If you like that stuff I also recommend 'Sour Soul' by BADBADNOTGOOD and Ghostface Killah. The best thing about this album is the instrumentals. They're all over the place and a lot of fun",
      "topTracks": ["Accordion", "Bistro", "Curls", "Figaro", "All Caps", "Rhinestone Cowboy"]
    },
    {
      "filename": "woon-time.webp",
      "artist": "Jamie Woon",
      "name": "Making Time",
      "releaseyear": "2015",
      "description": "Jamie Woon is up there with Jordan Rakei in terms of inoffensive white boy soul music but what can I say, I guess I'm the target audience. I wouldn't say this album is legendary like most of the albums on this list but I keep finding myself coming back to it. Putting on the whole thing is a good sunday afternoon vibe, and it has some real good standouts like 'Sharpness' which hangs on this funky chord, 'Skin' which is just so intimate that it made it onto the babymaking playlist. My favourite though is the closer 'Dedication' which is perfect for when you're feeling ultra relaxed before bed",
      "topTracks": ["Message", "Movement", "Sharpness", "Lament", "Skin", "Dedication"]
    },
    {
      "filename": "silvana-marchita.jpg",
      "artist": "Silvana Estrada",
      "name": "Marchita",
      "releaseyear": "2022",
      "description": "PLEASE take some time out of your day and watch her Tiny Desk concert. It is stunning and she is amazing. This album is simple voice and mexican instrument the 'cuatro', although she enriches that with these amazing string arrangements that are never in the way. I love the album though because of the gorgeous songwriting and her beautiful voice. She's like an angel. Getting to this album while spending time in Mexico was also magical. There's something about understanding songs better over time as you get a better grasp on the language. I think for me my favourite track is 'Ser De Ti'. It describes belonging to someone, something I've never really felt before. It sounds almost resigned, disappointed, melancholic. Anyway, stop readying and go watch the Tiny Desk",
      "topTracks": ["Te Guardo", "Marchita", "Carta", "Ser De Ti", "La Enfermedad Del Siglo"]
    },
    {
      "filename": "ana-chama.jpg",
      "artist": "Ana Frango Elétrico",
      "name": "Me Chama De Gato Que Eu Sou Sua",
      "releaseyear": "2023",
      "description": "After watching a disappointing Air concert at Zitadelle Spandau, I went to Ana's concert in a tiny room in Kreuzberg and fucking loved it. She is so badass and cool and I love her take on rock, pop and even disco, always with that delicious Brazilian flair. The album is also pretty queer if you listen to it a lot. The video for 'Insista en Mim' is beautiful, I love it so much",
      "topTracks": ["Electric Fish", "Dela", "Boy of Stranger Things", "Insista em Mim", "Dr. Sabe Tudo"]
    },
    {
      "filename": "röyksopp-melody.jpg",
      "artist": "Röyksopp",
      "name": "Melody AM",
      "releaseyear": "2001",
      "description": "I feel like this band might be famous because of tracks like 'Eple' like was it in an advert? I know that I know it because 'Poor Leno' was in the SSX 3 soundtrack. So I always associate this album with snowboarding. Whatever, this album is a classic. This is that real 2000's lounge/house vibe that you only find in bands like Röyksopp, Air, Moby, Groove Armada. And of course I have to bring up one of my favourite tracks 'Sparks' which has a central position on the babymaking playlist",
      "topTracks": ["So Easy", "Eple", "Sparks", "In Space", "Poor Leno"]
    },
    {
      "filename": "animal-merriweather.webp",
      "artist": "Animal Collective",
      "name": "Merriweather Post Pavilion",
      "releaseyear": "2009",
      "description": "This album marks my gentle dive into actual good music. Back when I was friends with a bunch of people on the internet as a teenager, I was recommended this band and this album had just come out. It was so unlike anything I was listening to at the time (indie music only) but I totally vibed with it. It's so intense and so thick. So busy. The first song I really vibed with was 'Summertime Clothes' but I realise that every track on this thing has something special about it. The incredible admission of 'Are you also frightened?' at the end of that song, insane. Just like the end of 'Brother Sport'. It's actually nuts. Actually that last song sounds like how nutting feels. I also adore the time signature of 'Lion in a Coma' and the beautiful chill track 'No More Runnin'. I'm embarrassed to admit it but I associate this album memory-wise with playing World of Warcraft",
      "topTracks": ["My Girls", "Also Frightened", "Summertime Clothes", "Bluish", "Guys Eyes", "Lion In A Coma", "No More Runnin", "Brother Sport"]
    },
    {
      "filename": "camera-maudlin.jpg",
      "artist": "Camera Obscura",
      "name": "My Maudlin Career",
      "releaseyear": "2009",
      "description": "I learned about this album during my indie phase as a teenager and loved its very unique vibe. Lots of echo and colour and strings, it sounds like delicate music. My favourite track is 'Careless Love', which has such a lovely string part at the end of the song",
      "topTracks": ["French Navy", "James", "Careless Love", "Honey in the Sun"]
    },
    {
      "filename": "geordie-new.jpg",
      "artist": "Geordie Greep",
      "name": "The New Sound",
      "releaseyear": "2024",
      "description": "This album's lyrics are so wild that you straight up can't put this on while other people are around. It's like toxic masculinity, the album, all about the kind of weak-ego men who visit prostitutes and treat women like shit, and the lyrics explicitly address that. Have a listen to 'Holy, Holy' and if you're too shocked to continue, you can stop there. It's definitely more than just the painting of this picture though, the descriptions of these men also reveal their vulnerabilities as well. Like after 5 minutes of horrible self-aggrandising speech to a new prostitute at his favourite brothel, in the climax he reveals that he'll just pay her to go to the bathroom with him and put her hand on his knee, and not actually touch her. The albums actually about how society drives men to such extremes and reveals how much they are suffering as a result too. Also, the album is banging. Fans of Black Midi and other new alternative rock making waves out of the UK will love this. One thing that I especially love about it is the use of brazilian samba rhythms, especially in the song 'Terra'. And I also love the final part of 'As If Waltz' with the guitar solo. So good",
      "topTracks": ["Terra", "Holy, Holy", "The New Sound", "Through a War", "As If Waltz"]
    },
    {
      "filename": "perfume-ugly.webp",
      "artist": "Perfume Genius",
      "name": "Ugly Season",
      "releaseyear": "2022",
      "description": "I had followed Perfume Genius on twitter because he posted hilarious stuff, and that's how I got kinda excited when he dropped this surprise album. Definitely way more experimental and wild then his more famous albums before it but I dunno I really connected with it. There is a really good run of tracks in the second half which cover a range of vibes. They played two songs from this album at their concert, Eye in the Wall and Photograph, two songs that I utterly adore. Eye in the Wall for its major chords over the almost eerie backing track, and Photograph for its hard hitting lyrics and emotional moments.",
      "topTracks": ["Ugly Season", "Eye in the Wall", "Photograph", "Hellbent"]
    },
    {
      "filename": "simz-thank.jpg",
      "artist": "Little Simz",
      "name": "NO THANK YOU",
      "releaseyear": "2022",
      "description": "Little Simz is so good. I think she's my favourite rapper. And this is my favourite of her albums. So many beautiful tracks as well from Inflo, a producer I love. The video for Gorilla is great, and I love the song 'Silhouette' a lot. Introvert was good and all but for me there were some skips, meanwhile this one is super consistent and great. The last song sounds so nice as well, like she's talking directly to me, her best friend, explaining something she feels she loves",
      "topTracks": ["Gorilla", "Silhouette", "Broken", "Control"]
    },
    {
      "filename": "air-france.jpg",
      "artist": "Air France",
      "name": "No Way Down / On Trade Winds",
      "releaseyear": "2008",
      "description": "These are actually two EPs that I spent my life assuming was one album because that's how I had it saved on my mp3 player. They're a swedish electronic duo and their vibe is particularly special. The music conjures the image of taking a plan to travel to farther shores. The album feels like the soundtrack to a fast paced life-before-your-eyes montage. The combination of marimbas, distant trumpets, whistling, makes this whimsical, tropical feeling, almost like the feeling you get when you take molly. Then when 'Introduction' specifically gives those travelling business class vibes (seriously how did I not know it was two EPs when track 7 was called 'Introduction'), then it crashes into the insane 'Karibien' which is ultra intense, it's like the part at the start when you're REALLY high. When the vocals say 'emergency, sur le dessin bleu' I get shivers. Great album. Albums",
      "topTracks": ["June Evenings", "Collapsing Outside Your Doorstep", "No Excuses", "No Way Down", "Karibien", "Never Content"]
    },
    {
      "filename": "beach-once.jpg",
      "artist": "Beach House",
      "name": "Once Twice Melody",
      "releaseyear": "2022",
      "description": "This band truly have a unique sound! It's so awashed with sound that it feels like you're floating in space. The music feels like a dream, like your vision is hazy and you can't concentrate. And for some reason this album is a mega long 4-disk album! They released it in chunks, so I ended up listening to the first one a bunch, and for me it remains the best part. Although I like the creepy 'Masquerade' and beautiful conclusion 'Modern Love Stories' too. And the whole album, I just like it all",
      "topTracks": ["Once Twice Melody", "Superstar", "Pink Funeral", "Through Me", "Over and Over", "Masquerade", "Modern Love Stories"]
    },
    {
      "filename": "grizzly-yellow.webp",
      "artist": "Grizzly Bear",
      "name": "Yellow House",
      "releaseyear": "2006",
      "description": "I'm a fan of Daniel Rossen and that's how I got into this band. I like a lot of their albums but this is the one I've listened to the most, and the one that I like the most. Mysterious, nebulous music, fairy tale music, hard to say what kind of emotions are coming across. I really like the vibraphone in 'Central and Remote', and I especially love the track 'Reprise' which just has amazing harmony",
      "topTracks": ["Easier", "Central and Remote", "Plans", "On a Neck, On a Spit", "Reprise"]
    },
    {
      "filename": "coldplay-parachutes.jpg",
      "artist": "Coldplay",
      "name": "Parachutes",
      "releaseyear": "2000",
      "description": "Alright I know that people shit on Coldplay but the truth is when I was younger I was a fan. Their newer stuff I'm definitely not into, but these two first albums really slap. They're also genre-defining! Would we even have milky, normie, adult contemporary singer songwriter nonsense without 'Yellow' by Coldplay? Whatever, I really associate this album with those young adult fantasy novels I was reading as a teenager. I still love 'Don't Panic', 'Shiver', 'Sparks' and especially 'High Speed', which is a whole-ass, genuine, actual vibe. Who'd have thought that this berk Chris Martin could make an actual vibe like this.",
      "topTracks": ["Don't Panic", "Shiver", "Spies", "Sparks", "High Speed", "We Never Change"]
    },
    {
      "filename": "coldplay-rush.jpg",
      "artist": "Coldplay",
      "name": "A Rush of Blood to the Head",
      "releaseyear": "2002",
      "description": "God knows I can't stand this band these days but I'm about to come on to my own website and LIE. The truth is I loved Coldplay as a child and these first two albums are great. This particular album has so much going for it and I really associate it with like year 8-ish time at school. I remember watching the music for 'God put a smile upon your face' and being genuinely touched by it. Watching it now as I write this, apart from being put off by them trying to make Chris Martin look hot, it's still good! And the song itself is so good, actually the best Coldplay song. And the album just has a bunch of other great tracks which take me back to that time. I also particularly love the closing track because it's genuinely beautiful, and if you spend any time on this website, you'll quickly learn that I love sad songs. When I found out that my ex-boyfriend Ichsan loved Coldplay I was initially nervous (if you're reading this Ichsan I'm sorry for giving you shit for liking this band), but actually it was really nice bonding about old songs like this.",
      "topTracks": ["Politik", "God Put a Smile upon Your Face", "Green Eyes", "A Whisper", "A Rush of Blood to the Head", "Amsterdam"]
    },
    {
      "filename": "gorillaz-plastic.jpg",
      "artist": "Gorillaz",
      "name": "Plastic Beach",
      "releaseyear": "2010",
      "description": "This is a full on concept album centering on this vibe of a perfect sunset beach which is absolutely littered with trash. It fits into the Gorillaz lore and the videos are a lot of fun. I don't claim to be a mega fan but this album totally slaps and is also a total crowd pleaser. It's got this fun mix of hip hop, rock, pop and I guess like film music for westerns (just listen to the start of the song 'Plastic Beach'). One thing Gorillaz does really well are features, the two Little Dragon songs are both so good, and I love Bobby Womack going ham on 'Stylo'. I also can't believe their popular song from this album 'On Melancholy Hill' got so big, because it's so chill. Anyway I love that too. The whole album is great",
      "topTracks": ["Welcome to the World of the Plastic Beach", "White Flag", "Rhinestone Eyes", "Stylo", "Empire Ants", "On Melancholy Hill", "Plastic Beach", "To Binge", "Pirate Jet"]
    },
    {
      "filename": "father-comedy.jpg",
      "artist": "Father John Misty",
      "name": "Pure Comedy",
      "releaseyear": "2017",
      "description": "Father John Misty is so smart. His songs are pretty concrete which I love, and he actually talks about world events and politics. I love that shit. And his music is also beautiful. I realised that when I was lost somewhere in the very long 'Leaving LA'. Then when you come out of that song, it's something like the half way point, you end up in a different place entirely. I think my favourite is just 'Pure Comedy' which I very much relate to",
      "topTracks": ["Pure Comedy", "Total Entertainment Forever", "Leaving LA", "A Bigger Paper Bag", "Two Wildly Different Perspectives", "The Memo"]
    },
    {
      "filename": "roisin-machine.jpg",
      "artist": "Róisín Murphy",
      "name": "Róisín Machine",
      "releaseyear": "2020",
      "description": "This album is like a queer awakening! It's disco, it's pop, and it's fabulous, because Roísín's fabulous. The opener is great because it's this atmospheric, slow disco, and it's like slowly sinking into a groovy bath. It's kind of like taking drugs. I had a moment of betrayal when I mega-connected with the song 'Incapable' because I, too, might be incapable of love, and then read that in an interview she said she was playing a character, imagining what it would be like to not fall in love with everyone all the time, which is actually what happens. Damn it Roísín! I think my favourite on the album is 'Narcissus' which has this great middle section. I've got a great remix of it for my DJ sets",
      "topTracks": ["Simulation", "Something More", "Shellfish Mademoiselle", "Incapable", "Murphy's Law", "Narcissus", "Jealousy"]
    },
    {
      "filename": "noname-room.webp",
      "artist": "Noname",
      "name": "Room 25",
      "releaseyear": "2018",
      "description": "This album has my favourite noname songs. 'Prayer Song' is so intense and when I saw her perform it live I was blown away by its build-up and pretty strong lyrics. Also 'Window' the chorus is just so nice. At around this time, Noname was spending a lot of time in the spotlight on social media as a leftist. She was learning in real time and every time she learned something, she posted this wild take about any given topic on twitter and people went crazy. I learned a lot about politics, specifically about white supremacy and colonialism from her twitter account alone! She eventually stopped because she got too much shit for being loud on twitter and mental health always comes knocking when you're a difficult celebrity. But I was always sympathetic to her, and I feel like the 'scandals' that she was involved in were all fine. She famously pulled out of Coachella because she didn't want to perform for white audiences and honestly I get it. It's a bad move for your career to piss off white people but it's a great move if you love performing for predominantly black people and you have other things to do with your life than commercialise your music",
      "topTracks": ["Self", "Prayer Song", "Window", "Don't Forget about me", "Regal", "With you", "no name"]
    },
    {
      "filename": "noname-telefone.jpg",
      "artist": "Noname",
      "name": "Telefone",
      "releaseyear": "2016",
      "description": "Like many others I fell in love with Noname when I saw her Tiny Desk concert. She makes what she calls 'lullaby rap', peaceful thoughtful rap verses over soulful tracks. I love it! She also reveals all on this album, talking about plastic surgery, abortion and death and it's just so real. I love the kinda amateur-ish vibe and production of the whole thing. My favourite track is 'Shadow Man' which has a beautiful ending",
      "topTracks": ["Yesterday", "Diddy Bop", "Reality Check", "Bye Bye Baby", "Shadow Man"]
    },
    {
      "filename": "fanfarlo-rooms.webp",
      "artist": "Fanfarlo",
      "name": "Rooms Filled With Light",
      "releaseyear": "2012",
      "description": "I just learned writing this that this isn't even their popular album! A younger me just found this random ass album full of deep cuts from this indie band and connected with it, never listening to their other stuff. Anyway, similar to some other specific albums on this list (Björk Debut or Feist Metals) this album sounds very cold! Lots of sharp and sparse sounds, and fewer long sustained warm notes. Music that goes really well with winter. Take a listen to the first track 'Replicate' and you'll see what I mean. It's still nice, and still positive and optimistic music! It's just cool and wintry. I really associate this album with one particular narrowboat holiday with my family. It was the same time as I discovered Michael Kiwanuka and I remember thinking this music is cold and Michael's music is warm",
      "topTracks": ["Replicate", "Deconstruction", "Tunguska", "Tightrope"]
    },
    {
      "filename": "thievery-saudade.jpg",
      "artist": "Thievery Corporation",
      "name": "Saudade",
      "releaseyear": "2014",
      "description": "Electronic music duo Thievery Corporation surprised everyone when they straight up made a bossa nova album. I also like their other stuff, but this little foray into their brazilian roots totally captivated me. I first I kinda laughed at it because it sounds kinda cheesy, especially the very first track 'Décollage'. But I've really come to love it, as well as 'Bateau Rouge' featuring the same singer. It feels all a bit plastic but I kinda like it. We have songs in French, Spanish, Portuguese and English because why the fuck not",
      "topTracks": ["Décollage", "Meu Nego", "Sola In Citta", "No More Disguise", "Saudade", "Bateau Rouge", "Depth Of My Soul"]
    },
    {
      "filename": "seal-seal.jpg",
      "artist": "Seal",
      "name": "Seal",
      "releaseyear": "1994",
      "description": "After getting so into Sade, I obviously had to get into Seal, who, even though they never collaborated, I feel have super similar vibes. Can you believe that he named two of his albums 'Seal'? I'm still discovering all his other albums but this is the one with 'Kiss from a Rose' so I started here. All these songs have such interesting chord patterns and musical ideas. Very colourful, dynamic music that just has so much to offer. My favourite is definitely 'Prayer for the Dying' with that amazing bridge",
      "topTracks": ["Prayer For The Dying", "Dreaming in Metaphors", "Fast Changes", "Kiss from a Rose", "If I Could"]
    },
    {
      "filename": "ginger-shinbangumi.jpg",
      "artist": "Ginger Root",
      "name": "SHINBANGUMI",
      "releaseyear": "2024",
      "description": "Shoutouts to Ginger Root for recreating the vibe of Japanese 80's city pop and smashing it with these camp, funny tracks. I've been a fan since Loretta. This site is for recommending the music but I have to tell you, dear reader, to watch some of their music videos, they are so good. The videos from this album all follow a wild story and are just a ton of fun. I also really like the music too, even though it's kinda wild to hear English lyrics. This album was one of those albums where I got really obsessed with the singles as they released, then when I finally listened to the album I realised that the teaser singles were already most of the 35 minute run time! Still, I love these tracks",
      "topTracks": ["No Problems", "There Was A Time", "All Night", "Only You"]
    },
    {
      "filename": "avalanches-since.jpg",
      "artist": "Avalanches",
      "name": "Since I Left You",
      "releaseyear": "2000",
      "description": "This is a legendary and classic album, unlike anything else and 100% worth your time. It's got its roots in sample-based hip-hop beats, but it goes so crazy on the samples, in fact the whole thing consists of samples, to the point where it's this insane mess of sounds all thrown together. And it sounds great. They became famous for 'Frontier Psychiatrist' which is classic and a banger, and hilarious. 'That boy needs therapy' being the basis of the chorus is just great. They have so many great moments like this thanks to their choice of samples. I love on 'Little Journey' when the woman says 'So I'll say... bon voyage!' right before a big splash and this dramatic music as if she is walking off into the sunset and the credits start rolling. Right after that is 'Live at Dominoes' which might be THE beach party track of the century. And I love how the final track also samples the same string sample that Jens Lekman uses all over his first album. But I have to give special shout-outs to the best song, 'Since I Left You' which is the definition of a summer anthem. It's so good, so sunny, like a montage of someone's crazy travels in paradise",
      "topTracks": ["Since I Left You", "Stay Another Season", "Two Hearts in 3/4 Time", "Close to You", "Electricity", "Tonight May Have To Last Me All My Life", "Frontier Psychiatrist", "Little Journey", "Live at Dominoes"]
    },
    {
      "filename": "avalanches-wildflower.jpg",
      "artist": "Avalanches",
      "name": "Wildflower",
      "releaseyear": "2016",
      "description": "This album is huge and amazing. A perfect album for driving in your car, especially if it's a long trip. Great for singing along to with friends and generally vibing. I get that their previous album is their classic but this is my favourite for sure, I think because it's more poppy and accessible. Their signature sample-heavy music is still on full display here though. I love the addicting string loop in 'Subways' which bleeds into 'Going Home' as well but in a different way. The cute little samples like 'Isn't he great? Far out!', or 'I'm in my treehouse with my cup of coffee' are just so delightful. It's got its fair share of silliness, similar to Gorillaz Plastic Beach, psychedelic stuff too. I love love love the song 'Harmony', it sounds like someone making fun of angels descending to earth. I like the absolute drama of 'The Wozard Of Iz', the chorus of 'Sunshine' which makes you feel like you're going crazy. There's just a lot to enjoy and if you listen to it enough times you'll find some kind of story-like thread running through the whole thing",
      "topTracks": ["Because I'm Me", "Frankie Sinatra", "Subways", "Going Home", "Harmony", "The Wozard of Iz", "Sunshine"]
    },
    {
      "filename": "mum-sing.jpg",
      "artist": "múm",
      "name": "Sing Along To Songs You Don't Know",
      "releaseyear": "2009",
      "description": "This is an obscure experimental folk band from Iceland that for some reason I found on Spotify a long time ago and yeah they have like 6 albums but I exclusively listened to this one and loved it. The song titles are wild but despite that the lyrics are largely sane and the music is beautiful. Songs unlike anything else I've heard like 'A River Don't Stop To Breathe' or the incredible 'Illuminated' go through these amazing cycles of chords and it's just so hypnotic. This album feels like a little secret that I can keep for me. I also want to point out the first and last tracks which are so insanely peaceful. I save them for ultra peaceful moments",
      "topTracks": ["If I Were A Fish", "Prophecies & Reversed Memories", "A River Don't Stop To Breathe", "The Smell Of Today Is Sweet Like Breastmilk In The Wind", "Blow Your Nose", "Kay-ray-ku-ku-ko-kex", "Last Shapes Of Never", "Illuminated", "Ladies Of The New Century"]
    },
    {
      "filename": "badbad-slow.jpg",
      "artist": "BADBADNOTGOOD ft. Baby Rose",
      "name": "Slow Burn",
      "releaseyear": "2024",
      "description": "BADBADNOTGOOD are so good! They are a jazz trio who also dabble in a lot of hip hop and soul music. I love a lot of their songs but I have to say there isn't a particular album that grips me from beginning to end. That being said, they did release a bunch of EPs which I really enjoy, this one most of all. It features Baby Rose, a singer I'm still really familiar with, but she such a special voice and I'm a fan. The music feels vintage and classic and a great vibe for chill hangouts with friends. I just wish it was a whole album and not just 6 tracks!",
      "topTracks": ["On My Mind", "Slow Burn", "Caroline", "Weekness", "One Last Dance"]
    },
    {
      "filename": "beach-surfs.jpg",
      "artist": "Beach Boys",
      "name": "Surf's Up",
      "releaseyear": "1971",
      "description": "When I was around 12 or 13 I had a triple CD of the Beach Boys' best hits and I became an official Beach Boys fan. I can't really imagine how or why it happened but now I know all the Beach Boys songs! I didn't realise it back then because I was a child but I always gravitated towards the tracks they released later on in their discography. Having learned more about the band as an adult, I now get it. Towards the end of the 60s, they abandoned the surfer rock they're known for and went far more experimental. These albums didn't sell well but they are the ones with all my favourite tracks! I barely listened to full albums from them but this one I did get into in the end, because it has some of my all time faves. 'Surf's Up' is great, although don't try to read into the lyrics, they are very bewildering. 'Disney Girls' also has a special place in my heart for some reason. I love the whistling in it",
      "topTracks": ["Long Promised Road", "Disney Girls (1957)", "'Til I Die", "Surf's Up"]
    },
    {
      "filename": "jessie-that.webp",
      "artist": "Jessie Ware",
      "name": "That! Feels Good!",
      "releaseyear": "2023",
      "description": "This album is partly why I wanted to start DJing. Picture the scene, it's Horse Meat Disco and you're freaking out with all the gay dudes and Kitty and then 5 drag queens take the stage and go off to 'Free Yourself' by Jessie Ware. The room explodes because it's the queer hit of the summer and the perfect blend of disco and pop. Since that moment I have DJ'd this track maybe 5 times. It's just a very important track! And the album surrounding it is of course fantastic. I think in 2023 it was my number 1 on spotify. The opening track is also so great and so fun. A special Fraser Favourite is definitely 'Begin Again' which has this amazing feeling, I would describe it as 'desperate disco', like it's dramatic, about a serious topic, but also disco music. Crying while dancing kinda music. Also want to shout out the slower tracks 'Hello Love' and 'These Lips' which are so lovely",
      "topTracks": ["That! Feels Good!", "Free Yourself", "Pearls", "Hello Love", "Begin Again", "Beautiful People", "Freak Me Now", "These Lips" ]
    },
    {
      "filename": "jessie-pleasure.jpg",
      "artist": "Jessie Ware",
      "name": "What's Your Pleasure?",
      "releaseyear": "2020",
      "description": "Jessie decides to switch things up and drop a dance pop album and all the queers have lapped it up. I was right there lapping it up too, except it was the pandemic so I was just at home thinking about lapping it up. This album has a variety of dance music in it, but it is super disco, and it's so consistently fun and good. Perfect album to put on when preparing for the party. I especially love the deluxe version of the album with the new tracks. 'Overtime' an actual classic house banger, 'Pale Blue Light' stunning, 'Eyes Closed' hypnotising. Make sure to listen to both discs!",
      "topTracks": ["Spotlight", "What's Your Pleasure?", "Soul Control", "Save A Kiss", "Step Into My Life", "The Kill", "Remember Where You Are", "Please", "Eyes Closed", "Overtime", "Hot N Heavy", "Pale Blue Light"]
    },
    {
      "filename": "janet-velvet.jpg",
      "artist": "Janet Jackson",
      "name": "The Velvet Rope",
      "releaseyear": "1997",
      "description": "This album has so much going on. I love the ultra chill tracks 'The Velvet Rope' and 'Anything'. She is such a badass and this album takes you so many places. It's got some cheesy tracks but you gotta embrace them. Great to put on at a party at home with cool people. Free Xone is an actual bop, like a real actual Bop.",
      "topTracks": ["Velvet Rope", "Got 'Til it's Gone", "Free Xone", "Anything"]
    },
    {
      "filename": "spellling-turning.jpg",
      "artist": "SPELLLING",
      "name": "The Turning Wheel",
      "releaseyear": "2021",
      "description": "I don't claim to be a fan of the needle drop but he does good end of year lists and sometimes puts me on to some great artists, like this one! Wow, what an incredible album. It's fantastical and about magic and nature which is a pretty different aesthetic to what I'm normally going for. She's got the first half of the album which is like daytime, and the second half which is nighttime, both very different vibes. 'Boys At School' which heralds in the night is so god damn epic, 'Legacy's synth outro is almost clown-like and I love it, 'Emperor with an Egg' is literally about penguins, and I adore the very last track. Her voice is also just insane. Never heard anyone sound like this",
      "topTracks": ["Little Deer", "Always", "Awaken", "Emperor with an Egg", "Boys at School", "Legacy", "Revolution", "Sweet Talk"]
    },
    {
      "filename": "sault-rise.jpg",
      "artist": "SAULT",
      "name": "Untitled (Rise)",
      "releaseyear": "2020",
      "description": "This is a super mysterious band (collective?) who have put out a TON of material. The mastermind behind it is Inflo, legendary producer behind some of my favourite albums. This is the first Sault album I got to know and I think it's the best one. I love the almost video-game-y vibes of some of the tracks, like the first one. There's even a track called 'Street Fighter' which is a banger. And of course some danceable bangers like 'I Just Want To Dance' and 'Free'. Love love love. Soul music is alive! There's a nice comedy song in 'You Know It Ain't', eye-opening and devastating tracks in 'No Black Violins In London' and 'Scary Times'. And then I love the last two tracks so much. So peaceful and beautiful",
      "topTracks": ["Strong", "I Just Want to Dance", "Street Fighter", "Free", "You Know It Ain't", "No Black Violins In London", "Scary Times", "The Black & Gold", "Little Boy"]
    },
    {
      "filename": "tribe-thank.jpg",
      "artist": "A Tribe Called Quest",
      "name": "We got it from Here... Thank You 4 Your Service",
      "releaseyear": "2016",
      "description": "During my hip-hop phase of 2016 I got super into this album and for good reason, it's so good! I love these classic hip hop collectives which feature multiple rappers because there's so much more of a sense of community rather than just ego stuff. They bounce off each other and make silly jokes together and also let each other shine on different songs. It's just great! The beats are so creative and full of fun samples too. I always put on this album when I'm hanging out with cool normies",
      "topTracks": ["The Space Program", "Whateva Will Be", "Solid Wall of Sound", "Dis Generation", "Melatonin", "Enough!!", "Black Spasmodic", "Conrad Tokyo", "Ego"]
    },
    {
      "filename": "marvin-what.jpg",
      "artist": "Marvin Gaye",
      "name": "What's Going On",
      "releaseyear": "1971",
      "description": "This album is heaven for major 7th chord lovers like me. The guitars and strings make you feel like you're floating on clouds the whole way through from beginning to end. This music feels like flying! Soulful and also a little dramatic, which is necessary because the subject matter is very serious. Marvin explicitly addresses the climate crisis in 1971! He does it because he's fucking woke and yes, we've known that the world was going to go to shit since the 60s. Police brutality and racism of course are also playing a part in 'what's going on' and he lays it all out on the table. It almost hurts to listen to his song 'Save The Children' knowing what we do about the world today. Sorry Marvin, the kids are fucked. One other thing about this album, the songs blend into each other so well, the whole way through the album, so why didn't he do the same for the first two tracks??",
      "topTracks": ["What's Going On", "What's Happening Brother", "Mercy Mercy Me (The Ecology)", "Right On"]
    },
    {
      "filename": "lykke-wounded.jpg",
      "artist": "Lykke Li",
      "name": "Wounded Rhymes",
      "releaseyear": "2011",
      "description": "Lykke Li is so beautiful and cool. I also really like her other albums, but this is the one I come back to the most. She is definitely suffering but as a lover of sad songs I can't get enough. My favourite moments are the most intimate moments like 'Unrequited Love' or 'I Know Places'. She just sounds like she's been through some shit, yknow",
      "topTracks": ["Unrequited Love", "Sadness Is a Blessing", "I Know Places", "Jerome", "Silent My Song"]
    },
    {
      "filename": "slow-yeah.jpg",
      "artist": "Slow Club",
      "name": "Yeah, So",
      "releaseyear": "2009",
      "description": "I didn't know until looking them up for this list that Rebecca from this band went on to become 'Self Esteem'! I always wondered what happened to her because I loved these songs, and there she is, a successful and inspiring artist! These songs were firmly in my indie music phase and I really loved them. I sang 'It Doesn't Have To Be Beautiful' all the time and especially loved 'Sorry About The Doom'. Looking back I think the best song is 'I Was Unconscious It Was A Dream' about an argument sparked by saying the name of the wrong person in your sleep",
      "topTracks": ["When I Go", "Giving Up On Love", "I Was Unconscious It Was A Dream", "It Doesn't Have To Be Beautiful", "Trophy Room", "Sorry About The Doom"]
    },
    {
      "filename": "marcos-valle.jpg",
      "artist": "Marcos Valle",
      "name": "Marcos Valle",
      "releaseyear": "1983",
      "description": "I learned about Marcos Valle when I shazamed 'Estrelar' at a party and then I was transported in to the world of Brazilian pop music in the 70s/80s. Just look at the album art, it's so tacky, just like Brazil loves to serve, and I'm obsessed with it. I actually went to his concert in Berlin which was great because the crowd consisted of young gays like me or middle aged Brazilians",
      "topTracks": ["Estrelar", "Fogo do Sol", "Samba de Verão", "Naturalmente", "Dia D"]
    },
    {
      "filename": "erasmo-carlos.jpg",
      "artist": "Erasmo Carlos",
      "name": "Carlos, Eramso",
      "releaseyear": "1971",
      "description": "This is just a great Brazilian rock album that is totally worth your time. The track 'É Preciso...' is so beautiful and energising at the same time. This is the album you can put on in the background of an afternoon gathering, especially if it's in the sun",
      "topTracks": ["É Preciso Dar Um Jeito, Meu Amigo", "Sodoma E Gomorra", "Mundo Deserto", "26 Anos De Vida Normal"]
    },
    {
      "filename": "scott-passing.jpg",
      "artist": "Scott Matthews",
      "name": "Passing Stranger",
      "releaseyear": "2006",
      "description": "I just blew myself away by looking up this guy and it turns out he's English! I always assumed he was American because of the country vibe in the album. But no he's from close to where I'm from which I guess explains why I know about him in the first place. This album is giving Nick Drake. It's folky and I would describe it as colourful. Lots of lovely strings in there as well. I especially love the calm songs on this album, but I'm impressed how he can do the dream-like festival tracks ('Passing Stranger', 'Dream Song') so well as well. And 'The Fool's Fooling Himself' is so intense and good. It's like when the Tallest Man on the Earth did 'Where do my bluebird fly?' and younger me was shook that the artist would present an angry song.",
      "topTracks": ["Dream Song", "The Fool's Fooling Himself", "Sweet Scented Figure", "Passing Stranger", "Prayers", "Elusive", "Earth To Calm", "White Feathered Medicine"]
    },
    {
      "filename": "daniel-silent.jpg",
      "artist": "Daniel Rossen",
      "name": "Silent Hour / Golden Mile",
      "releaseyear": "2012",
      "description": "As a fan of Grizzly Bear and also Department of Eagles, of course I'll be keeping an eye on Daniel Rossen's solo projects. He is a visionary and I am a fan. His newer album is also great, but this little EP he released really stuck with me, in particular the song 'Saint Nothing', which was recommended by the singer from the Leisure Society. I learned how to play it on the piano and everything. All the songs are great though. The music with all the stringed instruments and banjos feels like the tingling you get from pins and needles, or drugs",
      "topTracks": ["Up On High", "Silent Song", "Return to Form", "Saint Nothing", "Golden Mile"]
    },
    {
      "filename": "morning-echo.jpg",
      "artist": "The Morning Benders",
      "name": "Big Echo",
      "releaseyear": "2010",
      "description": "I really enjoyed this album when I was doing my A levels. It's kinda indie rock which I wouldn't immediately recommend to friends because maybe it's a bit generic, but I personally really enjoy these tracks. 'Excuses' is a fun and dramatic lying in the grass track, 'Cold War' was a great track for going jogging. There's a lot to enjoy here!",
      "topTracks": ["Excuses", "Wet Cement", "Cold War", "Pleasure Sighs", "All Day Day Light"]
    },
    {
      "filename": "muse-absolution.jpg",
      "artist": "Muse",
      "name": "Absolution",
      "releaseyear": "2003",
      "description": "Alright just so it's clear I think these days that Muse is dogshit but picture young Fraser in year 7 whose brothers told him to listen to 'real music' (I was listening to Kylie at the time). At first it was so horrible and heavy! But I totally got into Muse. Listening to this album again now transported me back to my childhood years playing Runescape. Young Fraser was a cocky bastard who thought he was the bees knees, especially when it came to playing the piano, and so I was pleased to find that fans of 'real music' were enjoying the heavy use of piano in this album. When I learned to play this solo in 'Butterflies & Hurricanes' I thought it would be the key to popularity at school! Turns out when you're a child, you're delusional. I was at least. Anyway I kinda hate this band now but I'm totally rocking out to the album as I write this so fuck it, it's good. Origin of Symmetry and Showbiz too, fuck it.",
      "topTracks": ["Apocalypse Please", "Sing for Absolution", "Stockholm Syndrome", "Falling Away With You", "Blackout", "Butterflies & Hurricanes", "Endlessly", "Ruled by Secrecy"]
    },
    {
      "filename": "quadron-quadron.jpg",
      "artist": "Quadron",
      "name": "Quadron",
      "releaseyear": "2010",
      "description": "Wanted to shout out this album from Danish duo Quadron. These guys made the music behind Kendrick's 'Bitch don't kill my vibe', so you know they understand the vibe. This is the first album and it's a bit weird and idiosyncratic but I think it's kinda neat. I especially love 'Average Fruit' where she lusts after this guy. And it's quite shocking to hear actual crying on 'Far Cry'",
      "topTracks": ["Buster Keaton", "Average Fruit", "Far Cry", "Simili Life", "Herfra Hvor Vi Står"]
    },
    {
      "filename": "zero-garden.jpg",
      "artist": "Zero 7",
      "name": "The Garden",
      "releaseyear": "2006",
      "description": "",
      "topTracks": [""]
    },
    {
      "filename": "massive-heligoland.jpg",
      "artist": "Massive Attack",
      "name": "Heligoland",
      "releaseyear": "2010",
      "description": "",
      "topTracks": [""]
    }
  ]
}
