{
  "books": [
    {
      "filename": "1q84.jpg",
      "title": "1Q84",
      "author": "Haruki Murakami",
      "description": "This book is a gripping tale of two seemingly unrelated people living in a world where things don't quite seem right. Illogical things start happening, like a second moon appearing in the sky. What are you supposed to do when that happens and nobody is saying anything about it? From there the books descends into conceptual madness. There is some weird sex stuff but by the end you get used to it and realise it's part of the whole vibe. The characters are so extreme and the concepts so wild (I mean just look at the word 'Air Crysalis') that it's kinda hard to put down. It's all quite abstract and I'm honestly still trying to piece together what exactly it was about. I still really recommend it though, if nothing else but for the mental images it produces as you read it.",
      "spoiler": "I can't stop thinking about the wild sex stuff. Like what was going on with the very muscular cult leader whose body froze up sometimes and his shrine maidens mounted him against his will? And then this apparently happened to Tengo too, because he's also a Receiver. I didn't get that, because allegedly he was working against the Little People, unlike the cult leader. And why was it that spreading the story of the Little People made them weaker? I guess that's a reflection on how shedding light of myths makes them less real. But in this world the Little People seemed pretty real after all. I also didn't understand the significance of the 'moza' and 'dohta' that the Little People created with their crysalises, or why they did it with Ushikawa at the end. If you've read this book, let's talk about it because I was some concrete answers.",
      "release": "2009",
      "id": "1aad290b-e03d-47c1-a3fa-874ad639923b",
      "newsletter": true
    },
    {
      "filename": "memory-called-empire.jpg",
      "title": "A Memory Called Empire",
      "author": "Arkady Martine",
      "description": "Another insane premise - imagine when you die, a little machine that records all your memories from your lifetime gets implanted into another young person. After some therapy, the old and new person coexist inside the brain of the new person and eventually because a new person, a combination of the two. This is how a small civilisation on the edge of a space empire are able to get such highly trained people and succeed in life. It's a big secret though! The implications of this technology are huge and of course our heroine has to deal with it as an ambassador to the empire. Basically, a bunch of shit goes down at breakneck pace and it's hugely engrossing. Also this book is queer as fuck. Highly recommend.",
      "spoiler": "One thing I really enjoyed about this book is how competent and reasonable all the characters are. There really are no lackeys or hopeless people in the story! The characters are just smart, although they do also have simple emotions which I think is communicated really well. I read this right before reading another book and it hit me how nicely it was written in comparison to the other one. I can only imagine though how wild it would be to be a woman and have the mind of a man enter your brain. Like I would just have to sit there and think about genitals for a long time. Also I want to say that I love the character 'Nineteen Adze', who 'looks like sleep was a thing that happened to other people'.",
      "release": "2019",
      "id": "79323b46-532f-4e80-a81f-ae833a722b5d",
      "newsletter": true
    },
    {
      "filename": "ancillary-justice.jpg",
      "title": "Ancillary Justice",
      "author": "Ann Leckie",
      "description": "Picture this you are a person who is able to control 20 human bodies at once because they've all been implanted with brain chips which can communicate with each other. Well, normal humans don't have the brain capacity to do that I guess, but in this book, artificial intelligence does! You can imagine the ethics behind that. Next imagine you are an AI who in a dramatic moment, became separated and was just a single one of these implanted people (called Ancillaries). Super fascinating! I loved staring baffled at the page by all the mind-bending implications of this technology. It's set in a huge galactic empire, and one fun quirk of it is that everyone refers to each other with she/her pronouns, because gender is just a non-issue. A delight!",
      "spoiler": "The gender is wild because at some point the character 'Saivarden' is gendered as a man by someone from outside the empire. I remember thinking, wait, this... guy is a dude? The character acts so bratty that I slotted him/her into my 'bratty girl' mental trope, and I was forced to imagine him as a bratty man instead. The main character's biological sex is literally never revealed and I found myself asking why am I so desperate to know! This book is also part of a series and all of them are great. I love the premise of the emperor being at war with herself because of this ancillary technology. And the ending is wild when all the AIs get together and rule over their little corner of the galaxy.",
      "release": "2013",
      "id": "2e1028fc-04fb-47ed-a95e-63577929109f",
      "newsletter": true
    },
    {
      "filename": "children-of-time.jpg",
      "title": "Children of Time",
      "author": "Adrian Tchaikovsky",
      "description": "This book is insane! No other book has got me so wide-eyed when attempting to explain the premise to friends who happen to be nearby. Imagine this: humanity develops an insane gene which causes humans to evolve super quickly by genetically handing down useful information. They use this to begin a new civilisation on a new planet, because the original planet is you know, on the brink of societal collapse and all that. Except it goes horribly wrong when the gene ends up somewhere else instead. It's all about evolution and society and has real world history vibes, and features a bunch of absolutely wild ideas. I really, whole-heartedly recommend this book to everyone! It's so much fun, and it forces you to reflect on humanity as a whole. Great stuff.",
      "spoiler": "The excitement I felt when I realised we were getting spiders in space, you can't even imagine! At every step, like when they learn to communicate, or when they defeat the ants, or when they sequence the genome, were all mindblowing. When they realised that their god and creator is just a woman stuck in orbit and then just immediately dismissed it, hilarious. I guess religion only works when it's magical. Wild how their perception of 'human' is just 'Avrana Kern'. I mean, why not? That's all they know. I love it when they fuck up the humans who arrive to conquer them. So good. I was 100% on the side of the giant space spiders the whole time. This is also a series with two other books, and I also really enjoyed those!",
      "release": "2015",
      "id": "7ad87561-c41b-41da-8d3f-6624c74a724b",
      "newsletter": true
    },
    {
      "filename": "the-dispossessed.jpg",
      "title": "The Dispossessed",
      "author": "Ursula K. Le Guin",
      "description": "This book was written in the 70s and has a vision for what an anarchical society might look like. The anarchists are of course outcasts from the planet with all the capitalists, and they settle on the moon and receive their daily tasks from a very simple computer. She didn't know about all the technology that would come after this time but still manages to nail it on the head in terms of accuracy, and also vibes. She's so right about capitalism as well.",
      "spoiler": "I loved the physics stuff, and how she made it so that in her special universe spanning several books and stories, an anarchist physicist was the one who figured out how to do space warping.",
      "release": "1974",
      "id": "66dfb711-a1b0-429d-a924-e93f74eb089d",
      "newsletter": true
    },
    {
      "filename": "three-body-problem.jpg",
      "title": "The Three Body Problem",
      "author": "Cixin Liu",
      "description": "The plot of this book is fucking wild. If you are even remotely interested in physics then get excited, this book is for you. It's about a chinese lady who tries to make contact with aliens! And a detective who plays a cool virtual reality video game called 'the three body problem', and somehow those two things are related. This book has many bizarre scenarios to mull over. And it's cool because it's about science!",
      "spoiler": "My eyes definitely glazed over when it said so many words about protons and space travel and stuff, but it's fine you don't need to understand the physics stuff really. I love how the lady discovered the aliens then just figured, fuck it, they should come invade us. And it was really cool when at some point during the plot you realise wait... aliens are real! The whole thing with stable and chaotic eras was super cool. It makes you think about the Fermi Paradox and the great barrier. And how fucking metal is it that the aliens sent supercomputers hidden inside protons to fuck up science so much that all the scientists kill themselves",
      "release": "2006",
      "id": "515104cd-d67c-48d5-b2b1-1b88dd2227b6",
      "newsletter": true
    },
    {
      "filename": "to-paradise.jpg",
      "title": "To Paradise",
      "author": "Hanya Yanigahara",
      "description": "This book starts in what appears to be Victorian times except everyone in the main character's family is gay. It feels like an alternative reality where respectful people are gay. That's just one of three wild stories that this book tells. The first two just set the scene for the third one though! This book left a lasting impression on me, not just for all the scary details but for its three endings. The only or one of the only books so far on this list that isn't sci-fi! But I still recommend it.",
      "spoiler": "I loved how each story ends with the main characters going 'to paradise' and not elaborating on what that is. The first guy leaves his sheltered life and jumps into the unknown. The second guy finally leaves this crazy place in Hawaii. The third girl, who knows if she made it! All of them feel like older people looking back at crucial turning points in their lives and saying 'and that's when everything finally got better'. I didn't expect a pandemic future book but I really enjoyed it in the end. The rumblings of the 'big one' which would finally wipe out everyone, the way America inevitably turns into an authoritative hellscape, and climate change is just there too of course. So much to worry about!",
      "release": "2022",
      "id": "5be04130-366d-464c-afac-efcc9a7e9b13",
      "newsletter": true
    }
  ]
}